[
  {
    "id": "15Jjr7ozSy928q2aqqGyss",
    "title": "An Update to the Siege Community",
    "abstract": "We've been reading your feedback and recognize there are important subjects we need to address.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2b1PNeaCdjLEsKv4K9RbVe/ad04480ddf81a25eda70982634501d80/R6S_Siege_Update_960x540_v3a.jpg",
    "content": "\nWe've been reading your feedback and recognize there are important subjects we need to address.\\\nWe acknowledge that we haven't communicated clearly enough about what we've been working on since the launch of Siege X, and we understand the frustration that's caused. We're committed to improving transparency and taking meaningful action on the issues you've raised. Based on your feedback, our upcoming priorities include __anti-cheat__, __balancing__, and __ranked__ improvements. You can read about the current status of each below, with more updates coming on the road to Munich Major in November. We want to thank you all for your continued support while we work through these challenges, it means a lot.\n\n\\- Alex Karpazis and Joshua Mills, on behalf of the Siege team\n\n## ANTI-CHEAT \n\n__STATUS:__\n\nOur systems in *Siege X* did not keep pace with the surge of cheaters that followed the move to Free Access, though we have made some progress. This is a difficult topic to address without tipping off cheat makers to our next move, so without saying too much here are a few key areas the team is working to improve, backed by additional resources.\n\n__NEXT STEPS:__\n\n- Target high profile cheat makers and the use of a single notorious cheat product through advancements in Cheat Detection.\n\n- Disrupt marketplace exploits.\n\n- Issue permanent bans to players caught using these exploits.\n\n## BALANCING\n\n__STATUS:__\n\nWe've heard that updates can feel like all nerfs, no buffs, so we're changing up our approach when unexpected metas form and will prioritize a fun experience. We have high ambitions for larger system changes for the game's balancing, which will go into testing soon.\n\n__NEXT STEPS:__\n\n- In patch 3.3 (coming Oct 14) we'll be reverting Denari's nerf. We reacted a little too quickly on tuning him based on what we saw on the test server. Additionally, Denari's Glaive-12 will be buffed. \n- Solis will be receiving her impact grenades back to make her more fun to play. We can still see her influence in matches and how players use her shotgun for those post-plant situations.\n\n- For Y10S4, we can confirm that Thermite, Hibana and Maverick will all be receiving buffs. Ace will have a lot more competition! \n- Y10S4 will also introduce the Testing Grounds, a place to help us gather initial feedback and test implementation of gameplay features before they're integrated. An Armor and Speed system change for operators will be our first Testing Grounds subject. \n\n## RANKED\n\n__STATUS:__\n\nRanked 2.0 hasn't hit the mark yet and we're working on major changes. There will be matchmaking updates to start in Season 4 with more meaningful updates on the way.\n\n__NEXT STEPS:__\n\n- With Y10S4, matchmaking will get more specific with Rank and squad size factored in.\n- We are actively developing what we call Ranked Overhaul, with the objective of offering visible Ranked Reward Progression, as well as a visible Skill Progression.\n\n- Player consultations are in progress with this new system, and we'll be running workshops during the Munich Major to further refine the design.\n- We aim to have the Ranked Overhaul live in the first half of year 11. \n\n## FINAL THOUGHTS\n\nWith much of this year's focus on setting a new foundation for updates to come, recent seasonal content has understandably felt lighter, especially for veteran players. We are looking at adjusting our seasonal approach to bring more substance to mid-season updates and we will share more on this topic during the November Munich Major.\n\nThis update isn't exhaustive, but expect to hear more from us, and please continue sharing your reports, feedback, survey responses and gameplay. Your passion and commitment keep Siege growing. Your priorities are our priorities, and together we'll keep building Siege into the best it can be.   \n\nWe look forward to celebrating our tenth anniversary together!\n\n*{-}7* \n\n*The Siege Team*",
    "categories": [
      "rainbow-six-siege",
      "toxicity",
      "dev-blogs",
      "community"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/15Jjr7ozSy928q2aqqGyss/an-update-to-the-siege-community",
    "date": "2025-10-08T16:00:00.000Z"
  },
  {
    "id": "37BPFK3ZKisFFeRzq7mpPc",
    "title": "Y10S3.2 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege X with the release of Y10S3.2!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/glv7hjgmT8QZTmc7wK5pr/a385bc6e4a95d218fc8d29fdc25cc758/PATCH_NOTES_Y10S3.2_960x540.jpg",
    "content": "\nSee the upcoming changes with the release of Y10S3.2.\n\n## OPERATOR BALANCING\n\n### DENARI\n\n- T.R.I.P. Connector reactivation time increased to 1 second after their line of sight has been blocked by an operator, gadget, or object.\n\n## BUG FIXES \n\n### GAMEPLAY \n\nFIXED - The Elevate 2025 unique ability skin for the Ballistic Shield is missing from the Elevate Weapon Kit 2025 bundle.\n\nFIXED - An orange crate sitting on a table is misaligned on the Dual Front map.\n\nFIXED - Two crates of Pears are misaligned on the Dual Front map.\n\nFIXED - An apple crate is positioned incorrectly on the Dual Front map.\n\nFIXED - A peppers crate is out of place on the Dual Front map.\n\nFIXED - Wood planks are incorrectly aligned with the structural metal struts on the Dual Front map.\n\nFIXED - Metal strut meshes near drone vents have uncapped ends causing visual inconsistencies on the Dual Front map.\n\nFIXED - Reinforcement panels can't be deployed on a destructible wall due to clipping columns on the Dual Front map.\n\nFIXED - Cables hanging from ceiling clip through a tire on the Dual Front map.\n\nFIXED - Metal studs are uncapped near hatches on the Dual Front map.\n\nFIXED - Keyboards overlap with each other on the Dual Front map.\n\nFIXED - Folder organizer is not placed correctly on a toolbox in Dual Front map.\n\nFIXED - Papers on corkboard don't disappear when the corkboard is destroyed on the Dual Front map.\n\nFIXED - Misplaced invisible wall causes devices to bounce back at the player on the Dual Front map.\n\nFIXED - Collision on drone vents is misaligned causing deployable devices to clip into the surface on the Dual Front map.\n\nFIXED - Collision on shutters is misaligned causing deployable devices to clip into the surface on the Dual Front map.\n\nFIXED - Missing collision from metal struts in the ceiling of the Pawn Shop causes devices to pass through them on the Dual Front map.\n\nFIXED - Drones appear to be floating when positioned on top of the light fixture due to a slight collision mismatch on the Dual Front map.\n\nFIXED - Collision on corridor wall is misaligned causing deployable devices to clip into the surface on the Dual Front map.\n\nFIXED - Papers attached to a board don't have collision causing devices to clip through them on the Dual Front map.\n\nFIXED - Collision on sandbags is misaligned causing deployable devices to float above the object on the Dual Front map.\n\nFIXED - Red ping and scanning functionality on drones doesn't appear as expected.\n\nFIXED - Collision on wall is misaligned causing the wall to extend into the doorway on the Dual Front map.\n\nFIXED - View Moderated Chat button is missing from the player profile side panel.\n\nFIXED - Buck's Skeleton Key doesn't have the magazine count when in use.\n\nFIXED -  The building on the Oregon map has graphical issues. \n\nFIXED - Missing text in the toast message for unlocking Card Background and Operator Portraits in the Competitive Pack Collection. \n\nFIXED -  Tubarão's Zoto Canister leaves a frozen VFX on reinforced walls after deployment. \n\nFIXED - The Evolving Rampart Universal Card Background displays a placeholder name in the customization menu. \n\nFIXED - Newer notifications appear below older ones in the Notification Center. \n\nFIXED - The Pre-Reverse Friendly Fire ticker message displays real player names at the start of the match, even when the Rename Other Players option is enabled. \n\nFIXED - Valkyrie's Quintessence of Form victory dance displays duplicated Black Eye visual effects on the right side of the screen during the MVP sequence. \n\n### OPERATORS \n\nFIXED - Rauora's D.O.M. Panel Launcher won't deploy if she removes a barricade while holding the gadget. \n\nFIXED - Valkyrie's Black Eye camera loses connection when deployed near a light fixture in the 1F Lobby on Bank map. \n\n### USER EXPERIENCE \n\nFIXED - Players are not de-anonymized in the After Action Report with the End of Match Name Reveal option enabled. \n\nFIXED - De-anonymization option lacks functionality and is missing its description in the settings menu. \n\nFIXED - Sandy Straps Operator Card foreground displays a placeholder name. \n\nFIXED - Kaid, Blitz, and Melusi's Operator portraits display a placeholder name. \n\nFIXED - Players can place a drone inside the walls at 2F Bunks on the Favela map. \n\nFIXED - Players are disconnected from the session with a connection error during normal gameplay. \n\nFIXED - Voice Chat is not muted when disabled. \n\nFIXED - Players clip through the roof when vaulting and retrieving a claymore during a network interruption. \n\nFIXED - An unintended collision on the 2F Main Stairs wall allowed players to place a drone mid-air. \n\n### AUDIO \n\nFIXED - Footstep SFX for 'Sprint Start' and 'Sprint Stop' were being triggered twice. \n\nFIXED - Gunshot SFX are muffled when fired from outside toward the hostage extraction site.   \n\nFIXED - Gunshot SFX are muffled when firing from inside a building toward the outside in the West Neutral Sector of the Nighthaven map.\n\n---\n\nJoin the discussion on [X](https://twitter.com/Rainbow6Game/), [Instagram](https://www.instagram.com/rainbow6game/), [Reddit](https://www.reddit.com/r/Rainbow6/), [Discord](https://discord.gg/rainbow6), [Facebook](https://www.facebook.com/Rainbow6/), and [TikTok](https://www.tiktok.com/@rainbow6game).\n\nEncountering a bug? Report your experience at [R6Fix](https://r6fix.ubi.com/).",
    "categories": [
      "patch-notes",
      "rainbow-six-siege"
    ],
    "readTime": 5,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/37BPFK3ZKisFFeRzq7mpPc/y10s32-patch-notes",
    "date": "2025-09-30T09:15:00.000Z"
  },
  {
    "id": "6dvQYAxN4h9pw9YQngEukY",
    "title": "Get 1 Free Month of Ubisoft+ Classics With an Active R6 Membership",
    "abstract": "R6 Siege Membership on PC subscribers can receive a code for a free month of Ubisoft+ Classics on PC, an evolving selection of beloved Ubisoft games.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/27GJZcNdeCEvZV9rI8mjV8/93581a0818154a83d8c45b0f1566a268/Image_preview__1_.jpg",
    "content": "\n[The R6 Membership](https://www.ubisoft.com/en-us/game/rainbow-six/siege/shop/membership), a [Rainbow Six Siege X](https://rainbow6.com/) subscription offer, now has additional perk: from now until October 29, 2025, players with an active R6 Membership on PC can receive a code for a free month* of [Ubisoft+ Classics](https://store.ubisoft.com/ubisoftplus), an evolving selection of beloved Ubisoft games including Prince of Persia: The Lost Crown, Assassin's Creed Valhalla, Far Cry 6, and more.\n\nActive R6 Membership subscribers on PC can visit this [dedicated page](https://ubi.li/VbP2H) to receive their code for a free month of Ubisoft+ Classics on PC. The code they receive can be activated at this [dedicated page](https://redeem.ubisoft.com/ubisoft-plus/) through the end of the year, expiring on December 31. Once the code is entered, the 1-month free period starts. These Ubisoft+ subscriptions are termed subscriptions that will not auto-renew; players are not required to enter any credit card information, and the Ubisoft+ subscription will expire after one month, when the termed subscription is over.\n\n[The R6 Membership](https://www.ubisoft.com/en-us/game/rainbow-six/siege/shop/membership) gives Rainbow Six Siege X players full access to the Premium Battle Pass and an additional 10 Battle Levels monthly to empower them to unlock rewards faster. Subscribers also get member-exclusive Legendary and Epic gear, a Bravo Pack and a 10% store discount in the game.\n\nUbisoft+ Classics is available on PC and PlayStation. Check out the full list of games available on [Ubisoft+ Classics here](https://store.ubisoft.com/ubisoftplus/games?offer=classics). New games are frequently added to the subscription service.\n\nPlay the Ultimate Edition of [Rainbow Six Siege X](https://rainbow6.com/) through a Ubisoft+ subscription, or jump into Free Access on PS5, PS4, Xbox Series X|S, Xbox One, and PC through the Ubisoft Store, Epic Games store, and Steam.\n\n**Limited time offer, expires on December 31st 2025. While supply lasts. No payment details required, does not renew automatically. Offer available only to players with an active PC R6 Membership who do not currently have a Ubisoft+ subscription. Ubisoft+ Classics grants access to a selection of iconic titles (list available *[*here*](https://store.ubisoft.com/ubisoftplus/games?offer=classics)*) not including new releases. *[*Terms apply*](https://ubisoft.com/legal)*.*",
    "categories": [
      "rainbow-six-siege",
      "ubisoft-plus",
      "uplay-plus"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6dvQYAxN4h9pw9YQngEukY/get-1-free-month-of-ubisoft-classics-with-an-active-r6-membership",
    "date": "2025-09-24T16:15:00.000Z"
  },
  {
    "id": "6OoPiWwd0yyvopTYGzzkt1",
    "title": "Get A Weapon Skin on Twitch During the M.U.T.E Protocol: Flesh & Metal Event!",
    "abstract": "Tune into M.U.T.E Protocol: Flesh & Metal gameplay streams  starting September 17 to earn an exclusive Weapon Skin!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5ck3CtKwEqk5ZCzofSinvy/1f5986000b5977b7e2618baa32eba127/R6X_Y10S3_MUTE_WeaponDrop_960x540.jpg",
    "content": "The M.U.T.E Protocol event is returning in its fourth iteration! We'll have Twitch Drops active on the official Rainbow Six Twitch channels and select partner streams. Be sure to tune in to M.U.T.E Protocol: Flesh & Metal gameplay streams to claim a variant weapon skin for IQ's 552 Commando for free!\n\n### Twitch Drops\n\nTwitch Drops will be live on September 17 at 9AM Pacific Time / 12PM Eastern Time and will conclude on October 1 at 9AM Pacific Time / 12PM Eastern Time.\n\n__Reward__\n\n- Watch 2 Hours: __MEMBRANE BOOSTER WEAPON SKIN__\n\n### How Do Twitch Drops Work?\n\nBe sure to follow these steps to make sure you're set up to earn Drops:\n\n- Step 1: Link your Twitch account and Ubisoft account. [Click here to link accounts now](https://drops-register.ubi.com/).\n- Step 2: Watch eligible streams. You'll earn progress toward various items by watching streams for 30 minutes or more. See above for details on how to get each available item.\n\n- Step 3: Claim Your Rewards. When you've earned a Drop, be sure to claim it in your Twitch Inventory. Once complete, your rewards will be waiting for you in-game.",
    "categories": [
      "community",
      "rainbow-six-siege"
    ],
    "readTime": 1,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6OoPiWwd0yyvopTYGzzkt1/get-a-weapon-skin-on-twitch-during-the-mute-protocol-flesh-metal-event",
    "date": "2025-09-16T16:00:00.000Z"
  },
  {
    "id": "5NU5MpUyV3W8iN0kVt0pr8",
    "title": "Y10S3.1 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege X with the release of Y10S3.1!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7mIzTXsquVicON7tbUy0AB/a41b6a3e67e9c87d4f84ad4528896c0b/PATCH_NOTES_Y10S3.1_960x540.jpg",
    "content": "See the upcoming changes with the release of Y10S3.1.\n\n## DUAL FRONT\nAdded FIRST FRONT, a new Daily challenge for Dual Front for 500 renown.\n\n## REPUTATION SYTEM\nVoice Chat Moderation will be enabled.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Glass on Deployable Shield doesn't shatter after hitting and the shield can't be picked up.\n\nFIXED - Scoring doesn't count when downing or killing Operators planting a sabotage kit.\n\nFIXED - The scoring doesn't work after an operator eliminates or downs an enemy operator who is destroying the sabotage kit.\n\nFIXED - Echo's Yokai Drone is destroyed when jumping to the ceiling and passing through Denari's T.R.I.P. Connector.\n\nFIXED - Defenders are killed after a few seconds when remaining in an area where the 2nd node is lost in Dual Front.\n\n### OPERATORS\n\nFIXED - Freeze VFX missing from Tubarao's Zoto Canister during default reinforcement.\n\n### USER EXPERIENCE\n\nFIXED - Rename Other Player reveals the real name and the fake name of a player when reporting before the After Action Report.\n\nFIXED - Lobby is empty at the end of any custom match.\n\nFIXED - Glaive-12 shotgun doesn't hit an Operator's body when the shot hits a limb first.\n\nFIXED - Win Neutral Zone event and Win the Match challenges for Dual Front don't work.\n\nFIXED - Solis's SPEC-IO Electro Sensor Overclock HUD breaks when a Solis on each team use the ability at the same time in Dual Front.\n\nFIXED - \"Failed to do the action\" message pops up when trying to cancel an invite sent between Xbox consoles.   \n\nFIXED - Game becomes unplayable when a match starts while having moderated chat open.\n\nFIXED - Reconnect option and header are missing when leaving a playlist that has reconnect available.  \n\nFIXED - Uncommon rarity tag is not displayed in the 3D preview.\n\nFIXED - Banner image missing on Memento tile.\n\n---\n\nJoin the discussion on [X](https://twitter.com/Rainbow6Game/), [Instagram](https://www.instagram.com/rainbow6game/), [Reddit](https://www.reddit.com/r/Rainbow6/), [Discord](https://discord.gg/rainbow6), [Facebook](https://www.facebook.com/Rainbow6/), and [TikTok](https://www.tiktok.com/@rainbow6game).\n\nEncountering a bug? Report your experience at [R6Fix](https://r6fix.ubi.com/).",
    "categories": [
      "patch-notes"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5NU5MpUyV3W8iN0kVt0pr8/y10s31-patch-notes",
    "date": "2025-09-16T09:15:00.000Z"
  },
  {
    "id": "1gy7bEMyfiEMDmkZhTzTyb",
    "title": "Y10S3 Patch Notes Addendum",
    "abstract": "See the changes made over the course of the Y10S3 Season Test Server.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3uDAJe2Wn9iXux9AvNpcud/9504af9fa6fa2ca8855b0e0615ade89f/PATCHNOTES_ADDENDUM_Y10S3_960x540.jpg",
    "content": "\nFind the updates and fixes made over the course of the Y10S1 Season Test Server. Check out the full Operation High Stakes Patch Notes [here](https://rainbow6.com/highstakes).\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Player collects points twice when deploying Azami's Kiba Barrier.\n\nFIXED - The check mark indicating the respawn prompt doesn't update correctly.\n\nFIXED - Refined trigger zone at Assembly Tank to block defuser placement via lag switch exploit. Players can still enter the tank, but planting is no longer possible.\n\nFIXED - Idle kick fails to trigger when switching from mouse and keyboard to controller input while using Observation Tools.\n\nFIXED - The iron sight on Denari's Glaive-12 is zoomed in while aiming down sights.\n\nFIXED - The epilepsy tool reports Spatial Pattern Caution while watching the 1F CC Stairs on Nighthaven Labs map.\n\nFIXED - Progress bar for Solis's overclock ability isn't refilling and shows incorrect ammo count.\n\nFIXED - Rauora's D.O.M. Panel doesn't auto-destroy upon changing Operators.\n\nFIXED - Shields don't transition properly when switching from aiming down sights to equipping or throwing a grenade in first-person view.\n\nFIXED - AI Operators can get stuck in rappel.\n\nFIXED - Level of detail issue with the red tape at the end of Fuze's Cluster Charge device.\n\nFIXED - Shield deploy icon is present during the barricade deployment animation.\n\nFIXED - AI Operators become inactive when they can't find a spot to camp for enemies.\n\nFIXED - AI Operators gets stuck on a vaultable object located next to the hatch on the exterior Café Rooftop, above the 3F Cigar Balcony, on the Kafe Dostoyevsky map.\n\nFIXED - After triggering Lesion's GU Mine, the bot turns to face the mine's last point of interest.\n\nFIXED - AI Operators become stuck after being revived from Frost's Welcome Mat.\n\nFIXED - Very bright light bleeds are present in basement floor on Bank map.\n\nFIXED - The hostage doesn't cast any shadows when they're being escorted by the Attackers.\n\nFIXED - Alibi's Prisma doesn't open when deployed at 2F CCTV Room on Club House map.\n\nFIXED - Alibi's Prisma doesn't open when deployed at 2F Gym and 2F Bedroom on Club House map.\n\nFIXED - AI Operators use of throwable gadgets can miss their target by a wide margin.\n\nFIXED - Operators with sticky devices can force crash a match by deploying the device at the same time as Bandit's Shock Wire.\n\nFIXED - Black textureless objects obstructs drone vision when passing through the vent at EXT Garage Ramp on Bank map.\n\nFIXED - Denari's T.R.I.P. Connector can be seen floating when entering Denari's Customization tab.\n\nFIXED - Old studs are still visible in the ceiling panels above the line of scrimmage area in Kafe Dostoyevsky map.\n\nFIXED - Playlists become unresponsive when sixth member leaves the Squad.\n\n### LEVEL DESIGN\n\nFIXED - Exterior is overexposed when viewed from inside.\n\nFIXED - Non-destructible walls DAB Core walls are overlapping with most of the blocked windows on the third floor level on Kafe Dostoyevsky map.\n\n### OPERATORS\n\nFIXED - Glaive-12 aim down sights timing was incorrect.\n\nDenari T.R.I.P Connector laser re-activation changed from 4 seconds to 8 seconds, and damage per laser changed from 20 to 15.\n\n### USER EXPERIENCE\n\nFIXED - The Quit Matchmaking button from the Dynamic Play Button no longer displays a door icon.\n\nFIXED - Players are able to see shadows through some solid objects.\n\nFIXED - Cannot open pause menu in repick menu with controllers.\n\nFIXED - Players can't scroll down in the Latest section of the Locker when hovering over an Operator Portrait or Card Background.\n\nFIXED - Defenders affected by Grim's Kawan Hive don't see Kawan bot VFX on screen.\n\nFIXED - Data for championship stage isn't displaying when including multiple groups in the Esports section.\n\nFIXED - The final leaderboard can't be fully scrolled on the overview section when players select a completed championship stage in the Esports section.\n\nFIXED - Navigation stops working when pressing right and not selecting a tile while in the Esports championship section.\n\nFIXED - Attacker loses control of their drone when another player spectates it during the Preparation Phase.\n\nAUDIO\n\nFIXED - Melee SFX missing when doing a melee strike.\n\n---\n\nJoin the discussion on [X](https://twitter.com/Rainbow6Game/), [Instagram](https://www.instagram.com/rainbow6game/), [Reddit](https://www.reddit.com/r/Rainbow6/), [Discord](https://discord.gg/rainbow6), [Facebook](https://www.facebook.com/Rainbow6/), and [TikTok](https://www.tiktok.com/@rainbow6game).\n\nEncountering a bug? Report your experience at [R6Fix](https://r6fix.ubi.com/).",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1gy7bEMyfiEMDmkZhTzTyb/y10s3-patch-notes-addendum",
    "date": "2025-09-02T21:15:00.000Z"
  },
  {
    "id": "3OoYDaNafgLqmOeGiFSKrs",
    "title": "Celebrate Y10S3 Season Launch with new Twitch Drops and TikTok Rewards!",
    "abstract": "Tune into new season gameplay streams starting September 2 to earn an exclusive Weapon Charm and Alpha Packs!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7G0OEuQir1DJ7MuF5KDT6s/1afa177a5d446100dacc75916f85c70b/Y10S3_keyart_960x540.jpg",
    "content": "Y10S3 arrives September 2! This season brings a new defense operator, freshly modernized maps, and much more. We'll have Twitch Drops active on the official Rainbow Six Twitch channels and select partner streams, and TikTok Rewards will be available to claim via any channel streaming Siege X content. The rewards are different on each platform, so be sure to tune in on both and claim them all for free!\n\n## Twitch Drops\n\nTwitch Drops will be live on September 2 at 9AM Pacific Time / 12PM Eastern Time and will conclude on September 9 at 9AM Pacific Time / 12PM Eastern Time.\n\n- Watch 90 Minutes: __HIGH STAKES COUNTDOWN CHARM__\n\n## TikTok Game Rewards\n\nTikTok Rewards will be live on September 2 at 9AM Pacific Time / 12PM Eastern Time and will conclude on October 2 at 9AM Pacific Time / 12PM Eastern Time.\n\n- Watch 3 Minutes: __3x ALPHA PACKS__\n\n## How Do Twitch Drops Work?\n\nBe sure to follow these steps to make sure you're set up to earn Drops:\n\n- Step 1: Link your Twitch account and Ubisoft account. [Click here to link accounts now](https://drops-register.ubi.com/).\n- Step 2: Watch eligible streams. You'll earn progress toward various items by watching streams for 30 minutes or more. See above for details on how to get each available item.\n\n- Step 3: Claim Your Rewards. When you've earned a Drop, be sure to claim it in your Twitch Inventory. Once complete, your rewards will be waiting for you in-game.\n\n## How Do TikTok Game Rewards Work?\n\n- Step 1: Watch a participating TikTok creator livestreaming Siege X gameplay. Participating channels will display a \"Game Rewards\" tag in the top-right corner of the stream.\n- Step 2: After 3 minutes of watch time, Click the Share arrow in the lower-right and select the Game Rewards icon to view and claim the reward.\n\n- Step 3: You will receive a code for your reward that you can redeem through this website: [https://redeem.ubisoft.com/rainbow6-siege](https://redeem.ubisoft.com/rainbow6-siege/). You must log in with your Ubisoft account (or create a new one) to enter the code. After redeeming the code to your Ubisoft account, the items can be found in your in-game inventory.\n- *Note**: Redeemable codes will be active until August 23, so make sure to redeem within the allocated time.*\n\nIf you are a streamer and are looking for info on future creator opportunities for Rainbow Six Siege X, be sure to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/).",
    "categories": [
      "community"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3OoYDaNafgLqmOeGiFSKrs/celebrate-y10s3-season-launch-with-new-twitch-drops-and-tiktok-rewards",
    "date": "2025-09-01T16:00:00.000Z"
  },
  {
    "id": "30q1fnyXFaLBPOdc3pzDEp",
    "title": "Y10S3 Streamer Charm",
    "abstract": "New Rainbow Six Siege Streamer Charm for Y10S3!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7AkhSTBhIObWsttB9L5enM/3c3d92e7808ba2ed99a3744c6b44d65a/Y10S3_Streamer_Charm_New_960x540.jpg",
    "content": "# New Rainbow Six Siege Streamer Charms for Y10S3!\n\n## Announcing the next Streamer Charm!\n\nEach season will bring the release one new charm, as well as the return of streamer charms from previous seasons! Check out this season's newest charm recipient below, and read on for further updates on the Streamer Charm program.\n\n## New\n\n![[R6S] Y10S3 Influencer Charm - new-thumbnail](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7AkhSTBhIObWsttB9L5enM/3c3d92e7808ba2ed99a3744c6b44d65a/Y10S3_Streamer_Charm_New_960x540.jpg)\n\n[Shaiiko](https://www.twitch.tv/shaiiko)\n\n## Returning\n\n![[R6S] Y10S3 Influencer Charm - 1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5l9KOAtNn69easMrGNQ5qL/a28b34c6969632ad639fafce34936f23/Y10S3_OldCharms_1.jpg)\n\n![[R6S] Y10S3 Influencer Charm - 2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7H6i2ujyWH9Y4wF4lxKFUp/43d0eca6eda84f55f2819c27039bdcae/Y10S3_OldCharms_2.jpg)\n\n![[R6S] Y10S3 Influencer Charm -  3](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2wc6FcuOp4MEChmLoorFU6/faea1529041f6e0db4a4292afb02feec/Y10S3_OldCharms_3.jpg)\n\n![[R6S] Y10S3 Influencer Charm - 4](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1j8bKiLaKqOWx4i4SF9g2b/39f6e3b47b117f6994200a37e88dbf32/Y10S3_OldCharms_4.jpg)\n\n![[R6S] Y10S3 Influencer Charm -  5](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3lXehs4in92bqnjwJaVDWh/555712e793a63a96af6951a1df515267/Y10S3_OldCharms_5.jpg)\n\n![[R6S] Y10S3 Influencer Charm - 6](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1d8amEEHUtuCPLw8GD0zI0/1af0cab407af59c44ed0758a203fc9d2/Y10S3_OldCharms_6.jpg)\n\n![[R6S] Y10S3 Influencer Charm - 7](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4aKWG8vv4N2uc6HaIDkzgW/179d561c4ff9f5e61ac53b45d6f9842b/Y10S3_OldCharms_7.jpg)\n\n![[R6S] Y10S3 Influencer Charm -  8](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2HqekZIUuMqNn0l74YZ5MY/32fab72c20b826cde2ccee0f1639f596/Y10S3_OldCharms_8.jpg)\n\n- [Alfredoplays](https://www.twitch.tv/alfredoplays)\n- [AnneMunition](https://www.twitch.tv/annemunition)\n- [Beaulo](https://www.twitch.tv/beaulo)\n- [Bighead](https://www.twitch.tv/bighead033)\n- [BikiniBodhi](https://www.twitch.tv/bikinibodhi)\n- [Bnans](https://www.twitch.tv/bnans)\n- [Braction](https://www.twitch.tv/bractionfps)\n- [Drid](https://www.twitch.tv/dridgg)\n- [FastAnne](https://www.twitch.tv/fastanne)\n- [Gabbo](https://www.twitch.tv/JustGabbo)\n- [Heideltraut](https://www.twitch.tv/heideltraut)\n- [Interro](https://www.twitch.tv/interro)\n- [JerichoFive](https://www.twitch.tv/jerichofive)\n- [JessGOAT](https://www.twitch.tv/jessgoat)\n- [Jynxzi](https://www.twitch.tv/jynxzi)\n- [Just9n](https://www.twitch.tv/just9n)\n- [KingGeorge](https://www.twitch.tv/KingGeorge)\n- [KittyR6](https://www.twitch.tv/kitty_r6)\n- [LagonisR6](https://www.twitch.tv/lagonis)\n- [Lil_Lexi](https://www.twitch.tv/lil_lexi)\n- [Lt Custard](https://www.twitch.tv/lt_custard)\n- [Lusorkoeffizient](https://www.twitch.tv/lusorkoeffizient)\n- [MacieJay](https://www.twitch.tv/MacieJay)\n- [Mag6](https://www.twitch.tv/mag6)\n- [M3ry](https://www.twitch.tv/m3ry)\n- [Matimi0](https://www.twitch.tv/matimi0)\n- [MrBboy45](https://www.twitch.tv/mrbboy45)\n- [Narcoleptic Nugget](https://www.twitch.tv/narcolepticnugget)\n- [Nesk](https://www.twitch.tv/neskwga)\n- [PaladinAmber](https://www.twitch.tv/paladinamber)\n- [Patife](https://www.twitch.tv/patife)\n- [Pengu](https://www.twitch.tv/pengu)\n- [RazaH](https://www.twitch.tv/razah)\n- [REMGURI / 렘쨩](https://www.twitch.tv/remguri)\n- [Rubsarb](https://www.twitch.tv/Rubsarb/)\n- [SexyCake](https://www.twitch.tv/smexycake)\n- [Sha77e](https://www.twitch.tv/sha77etv)\n- [Shorty](https://www.twitch.tv/shortyyguy)\n- [shroud](https://www.twitch.tv/shroud)\n- [SilphTV](https://www.twitch.tv/silphtv)\n- [Tatted](https://www.twitch.tv/tatted)\n- [Tranth](https://www.twitch.tv/tranth)\n- [Varsity](https://www.twitch.tv/varsitygaming)\n- [WhiteShark67](https://www.twitch.tv/whiteshark67)\n- [yo_boy_roy](https://www.twitch.tv/yo_boy_roy)\n- [z1ronic](https://www.twitch.tv/zironicdk)\n- [Zander](https://www.twitch.tv/zander)\n- [ziGueira](https://www.twitch.tv/zigueira)\n- [GarfieldIsDoc](https://www.twitch.tv/garfield)\n- [Supr](https://www.twitch.tv/supr)\n- [RyyFyy](https://www.twitch.tv/ryyfyy)\n- [FoxA](https://www.twitch.tv/foxa_r6)\n- [Nerdengenheiro](https://www.twitch.tv/nerdengenheiro)\n- [Rainbow6itacom](https://www.twitch.tv/rainbow6itacom)\n- [Minimichegga](https://www.twitch.tv/minimichegga)\n- [JostRekt](https://www.twitch.tv/jost)\n- [JustRyuk](https://www.twitch.tv/justryuk)\n- [Paluhh](https://www.twitch.tv/paluhh)\n- [Poxonlox](https://www.twitch.tv/poxonlox)\n- [TheLionerYT](https://www.twitch.tv/thelioneryt)\n- [itsSpoit](https://www.twitch.tv/itsspoit)\n- [Retalha](https://www.twitch.tv/retalha)\n- [FooYa](https://www.twitch.tv/fooya)\n- [IceCold](https://www.twitch.tv/icecold)\n- [Athieno](https://www.twitch.tv/athieno)\n- [Marciu](https://www.twitch.tv/marciu)\n- [Rembeey](https://www.twitch.tv/reembey)\n- [rasco100](https://www.twitch.tv/rasco100)\n- [Vetelcito01](https://www.twitch.tv/vetelcito01)\n- [OneShooter](https://www.twitch.tv/oneshooter)\n- [Scythe](https://www.twitch.tv/scythe)\n- [Jenz](https://www.twitch.tv/jenz)\n- [Frankystrings](https://www.twitch.tv/frankystrings)\n- [Eternal_regina](https://www.twitch.tv/eternal_regina)\n- [Pxppy](https://www.twitch.tv/eternal_regina)\n- [Skyte](https://www.twitch.tv/skyte)\n- [Ru_rumiiiin](https://www.twitch.tv/ru_rumiiiin)\n- [Anifex](https://www.twitch.tv/anifex)\n- [Vetelcito](https://www.twitch.tv/vetelcito01)\n- [Priest](https://www.twitch.tv/omgitspriest)\n- [Nonomiyamika](https://www.twitch.tv/nonomiyamika)\n- [alyttleton](https://www.twitch.tv/alyttleton)\n- [MeatyMarley](https://www.twitch.tv/meatymarley)\n- [ThatOneBritt](https://www.twitch.tv/thatonebritt)\n- [TitaniumRolo](https://www.twitch.tv/titaniumrolo)\n- [KeTo](https://www.twitch.tv/keto)\n- [Ooziie](https://www.twitch.tv/oozie)\n\n## Streamer Charm Program Update\n\nIn Year 10, we are bringing some changes to the Streamer Charm program by moving to __one__ exclusive new creator charm per season.\n\nOur goal with this adjustment is to introduce a brand new seasonal charm later this year that will be available to even more creators.\n\nAs part of this program update, we are also refining our selection criteria; in addition to recognizing established creators, we'll be highlighting up-and-coming talent in the Siege community. These fresh new faces are chosen for their promising future in the Siege space.\n\nStay tuned! We will be revealing more details on this new seasonal charm and associated criteria toward the end of the first season.\n\n## Screening Procedure\n\nWe have implemented additional screening procedures into our selection process for streamer charms.\n\nUpon selection for the program, streamer charm candidates' main and alt accounts are now screened for MouseTrap violations, gameplay violations, and histories of toxicty, in addition to the other screening steps they undergo for eligibility.\n\n## How to acquire charms\n\nThese charms are only available by subscribing to the respective streamer's Twitch channel with a linked Ubisoft account. For more information on how to link your Ubisoft and Twitch account, as well as opt in for Twitch Drops, please refer to [this FAQ](https://support.ubi.com/Faqs/000035432/Get-your-Twitch-Streamer-s-charm).\n\n## How to get involved\n\nWe have updated the Ubisoft Creators Program registration to open the program to TikTok and Instagram, therefore opening new collaboration opportunities for content creators, streamers, fan artists, and cosplayers from our community.\n\nWe are always on the lookout for content creators that inspire and enrich the Siege community. If you would like access to the perks of being a partnered content creator, and your goal is to one day have a charm in the game, we would like to invite you to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/en-us).\n\nFrom there, complete the following steps:\n\n1. Connect your Ubisoft Account. If you do not have one, you can create one [here](https://connect.ubisoft.com/create).\n\n2. Agree upon the eligibility criteria.\n\n3. Connect your primary channel (Twitch, YouTube, TikTok, Instagram) or secondary channels.\n\n4. Indicate your games preferences.\n\n5. Set your location, broadcast language, and communication language.\n\nYour application will then be submitted and must be approved by Ubisoft. An email will be sent to confirm your participation.",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/30q1fnyXFaLBPOdc3pzDEp/y10s3-streamer-charm",
    "date": "2025-08-29T15:45:00.000Z"
  },
  {
    "id": "4czc3hlHtXrd27crELGDcc",
    "title": "Y10S3 Designer’s Notes",
    "abstract": "In this latest edition of Designer’s Notes, we'll go into more detail about the balancing changes that’ll come with the Y10S3 update and give you some insight into the reasons behind them.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1aJ9K3aXY0l6AYtG8j0asK/207e5ca97ce9837397f0135a486a9fe9/R6S_Y10S3_DN_Header_960x540_v2.jpg",
    "content": "In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y10S3 update and give you some insight into the reasons behind them.\n\n## BALANCING MATRIX AND TOP OPERATOR BANS\n\n## WIN DELTA VS. PRESENCE\n\n![[R6S] Y10S3 Designer's Notes R6S DN Y10S3 BalancingMatrix ATT](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3XuYaTSCAGqsj786MnFIjv/218f8043288f63e7ee8e89cd461f0e4c/R6S_DN_Y10S3_BalancingMatrix_ATT.mp4)\n\n![[R6S] Y10S3 Designer's Notes R6S DN Y10S3 BalancingMatrix DEF](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2RmtPSHy6iZFYZuvyCLEcN/25170407eb5861e6043bc8caac43c20a/R6S_DN_Y10S3_BalancingMatrix_DEF.mp4)\n\n## OPERATOR BAN RATE\n\n![[R6S] Y10S3 Designer's Notes R6S DN Y10S3 BanMatrix ATT](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5Y7EfrErxO5g9pgvFqHeG1/aa912e203ceb1c0543d2249808968a7e/R6S_DN_Y10S3_BanMatrix_ATT.mp4)\n\n![[R6S] Y10S3 Designer's Notes R6S DN Y10S3 BanMatrix DEF](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1AJKfObsaZfYuwr60VC3TG/c18e0700b879c07fde2efab27b9ca269/R6S_DN_Y10S3_BanMatrix_DEF.mp4)\n\n# OPERATOR BALANCING\n\n## BLACKBEARD\n\nBlackbeard's Kill/Death Ratio has not shown any variation since its release, and stays stable at 0.9. Blackbeard's abilities and loadout make him a very versatile pick that holds great offensive capabilities. In this patch we would like to keep his versatility while slightly reducing his offensive capabilities.\n\nThe first group of changes attend to Blackbeard's Aim Down Sight (ADS) mechanics. He will be slower to leave ADS, making him more vulnerable in that state. He also won't be able to ADS while rappelling in through a window.\n\nThe second group of changes are related to Blackbeard's Weapon Reloads. Now the H.U.L.L Shield will fold completely during the reloads, exposing most of Blackbeard's body to the enemies. The MK-17 will also see its magazine capacity reduced from 25 to 20. This should make Blackbeard reload more often and with higher risk.\n\nThe third group of changes aim to make Blackbeard a bit slower. While on rappel he won't be able to Breach In through non-weakened barricades, and we've also reduced his H.U.L.L Shield Breach Charges to from 4 to 3.\n\n### H.U.L.L. ADAPTABLE SHIELD\n\n- ADS Changes\n  - Blackbeard ADS recovery time set to 0.9s (was 0.5s).\n  - Blackbeard can't ADS while rappelling in a window.\n- Reload Changes\n  - Blackbeard's H.U.L.L. Shield completely folds while reloading.\n- Mobility Changes\n  - Blackbeard cannot breach-in from rappel through non-weakened barricades.\n  - H.U.L.L. Shield Breach Charges reduced to 3 (was 4).\n\n## ECHO\n\nEcho is losing the Magnified Sight on his MP5SD; he will no be more inclined to take fights at closer range and we ant to boost his mobility to make repositioning easier for him.\n\n### BASE STATS\n\n- __Speed:__ Increased to 2 (from 1).\n- __Health:__ Reduced to 2 (from 3).\n\n## FENRIR\n\nFenrir's ability has a high impact on Attackers. Since the last changes we made to him, it is easier to counter his traps, but we still consider his ability to be quite strong. We want to make the full Fenrir package a bit leaner by removing some of the extra utility that the Bailiff brings to the table. Players will need to rely on other defenders to set up the site.\n\n### LOADOUT\n\n- __Secondary Weapons:__ Removed Bailiff 410.\n\n## LESION\n\nLesion has become one of the most reliable roamers. The combination of a great loadout, plus an ability that is useful for gathering intel and slowing enemies makes him a great option. The removal of the Magnified Sights on some Operators will make him more relevant. We are removing Lesion's shotgun to increase Lesion's focus on his ability, inviting Defenders to source destruction capabilities on the team from other loadouts.\n\n### LOADOUT\n\n- __Secondary Weapons:__ Removed Super Shorty.\n\n## ORYX\n\nOryx's playstyle relies on mobility and quick reactions. A machine pistol provides high firepower and a quicker ADS compared to a submachine gun, allowing him to stay agile and effective in mid-range engagements. However, he will need to make more strategic decisions based on the situation, as selecting the Reaper MK2 without the SPAS-12 will leave him without the tools to destroy hatches. We believe that this addition will make him more adaptable and capable of handling a variety of combat situations while increasing the loadout variety.\n\n### LOADOUT\n\n- __Secondary Weapons:__ Added Reaper MK2.\n\n## PULSE\n\nPulse greatly benefits from using the M1014, but the lack of a reliable secondary weapon limits its use in various situations. Since the recent improvements to shotguns, which significantly reduced the M1014's visual recoil for better comfort, its pick rate has stabilized at 29%. However, we believe that this rate is still below its potential, given its synergy with the Cardiac Sensor.\n\nBy introducing the Reaper MK2, we aim to provide Pulse with greater flexibility and ensure he doesn't feel powerless when opting to use the shotgun. Additionally, we believe that every weapon in his loadout has its own playstyle and fulfills different needs. The UMP45 will remain the most reliable option for long to mid-range engagements, while the M1014 and Reaper MK2 combination may be more appealing to mid to close-range play. And, of course, the handguns are always a reliable choice in any situation.\n\n### LOADOUT\n\n- __Secondary Weapon:__ Added Reaper MK2.\n\n## ROOK\n\nRook's capability to hold long angles will be reduced due to the removal of Magnified Sights from his loadout. To reinforce his anchor role, we would like to add an alternative side weapon and gadget: the Reaper MK2 and C4. Both elements should reinforce his strength on close and mid-range engagements.\n\n### LOADOUT\n\n- __Secondary Weapon:__ Added Reaper MK2.\n- __Gadgets:__ Removed Observation Blocker. Added Nitro Cell.\n\n## SENTRY\n\nSentry is designed to fill any gaps in the defensive setup. However, with the current loadout he struggles to hold long angles comfortably. Therefore, we have decided to add a Slug Shotgun to his loadout. This addition will enhance his capability in long-range engagements while assisting with site setup.\n\n### LOADOUT\n\n- __Primary Weapon:__ Added TCSG12.\n\n## SLEDGE\n\nThe Reaper MK2 is less lethal than other Machine Pistols in the game, and that makes it suitable for a wider group of Operators. The addition of the Reaper MK2 will give Sledge a secondary weapon alternative that works good at close ranges.\n\n### LOADOUT\n\n- __Secondary Weapon:__ Added Reaper MK2.\n\n## STRIKER\n\nWe believe that Striker also deserves a weapon more suited for long-range engagements. The DMR will enable her to better support her teammates from a distance, and may synergize more effectively with other types of secondary utility.\n\n### LOADOUT\n\n- __Primary Weapon:__ Added SR-25.\n\n## WAMAI\n\nWe've removed a few secondary destruction tools in this patch (Lesion's and Fenrir's), but we don't want to affect the overall destruction capability of defenders too much. For this reason, Wamai will receive the Super Shorty, which will improve his usefulness during the preparation phase.\n\n### LOADOUT\n\n- __Secondary Weapon:__ Added Super Shorty.\n\n## YING\n\nThe SIX12 is highly effective at close range but is not reliable at medium to long distances. The Reaper MK2 will provide a versatile secondary option, allowing her to engage enemies effectively at various ranges and creating more opportunities to use the shotgun in close-quarters combat. She can also use the shotgun for breaching and verticality, creating more opportunities to use the Candelas from above or from unexpected angles.\n\n### LOADOUT\n\n- __Secondary Weapon:__ Added Reaper MK2.\n\n# GADGET BALANCING\n\n## DEPLOYABLE SHIELD\n\nThis change is a small quality of life improvement. In some situations, a direct source of light generates a strong glare on the shield glass windows that prevents a clear view through them. We've improved the glass materials to ensure that the glass pieces do not generate glare in these situations.\n\n### BASE STATS\n\n- __Glass:__ Light reflections reduced for better comfort\n\n### OPERATORS AFFECTED\n\n- Echo\n- Ela\n- Frost\n- Pulse\n- Sentry\n- Tachanka\n- Thorn\n- Thunderbird\n- Warden\n\n# WEAPON BALANCING\n\n## SIGHTS\n\nMagnified Sights on Defensive Operators has a huge impact on their presence and on their killing potential. This update will limit defenders' access to these sights on automatic weapons. We still believe that defenders should be able to hold long angles and challenge attackers, but in a more limited way. Slug Shotguns and DMRs will still have access to Magnified Sights on Defense.\n\nAlso in this patch, you will find that some of the affected Operators have received tweaks to compensate for these changes, but more may come in the future. We will keep a close eye on the effect of these changes and will take action if needed.\n\n### MAGNIFIED\n\n- Automatic weapons on Defense do not have access to these scopes.\n\n### OPERATORS AFFECTED\n\n- Castle\n- Doc\n- Echo\n- Frost\n- Goyo\n- Rook\n- Tachanka\n\n## BALLISTIC SHIELD\n\nShielded Operators will experience a slight exposure when throwing a projectile from behind the shield. Although this opening is smaller than it was with original shields, the momentary exposure creates a vulnerability that defenders can exploit, making it riskier for shielded operators to throw projectiles.\n\n### BASE STATS\n\n- __Projectile Throw:__ Animation added.\n\n### OPERATORS AFFECTED\n\n- Blackbeard\n- Blitz\n- Fuze\n- Montagne\n\n## MK17 CQB\n\nAs part of Blackbeard's balancing wave, we are tweaking his most used weapon. We are reducing its magazine capacity to make players more thoughtful when shooting. This should reduce the use of long pre-fires and make Blackbeard reload more often.\n\n### BASE STATS\n\n- __Magazine:__ Reduced to 20 (was 25)\n- __Max Ammunition:__ Reduced to 221 (was 226)\n\n### OPERATORS AFFECTED\n\n- Blackbeard\n\n## REAPER MK2\n\nThe Reaper is being issued to a few more Operators, and we want to take this opportunity to make its recoil a bit more comfortable. This weapon aims to be a bit different to other Machine Pistols in the game, and we want to keep that spirit. The initial rounds of the shot will be easier to handle, but sustained bursts will remain challenging to control. Using the weapon in short bursts will be more rewarding and successful for players.\n\n### RECOIL - PC\n\n- __First Shot:__ Reduced weapon initial kick.\n- __Horizontal:__ Softened lateral recoil on first stages.\n\n### OPERATORS AFFECTED\n\n- Oryx\n- Pulse\n- Rauora\n- Rook\n- Sledge\n- Ying\n\n# RANK DISTRIBUTION\n\n![[R6S] Y10S3 Designer's Notes Y10S2 Rank Distribution PC](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1Nkufc8i5QrgzsInIJuxJb/54fd331e50e890d6a49604d407fafcad/Y10S2_Rank_Distribution_PC.png)\n\n![[R6S] Y10S3 Designer's Notes Y10S2 Rank Distribution Console](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2nATjELyMG7JkObhN6jA0I/3a63939ece6790e8b6cabb3f6bd153b4/Y10S2_Rank_Distribution_Console.png)\n\nFollow us and share your feedback on [X](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 9,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/4czc3hlHtXrd27crELGDcc/y10s3-designers-notes",
    "date": "2025-08-18T01:45:00.000Z"
  },
  {
    "id": "KrNWbNKmJiL1uXbCXy6ig",
    "title": "Watch The Y10S3 Reveal, Get A Weapon Charm On Twitch!",
    "abstract": "Tune into the upcoming Season Reveal Panel on Sunday, August 17 and earn an exclusive Weapon Charm!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/74dmnVGaxF739nU52HVdP3/2c1bf2a50a60610da7cfebf5a069c918/Y10S3Drop.jpeg",
    "content": "This weekend, we'll pull back the curtain on what's coming next season in the Y10S3 Reveal Panel, and you can earn an exclusive weapon charm by watching live on Twitch!\n\nWe'll have Twitch Drops active on the official Rainbow Six Twitch channels and select partner streams for two hours once the Season Reveal Panel begins, so be sure to tune in to claim the *Y10S3 REVEAL CHARM for free!*\n\nThis offer will be live on August 17 from 10AM Pacific Time / 1PM Eastern Time until 12PM Pacific Time / 3PM Eastern Time. See below for details.\n\n## Reward\n\n- Watch 15 Minutes: *Y10S3 REVEAL CHARM*\n\n## How Do Twitch Drops Work?\n\nBe sure to follow these steps to make sure you're set up to earn Drops:\n\n- Step 1: Link your Twitch account and Ubisoft account. [Click here to link accounts now](https://drops-register.ubi.com/).\n- Step 2: Watch eligible streams. You'll earn progress toward various items by watching streams for 30 minutes or more. See above for details on how to get each available item.\n\n- Step 3: Claim Your Rewards. When you've earned a Drop, be sure to claim it in your Twitch Inventory. Once complete, your rewards will be waiting for you in-game.\n\nIf you are a streamer and are looking for info on future creator opportunities for Rainbow Six Siege X, be sure to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/).",
    "categories": [
      "community"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/KrNWbNKmJiL1uXbCXy6ig/watch-the-y10s3-reveal-get-a-weapon-charm-on-twitch",
    "date": "2025-08-15T16:00:00.000Z"
  },
  {
    "id": "1JLAM9uc3HwK5N04IgR5pI",
    "title": "R6 SHIELDGUARD & ANTI-TOXICITY – Y10S2 UPDATE",
    "abstract": "Find our latest R6 ShieldGuard and Anti-Toxicity updates.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/SUylwmfAyvahLP2qUoSQC/9b10faa88cb513074c3a1c88834d05fe/R6_Y10S2_SHIELDGUARD.Header.960x540.jpg",
    "content": "In our latest R6 ShieldGuard and Anti-Toxicity update, our teams will unveil key insights into Y10S2, along with actionable plans for both the current season and what's ahead.\n\n## IN THIS UPDATE\n\n__R6 SHIELDGUARD__\n\n- Status Overview\n- Exploits\n- R6 ShieldGuard Security\n- Live Security Updates\n- Account Related Bans\n\n__ANTI-TOXICITY__\n\n- Standing Distribution Update\n- Reputation System Sanctions\n- Text and Voice Chat Moderation\n- Abandonment Penalties\n- Privacy Settings\n\n![[R6S] R6 Shieldguard & Anti-Toxicity - Y10S2 Update - shield-guard](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4ElOUUm1IQwUb7UBuZgtXn/11cabdfafb627651a308cb6e0d4b8c9c/Header_ShieldGuard_150x960_Y10S2.png)\n\nThe R6 ShieldGuard team is here to give an update on Anti-Cheat in Siege X. Today we'll look at the status since the release of Siege X and R6 ShieldGuard, and cover what's coming in the future. Check out the team's plans below.\n\n## STATUS OVERVIEW\n\nSince the launch of Siege X, it's clear that there has been a surge in cheater reports. The share of matches featuring players who receive 4 or more cheater reports within that single game has risen from an average of 1.8% to 2.5%. This spike is tied to the evolution of in-game exploits and the ongoing development of cheat programs. We know the impact that this has had on the enjoyment of the game for many and we are very actively working on solutions.\n\nWe've deployed several fixes since launch, though some of the improvements needed to strengthen R6 ShieldGuard will require longer-term development. Our goal is to make meaningful progress throughout Season 3 and beyond, ensuring we protect the game's integrity and improve your overall experience.\n\n![[R6S] R6 Shieldguard & Anti-Toxicity - Y10S2 Update - impact](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2syXTDSCsyA9sPhJyEWJrr/130c22ca28af5a36504e18515d4c091d/R6_CheaterReportChart_Y10S2-960x540.jpg)\n\n## EXPLOITS\n\nWith the release of Siege X and the increased number of players, bugs were found in the game that could be used to gain an unfair advantage over other teams and players. These exploits are also a form of cheating.\n\nWith the help of our community, we've been able to address several major exploits as part of our most recent patches,including multiple teleportation glitches, legitimate external overlay applications providing an unfair visual advantage, impossible defusing spots or impossible use of weapons and gadgets, and crashes caused by specific operators. We have also identified and are actively fixing additional issues, with updates rolling out as soon as they're ready.\n\nWe want to sincerely thank everyone who has contributed - content creators, players, and those who have submitted reports via R6Fix. Your input has been crucial in helping us reproduce and resolve many of these exploits. To further prevent new exploits, we're working on a global solution that includes stricter tolerances in given situations to prevent similar exploits. We continue to monitor the situation closely.\n\n## R6 SHIELDGUARD SECURITY\n\nThroughout Operation Daybreak, we have deployed several updates to our underlying in-house obfuscation technology which hides and protects game code. These updates are strengthening our defenses, and while we're already seeing some positive trends, more updates will be coming with every patch and hotfix. We're also constantly investing in reducing and stopping new gameplay violations, while improving our detections, targeting specific cheat features and providers.\n\n## LIVE SECURITY UPDATES\n\nYou may have noticed that Siege X occasionally requires a game restart and update. This is part of a new prevention system which has strengthened our anti-cheat defenses overall. While the system has been effective, we've identified bugs that have caused some players to be disconnected from matches or unable to reconnect. We understand how frustrating this can be and sincerely apologize for the disruption. Our team is actively working to resolve these issues so that players can benefit from enhanced protection without any unintended side effects.\n\n## ACCOUNT RELATED BANS\n\nWe're actively developing new tools that detect accounts linked to previously banned cheaters. If a banned player attempts to return, they're flagged and removed as soon as suspicious behavior is detected. In addition, we're working on systems to hold players accountable if they knowingly squad up with cheaters. This is part of our broader effort to protect the integrity of the game at every level.\n\n## PERMA-BAN NUMBERS - BATTLEYE + R6 SHIELDGUARD\n\nCheck out the last 12 months of perma-ban data, including new data for April to July. We can see here that the number of monthly bans has remained steady since the launch of Operation Prep Phase, with over 11,000 permanent bans issued on average per month. With a rise in cheaters being felt during the month of July however, investigation were started into whether our systems were still banning with the same effectiveness as previous months. This investigation led to adjustments being made to R6 ShieldGuard, which resulted in an additional ban wave being completed in early August.\n\n![[R6S] R6 Shieldguard & Anti-Toxicity - Y10S2 Update - battleye](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6Z47X7rE81nx97K6phvWy1/ce0996775fe6dbfc6af849c320dd390b/R6_BanChart_Aug24-July25_Y10S2.jpg)\n\n## HOW YOU CAN HELP\n\n### ACTIVATE TWO FACTOR ATHENTICATION\n\nKeeping your account secure helps keep the game fair for everyone. That's why we strongly recommend enabling Two-Factor Authentication (2FA), especially using a mobile authenticator app if possible. By turning on 2FA, you're not just protecting your progress, you're helping us to fight cheating and keep the community safe. For more information on 2FA, check our [self-help article](https://www.ubisoft.com/help/account/article/000065723).\n\n### REPORTING\n\nIn-game reporting continues to be the best way to get your reports to us, helping us to identify potential cheaters and take action.\n\nYour in-game reports help by:\n- Feeding our automated systems while combining with additional information.\n- Aiding the manual review process allowing cross reference for specific actions.\n- Providing an understanding of player perception on the current state of cheating at a global scale.\n\n## FINAL NOTE\n\nProtecting the game from cheaters and exploit abusers remains one of our top priorities.\n\nThroughout July, the team has consistently delivered fixes and improvements. In order to release stable solutions, some of the fixes may take more time, but our commitment to act quickly and effectively when issues arise continues. Elements of our future R6 ShieldGuard updates are also already underway, with more to be revealed soon.\n\nWe're not slowing down. Our focus is clear: keep Siege X fair, secure, and fun for everyone.\n\n![[R6S] R6 Shieldguard & Anti-Toxicity - Y10S2 Update - toxicity](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/31p8jP1TStXmSZQRF5Dxkg/320bafee070f50e70d249b6b4cd45151/Header_AntiToxicity_150x960_Y10S2.png)\n\nThe Anti-Toxicity team is here to share a look at how the Reputation System has been performing in the time since its full rollout. Right now, the system is helping to shape a healthier, more respectful Siege experience and in this update, we'll share highlights on key features, ongoing improvements, and what's next.\n\n## REPUTATION SYSTEM\n\n### STANDING DISTRIBUTION UPDATE\n\nThe Reputation System was released from Beta in Y10S1, and this means that we now have more data than ever on its impact on players. Since its full activation, the amount of Dishonorable and Disruptive players has dropped by 81% and 54% respectively. Conversely, the number of players in Exemplary has increased by 114% with Esteemed increasing by 45%. It's clear that players have been adapting their behavior and rising to higher Reputation Standings, in turn making the game better for everyone.\n\n__STANDINGS - Y9S4 to Y10S2__\n\n![[R6S] R6 Shieldguard & Anti-Toxicity - Y10S2 Update - standings](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5rokWTq6MOOarbm4vqhr7Q/599fe0fe1e420ca92a31543d81f308f2/R6_AllStandings_Y9S4-Y10S2_Vert.v3.jpg)\n\n### DISRUPTIVE COMMUNICATION\n\nOur Anti-Toxicity systems are scaling with Siege X and continue to protect players from disruptive behaviors. We are now seeing a reduction of communication reports per match, with a -14% for Textchat and -27% for Voice Chat. This is also partly thanks to the new Chat Wheel, which allows players to communicate quickly and easily without friction. We can see below that exposure to negative actions dropped significantly with the release of Siege X.\n\n![[R6S] R6 Shieldguard & Anti-Toxicity - Y10S2 Update - communication](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7m8OTw1bC8NwRuwmbGKoFw/10296dbf88be4a694b180987b4acd53d/R6_FlagExposure.jpg)\n\n### REPUTATION SYSTEM SANCTIONS\n\nSince March 2025, we have temporarily banned over 4600 players who had completed an excessive amount of negative actions, accruing a critical number of negative Reputation Units. We can share that these temporary bans have worked well however, with 3 of 5 players adapting their behavior and not going on to offend again\n\n### DUAL FRONT ACTIVATION\n\nThe Reputation System is now active in Dual Front and positive and negative actions completed in this mode now impact your Reputation. Dual Front initially released without integration into the Reputation System, though thanks to your feedback, we were able to adapt our plans and bring the activation forward.\n\n## COMMUNICATION MODERATION\n\n### TEXTCHAT\n\nTextchat Moderation went live in December 2024, and since then we've worked to ensure the feature evolved with player feedback. The system is now working well, though we are aware that false detections can sometimes occur, often due to lack of context in a conversation.\n\nFrom Y10S3 we will be implementing functionality which will enable players with a Reputation Standing of Respectable and above to report detections which they believe to be incorrectly flagged. This, as well as our ongoing behind-the-scenes updates, will help to fine tune the system, reducing the chances of your messages being falsely flagged.\n\n### VOICE CHAT\n\nIn Y10S3 we will be introducing the next step of chat moderation in Siege in the form of Voice Chat moderation. With this addition, players flagged by the system will receive a warning and be subsequently muted if flagged again. In more extreme cases, offenders may find themselves being muted immediately and without warning. In all cases, any flags will carry a Reputation Standing impact, though as with Textchat, players with a positive standing will be able to report false voice communication flags.\n\nWe'll be utilising our experience with the Text Chat Moderation feature to bring balance to this new system. And, as we did with Text Chat Moderation, we'll be giving this feature close attention, ensuring that any false flags can be learned from with changes made to the system quickly.\n\n## ABANDONMENT PENALTIES\n\nAbandonment penalties, although necessary, can be a source of great frustration for those who receive them unfairly. This season we've already lessened the length of penalties, though there is more to come. We are actively working to implement a system that will target repetitive patterns over a longer period and subsequently enable us to reduce frustration for others.\n\n## PRIVACY SETTINGS\n\nPrivacy Mode is making its way to console in Y10S3. With this release, we'll be making some important updates to Privacy Mode across all platforms. Starting next season, nicknames will be auto assigned, removing the possibility of bad actors creating toxic usernames.All players will also have their nicknames removed at the end of a match, revealing their true usernames.\n\n## FINAL NOTE\n\nWe are very proud of the evolution that we’ve made with your feedback, together fostering a more positive environment. The Reputation System is working well in Siege X, helping to protect new and current players. We are devoted to our goal of making Siege a fun and safe game for everyone, and our work will continue through Y10S3 and beyond.\n\nYour feedback and support will always be key. Stay positive and let’s continue to make the game better!  \n\n---\n\n## OPERATION HIGH STAKES FULL REVEAL\n\nStay tuned for the *Operation High Stakes* full reveal, happening on __Sunday, August 17th at 10AM PT / 1PM ET / 7PM CET__ on [YouTube](https://www.youtube.com/@Ubisoft/)and[Twitch](https://www.twitch.tv/rainbow6).\n\nWe'll also share __additional updates__ on the __R6 ShieldGuard & Anti-Toxicity__ systems, giving you a first look at __what's coming in the new season,__ so don't miss it!",
    "categories": [
      "anti-cheat",
      "toxicity"
    ],
    "readTime": 10,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1JLAM9uc3HwK5N04IgR5pI/r6-shieldguard-antitoxicity-y10s2-update",
    "date": "2025-08-14T02:55:00.000Z"
  },
  {
    "id": "W9uJP8bTZDjfuKt6r7aWn",
    "title": "Y10S2 MID-SEASON ROADMAP UPDATE",
    "abstract": "Check out what's coming to Siege X in the Y10S2 Mid-Season Roadmap Update.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1hXqxoBQAqRz6Gfc2klIcV/627dc503512f614c8f879a905e9f0103/R6_Y10S2_RoadmapHeader.960x540.jpg",
    "content": "In our latest roadmap update, we've got further insights into the development of upcoming features, ensuring transparent communication with all players. Each update and decision we've made takes into account various elements such as player feedback, the time allocated to ensure the quality of the features delivered, and more.\n\n## ROADMAP UPDATES\n\n### [OPERATOR] NEW DEFENDER\n\n- __Status: Confirmed for Y10S3__\n\nThe first new Operator since the launch of Siege X will be joining team Rainbow in Y10S3. As well as a new gadget, this Swiss defender will also be bringing a brand-new weapon that packs a punch.\n\n### [MAJOR FEATURES] DUAL FRONT: NEW NEUTRAL SECTOR ASSIGNMENT & OPERATOR POOL UPDATE\n\n- __Status: Confirmed for Y10S3__\n\nWe'll be introducing a new neutral sector assignment in Dual Front next season, with the Operator pool also receiving an update, providing some new strategic opportunities. To find out more, make sure you catch the upcoming season reveal.\n\n### [MAJOR FEATURES] NEW MODERNIZED MAPS\n\n- __Status: Confirmed for Y10S3__\n\nMore modernized maps are coming. These maps updates will bring the same visual overhaul and destructible ingredients that you've seen in modernized maps like Chalet and Clubhouse.\n\n- Nighthaven Labs\n- Lair\n- Consulate\n\n### [MAJOR FEATURE] SIEGE CUP: SCHEDULED EVERY WEEKEND + SQUAD STATS\n\n- __Status: Confirmed for Y10S3__\n\nSiege Cup, the highly competitive Siege experience, will be scheduled every weekend starting in Y10S3. Players will also be able to scout enemy squads before the match and see their top operators, potentially gaining the upper hand.\n\n### [BALANCING] MULTIPLE UPDATES\n\n- __Status: Confirmed for Y10S3__\n\nY10S3 balancing changes will be shared in the upcoming season reveal on Sunday, August 17<sup>th</sup>, 1PM ET. Don't forget that we'll be diversifying a number of loadouts by adding one of our newer weapons to multiple operators.\n\n### [PLAYER COMFORT] ESPORTS TAB UPATE\n\n- __Status: Confirmed for Y10S3__\n\nThe Esports Tab is expanding to give players an overview of tier 1 competitions. Dedicated pages will be added for all of them; to show which teams are participating, all scheduled games, their results, and how the competitions are progressing. The path and teams' qualification to the Six Invitational will be tracked on the Global Standings page.\n\n### [R6 SHIELDGUARD] SECURITY IMPROVEMENTS\n\n- __Status: Confirmed for Y10S3__\n\nWe are aware of the current situation and the recent surge in cheating. Our team is actively addressing the issues, with new initiatives and improvements coming soon to R6 Shieldguard.\n\n### [ANTI-TOXICITY] VOICE CHAT MODERATION\n\n- __Status: Confirmed for Y10S3__\n\nVoice Chat will be integrated into the Reputation System. This will result in warnings for toxic Voice Chat communication with repeat or extreme offenders being automatically muted. Players with a Reputation Standing of Respectable or higher will have the ability to report a flagged communication, voice or text, that they believe was mistakenly identified by our detection system.\n\n### [ANTI-TOXICITY] PRIVACY SETTINGS\n\n- __Status: Confirmed for Y10S3__\n\nPrivacy Mode will be made available to console players in Y10S3. With this, an anonymous username will be generated automatically, helping protect your identity during matches.\n\n### [ANTI-TOXICITY] ABANDONMENT PENALTY IMPROVEMENTS\n\n- __Status: Delayed to Y10S4__\n\nReceiving an abandonment penalty due to a game crash or disconnection can be frustrating, and to this end our team is developing solutions to ensure that where possible, unfair penalties are cancelled.\n\n### [ANTI-TOXICITY] ADDITIONAL REPUTATION SYSTEM ACTION DETECTIONS\n\n- __Status: Delayed to Y10S4__\n\nThe Reputation System will be updated to increase the amount of actions that can be detected and evaluated when calculating Reputation Standings. This will help give us an improved view of player actions and the impact that they're having on other players, while bringing further accuracy to Reputation Standings.\n\n### FULL REVEAL\nStay tuned for the __Y10S3__ coming up on Sunday, __August 17th__, at 10AM PT / 1PM ET / 7PM CET.\n\n---\n\nJoin the discussion on [Twitter](https://twitter.com/Rainbow6Game/),  [Instagram](https://www.instagram.com/rainbow6game/),  [Reddit](https://www.reddit.com/r/Rainbow6/),  [Discord](https://discord.gg/rainbow6),  [Facebook](https://www.facebook.com/Rainbow6/),  and [TikTok](https://www.tiktok.com/@rainbow6game).\n\nCheck out the [public Roadmap](http://rainbow6.com/roadmap) for more information on the changes coming your way!",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/W9uJP8bTZDjfuKt6r7aWn/y10s2-midseason-roadmap-update",
    "date": "2025-08-06T15:30:00.000Z"
  },
  {
    "id": "2SxBNqgTzfj0CTBJhu5D4K",
    "title": "New Rengoku Twitch Drops Start This Week",
    "abstract": "Rengoku is live in Siege X starting July 30, and we’re launching a new set of Twitch Drops for the duration of the event!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/27RXCyLONWF5V1GPrpEOlU/193af430d0b9c46ca863631496885aec/Y10S2_Rengoku_Variant_Fuze_Bundle_960x540.jpg",
    "content": "Rengoku returns to Siege X this week, and you can earn a brand new set of Twitch Drop rewards while the event is live!\n\nStarting at 9AM Pacific / 6PM CEST on July 30, you can unlock a Fuze bundle variant by watching select streamers play Rainbow Six Siege X on Twitch! See below for a full breakdown.\n\n### Rewards\n\n- Watch 30 Minutes: Portrait- SCORCHING ZEAL '25\n- Watch 1 Hour: Headgear- SCORCHING ZEAL '25\n\n- Watch 3 Hours: Uniform- SCORCHING ZEAL '25\n- Watch 5 Hours: Weapon Skin- FIRE-TOUCHED '25\n\nThese rewards will be available until 9AM Pacific / 6PM CEST on August 13.\n\nHow Do Twitch Drops Work?\n\nBe sure to follow these steps to make sure you're set up to earn Drops:\n\n- Step 1: Link your Twitch account and Ubisoft account. [Click here to link accounts now](https://drops-register.ubi.com/).\n- Step 2: Watch eligible streams. You'll earn progress toward various items by watching streams for 30 minutes or more. See above for details on how to get each available item.\n\n- Step 3: Claim Your Rewards. When you've earned a Drop, be sure to claim it in your Twitch Inventory. Once complete, your rewards will be waiting for you in-game.\n\nIf you are a streamer and are looking for info on future creator opportunities for Rainbow Six Siege X, be sure to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/).",
    "categories": [
      "community",
      "rainbow-six-siege"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2SxBNqgTzfj0CTBJhu5D4K/new-rengoku-twitch-drops-start-this-week",
    "date": "2025-07-29T16:00:00.000Z"
  },
  {
    "id": "15u8e17UKbO1RDm0lXhfXx",
    "title": "Y10S2.3 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y10S2.3!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6Chwgnr1OB8CRYZ3iWrhrN/2d2063056bc35bec5c19dc1b4c6ccd26/PATCH_NOTES_Y10S2.3_960x540.jpg",
    "content": "See the upcoming changes with the release of Y10S2.3.\n\n## DUAL FRONT\n\n- Added operators: Nokk, Jager, and Aruni.\n- Removed operators: Bandit, Vigil, and Castle.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Cannot rappel on a section of the wall located at B3 Exterior, in Dual Front.\n\nFIXED - Attackers can rappel through the roof on Outback.\n\nFIXED - Players are able to crash ongoing games with Castle's Armor Panel.\n\n### USER EXPERIENCE\n\nFIXED - Some surfaces and hatches on the first floor are not removed in Caster Cam view.\n\nFIXED - Reload UI remains on HUD for the entire round after canceling the reload animation.\n\nFIXED - The Equip and Favorite buttons are missing in the fullscreen victory celebrations view.\n\nFIXED - The entire INSPIRATION elite bundle automatically equips after equipping the elite skin on Mira's Black Mirror gadget during the selection phase.\n\nFIXED - The entire PANZERSTARKE elite bundle automatically equips after equipping the elite skin on Blitz's G52-Tactical Shield during the selection phase.\n\nFIXED - The entire MTG MK.II elite bundle automatically equips after equipping the elite skin on Montagne's Le Roc Shield during the selection phase.\n\nFIXED - Bans from the first phase are not displayed when joining a Custom Pro League Playlist match during the second ban phase.\n\n### AUDIO\n\nFIXED - Sound effects are missing when the 2F Kitchen floor is destroyed by an operator in Dual Front.\n\nFIXED - Sound effects don't play when a drone is destroyed.\n\n---\n\nJoin the discussion on [X](https://twitter.com/Rainbow6Game/), [Instagram](https://www.instagram.com/rainbow6game/), [Reddit](https://www.reddit.com/r/Rainbow6/), [Discord](https://discord.gg/rainbow6), [Facebook](https://www.facebook.com/Rainbow6/), and [TikTok](https://www.tiktok.com/@rainbow6game).\n\nEncountering a bug? Report your experience at [R6Fix](https://r6fix.ubi.com/).",
    "categories": null,
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/15u8e17UKbO1RDm0lXhfXx/y10s23-patch-notes",
    "date": "2025-07-15T09:15:00.000Z"
  },
  {
    "id": "3owjfmZ0uv2zFYU99TpkSw",
    "title": "Y10S2.2 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y10S2.2!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3sJ7TXnIxEOofnb4GgGD0R/eac88d7a9b143e5d3b02bee188ce13b9/PATCH_NOTES_Y10S2.2_960x540.jpg",
    "content": "See the upcoming changes with the release of Y10S2.2.\n\n## DUAL FRONT\n\n- The health of a downed Operator is now 50.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Clash's CCE Shield can stop Dokkaebi's Logic Bomb when equipped.\n\nFIXED - Thermite's Exothermic Charge and the Hard Breach Charge are not destroyed by electricity if they're deployed before electricity is active.\n\nFIXED - Explosives injure Operators through drone vents protected by metal sheets.\n\nFIXED - Operator gets stuck on the window frame after trying to rappel through while an ally is placing a barricade.\n\nFIXED - Passive healing resets after securing an enemy sector in Dual Front.\n\nFIXED - Skopos's Idle Shell blocks players from reinforcing a wall from inside.\n\nFIXED - Rappelling through a window doesn't kill enemy Operators in online Custom Games.\n\n### OPERATORS\n\nFIXED - Clash's leg clips through her CCE Shield while crouched.\n\n### USER EXPERIENCE\n\nFIXED - PlayStation® players receive a free weekend expired error while trying to access Siege X.\n\nFIXED - Tactical map spawn locations during the Planning Phase can't be selected.\n\nFIXED - Climb and Rappel action reminders are present while Clash's CCE Shield is expanded and the taser is active.\n\nFIXED - Wamai's elite Director of Acquisition's badge is displayed in badge list when bundle is unowned.\n\nFIXED - Clash's elite Honor-Bound Shield badge is displayed in badge list when bundle is unowned.\n\nFIXED - The hostage icon appears in the scoreboard for every player that is killed while carrying the hostage.\n\nFIXED - Missing thumbnail for M249 Filigree Blaster weapon skin.\n\nFIXED - Change Operator button in Shooting Range doesn't work.\n\nFIXED - FPS drops to 1 on modernized maps during transition between rounds.\n\nFIXED - Stuttering during gameplay for users with Intel CPUs and Nvidia GPUs.\n\nFIXED - SFX for Valkyrie's paragon Quintessence of Form victory celebration's plays in the background while scrolling through the bundle content in fullscreen view.\n\nFIXED - Level of detail issues in the District map of Dual Front.\n\nFIXED - Lighting issues in the District map of Dual Front.\n\nFIXED - First time booting Siege starts in a borderless window that behaves like fullscreen when the monitor's resolution is higher than 1600x900.\n\nFIXED - Alibi's elite Sophisticated Veneer ability skin has morphing level of detail issues.\n\nFIXED - Play again button for Field Training has a missing graphic in the Play hub.\n\n### AUDIO\n\nFIXED - Motion sensors in 1F Visa Office of Consulate map don't make sound when an Operator passes through them.\n\n---\n\nJoin the discussion on [X](https://twitter.com/Rainbow6Game/), [Instagram](https://www.instagram.com/rainbow6game/), [Reddit](https://www.reddit.com/r/Rainbow6/), [Discord](https://discord.gg/rainbow6), [Facebook](https://www.facebook.com/Rainbow6/), and [TikTok](https://www.tiktok.com/@rainbow6game).\n\nEncountering a bug? Report your experience at [R6Fix](https://r6fix.ubi.com/).",
    "categories": [
      "patch-notes"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3owjfmZ0uv2zFYU99TpkSw/y10s22-patch-notes",
    "date": "2025-07-02T09:15:00.000Z"
  },
  {
    "id": "3RTryzMS8ZmUrBryqsaYAN",
    "title": "New Twitch Drops For Siege X’s Showdown Event",
    "abstract": "Showdown is live in Siege X starting today, and we’re launching a new set of Twitch Drops for the duration of the event!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7lgYs6HlODrWMzKg2x4yR7/d2ec7c7b6b2e09dc999ad1e199b6237e/Y10S2_Glaz_Showdown_Bundle_960x540.jpg",
    "content": "This week Showdown returns to Siege, and we're kicking off a new series of Twitch Drop rewards for the duration of the event! \n\nStarting at 9AM Pacific / 6PM CEST on June 25, you can unlock a new themed bundle for Glaz by watching any streamer playing Rainbow Six Siege X on Twitch! See below for a full breakdown.\n\nRewards\n\n-  Watch 30 Minutes: SALOON VEST '25 Operator Card\n\n-  Watch 1 Hour: HARDEE MONOCLE '25 Headgear\n\n-  Watch 3 Hours: SALOON VEST '25 Uniform\n\n-  Watch 5 Hours: BARTER INTEREST '25 Weapon Skin\n\nThese rewards will be available until 9AM Pacific / 6PM CEST on July 9.\n\nHow Do Twitch Drops Work?\n\nBe sure to follow these steps to make sure you're set up to earn Drops:\n\n-  Step 1: Link your Twitch account and Ubisoft account. Click here to link accounts now.\n\n-  Step 2: Watch eligible streams. You'll earn progress toward various items by watching streams for 30 minutes or more. See above for details on how to get each available item.\n\n-  Step 3: Claim Your Rewards. When you've earned a Drop, be sure to claim it in your Twitch Inventory. Once complete, your rewards will be waiting for you in-game.\n\nIf you are a streamer and are looking for info on future creator opportunities for Rainbow Six Siege X, be sure to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/).",
    "categories": [
      "community"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3RTryzMS8ZmUrBryqsaYAN/new-twitch-drops-for-siege-xs-showdown-event",
    "date": "2025-06-24T16:00:00.000Z"
  },
  {
    "id": "6d9GuIXMWRbgoPQZYdUVip",
    "title": "Y10S2.1 Patch Notes",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y10S2.1.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3eGFEDlIiG5pdiXhhgf8cA/2700049ad02f57061c04ee84c1c1c60b/PATCH_NOTES_Y10S2.1_960x540.jpg",
    "content": "# Y10S2.1 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n- __Ubisoft Connect: 1.53 GB__ \n- __Steam: 1.53 GB__ \n- __Xbox One: 4.9 GB__\n- __Xbox Series X|S: 1.34 GB__\n- __PlayStation®4: 2.24 GB__\n- __PlayStation®5: 1.25 GB__\n\n<br>\n\n# BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Unstable animation hen opening or closing Rauora's D.O.M. Panels.\n\nFIXED - The prompt to enter windows disappears after exiting rappel, preventing completion of the tutorial.\n\nFIXED - Clash appears upside down in all Play hub backgrounds.\n\nFIXED - An incorrect reload animation plays when the player reloads the Golden Gun.\n\nFIXED - Blackbeard's Mk17 scope abruptly tilts left when aiming down sights (ADS).\n\nFIXED - Players don't receive Assist score points when an enemy they pinged is killed by an ally.\n\nFIXED - Hostage's hands are not visible when being escorted in 1<sup>st</sup> person view.\n\nFIXED - Corrupted and distorted textures appear during a Dual Front match.\n\nFIXED - Corrupted map textures appear after being knocked down by Nomad's Airjab ability into the metal fence at A1-2F Bunks Hallway.\n\nFIXED - Graphical glitches occur during a Dual Front match on certain configurations when using Ultra graphics options.\n\n<br>\n\n### USER EXPERIENCE\n\nFIXED - A small box is visible near the Clearance Level.\n\nFIXED - Iana's Solar Raid uniform patches look too dark.\n\nFIXED - The flag on Iana's Collision Point uniform is too dark.\n\nFIXED - The patches on Zofia's, Fuze's, Glaz's and Thatcher's Collision Point uniforms look too dark.\n\nFIXED - Patches and insignias on multiple Operators appear too dark when the Deadly Omen uniform is equipped.\n\nFIXED - The patches and insignias of multiple Operators are too dark while the Demon Veil uniform is equipped.\n\nFIXED - The recharge circle overlaps with the fuel gauge in the Breaching Torch UI.\n\nFIXED - Ying's Augmented Reality headgear appears on the Augmented Reality uniform thumbnail.\n\nFIXED - A message appears while piloting a drone in a newly captured enemy point after the player has died.\n\nFIXED - Azami's default headgear appears overly exposed due to lighting.\n\nFIXED - Patches on multiple Operators appear darker than the rest of their uniforms while wearing the Crystal Guard uniform.\n\nFIXED - Esports championships with invalid dates are incorrectly marked as completed.\n\nFIXED - Placeholder tiers and titles are incorrectly displayed in the Recommended Challenges section in the Play hub.\n\nFIXED - A player's Operator icon appears twice.\n\n<br>\n\n### AUDIO\n\nFIXED - Goyo's Volcan Canister explosion sound effects phase during detonation.\n\n<br>\n\n### BUG REPORTING\n\nIf you encounter any bugs during your gameplay, please report them or add your experiences to existing reports on [R6Fix.](https://r6fix.ubi.com/)",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6d9GuIXMWRbgoPQZYdUVip/y10s21-patch-notes",
    "date": "2025-06-12T09:15:00.000Z"
  },
  {
    "id": "ixjnXu9g80eFVW3X7cNFF",
    "title": "Y10S2.0 PATCH NOTES ADDENDUM",
    "abstract": "Updates and fixes made over the course of the Y10S2 Season Test Server.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3SUXyU2roKG8M93sjoQZnf/54ed03ce8f56d678474c34ee5e667723/PN_Y10S2_960x540.png",
    "content": "\nYou can find here the updates and fixes made over the course of the Y10S2 Season Test Server.\n\nFor the full Operation Daybreak Patch Notes, follow the link below.\n\n[Operation Daybreak Season Patch Notes](https://www.ubisoft.com/en-us/game/rainbow-six/siege/news-updates/seasons/daybreak)\n\n# Y10S2 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect : 51.9 GB - with Ultra HD Textures: 91.53 GB\n- Steam : 32.3 GB - with Ultra HD Textures: 39.1 GB\n- Xbox One : 37.6GB\n- Xbox Series X|S : 57.6 GB\n- PlayStation®4 : 48.63 GB\n- PlayStation®5 : 41.37 GB\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - No access to text chat for console players outside of the US.\n\nFIXED - The AirTEP and helicopter disappear from the player's screen (host or client) when extracting the hostage after a Join-In-Progress (JIP) session.\n\nFIXED - Game server crashes when a player in support mode attempts to deploy a drone immediately after pressing the respawn key.\n\nFIXED - The sabotage kit obstructs player visibility when entering DBNO at the start of sabotage.\n\nFIXED - Ace's S.E.L.M.A. Aqua Breacher can successfully breach electrified walls, bypassing electrical defenses.\n\nFIXED - The pulse animation in the minimap has been removed and now only appears in the headers when the player opens the menu or after dying.\n\nFIXED - Game crashes when Anti Aliasing is set to 4x.\n\nFIXED - Vaulting over a door barricade should result in consistent landing placement, whether or not the player has a shield equipped.\n\nFIXED - If the defuser is planted on a Kiba Barrier, it will be destroyed when that barrier is removed.\n\nFIXED - Enabling AMD FSR 2.0 causes the screen to turn black during gameplay.\n\nFIXED -Playlists are locked after exiting a 6 player squad.\n\nFIXED - A number placeholder briefly appears during the first boot while security measures are being downloaded.\n\nFIXED - The hostage extraction animation will unexpectedly appear during gameplay.\n\nFIXED - Attacking bots can be drawn indoors through combat, causing the remaining bots to stay outside for extended periods.\n\nFIXED - The free look prompt should not be visible while free look mode is active.\n\nFIXED - Player will plant instead of barricading when facing a door or window inside the objective room.\n\nFIXED - The vignette effect that appears during healing is active at the same time the player enter the objective room.\n\nFIXED - Attackers from Team B are not affected by Thatcher's EMP grenades from Team A.\n\nFIXED - The metallic middle bar of a deployed Alibi Prisma does not appear on IQ's electronic detector when viewed from below.\n\nFIXED - Oryx's Remah Dash will destroy the fire extinguishers without activating the smoke and concussion effects.\n\n### USER EXPERIENCE\n\nFIXED - Ram's BU-Gi appears with a placeholder texture in the operator menu.\n\nFIXED - \"Too many squadmates\" error message will appear if the player leaves a custom online lobby.\n\nFIXED - The lobby becomes unresponsive when the lobby owner closes the title.\n\nFIXED - Squad members remain in the After-Action Report (AAR) when the leader exits to the main menu, with the option to bring them along.\n\nFIXED - Player enters DBNO after falling to the ground.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/ixjnXu9g80eFVW3X7cNFF/y10s20-patch-notes-addendum",
    "date": "2025-06-10T21:15:00.000Z"
  },
  {
    "id": "u0TgNGWv5AJtJBMkFHpha",
    "title": "Support Your Favorite Creators With Siege Creator Codes",
    "abstract": "Alongside the launch of Siege X, we are offering a new way for you to support your favorite Siege streamers, video makers, and community leaders!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2d2KExefLYdiWDy6tYrS8C/63e8fef61258ad625a25e1bbeecb23fb/R6x-Siege-540x960.jpg",
    "content": "Alongside the launch of Siege X, we are offering a new way for you to support your favorite Siege streamers, video makers, and community leaders with Rainbow Six Creator Codes!\n\nUse a Creator Code when buying select items in-game, and your favorite creator will receive a commission for each sale. These creator codes are available for select Siege creators, with more to be added over time.\n\nTo use a creator code and support a Siege creator, check out the \"Support a Creator\" section of the in-game shop and enter the code using the Ubisoft Connect overlay. Your selected code will remain active for 14 days, and any purchase you make from the \"Support a Creator\" store section will directly support your preferred Siege partner!\n\nIf you're a creator and want to be considered for a Siege creator code, be sure to [apply to the Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/).",
    "categories": [
      "rainbow-six-siege",
      "community"
    ],
    "readTime": 1,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/u0TgNGWv5AJtJBMkFHpha/support-your-favorite-creators-with-siege-creator-codes",
    "date": "2025-06-10T14:15:00.000Z"
  },
  {
    "id": "3JOtomdNqBdS4SXQOWO0DJ",
    "title": "Siege X Twitch Drops And TikTok Game Rewards Start June 10",
    "abstract": "Get in-game bonuses by watching live Siege X gameplay on Twitch and TikTok!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3vkD8q7CiAMYmnAi3723RI/2bf38ceda723603c0a3125492ebd4a4a/R6TwitchDrops.jpg",
    "content": "A new era for Siege begins when Siege X launches tomorrow, June 10, and to celebrate we're offering limited-time in-game rewards on both Twitch and TikTok!\n\n# Twitch Drops\n\nStarting at 9AM Pacific / 6PM CEST on June 10, you can unlock the __Dokkaebi Community Bundle__ by watching select partner streams on Twitch! See below for a full breakdown.\n\n## Rewards\n\n- Watch 30 Minutes: *SUISUI Weapon Charm*\n\n- Watch 2 Hours: *SUISUI Mk 14 EBR Weapon Skin*\n\n- Watch 4 Hours: *SUISUI Uniform*\n\n- Watch 6 Hours: *SUISUI Headgear*\n\nThese rewards will be available until 9AM Pacific / 6PM CEST on June 16.\n\nHow Do Twitch Drops Work?\n\nBe sure to follow these steps to make sure you're set up to earn Drops:\n\n- Step 1: Link your Twitch account and Ubisoft account. [Click here to link accounts now](https://drops-register.ubi.com/).\n\n- Step 2: Watch eligible streams. You'll earn progress toward various items by watching streams for 60 minutes or more. See above for details on how to get each available item.\n\n- Step 3: Claim Your Rewards. When you've earned a Drop, be sure to claim it in your Twitch Inventory. Once complete, your rewards will be waiting for you in-game.\n\n# TikTok Game Rewards\n\nAlso kicking off at 9AM Pacific / 6PM CEST on June 10 is the Siege X TikTok Game Reward offer, allowing you to earn 5 Alpha Packs by watching live gameplay from select creators streaming Siege X.\n\n## Rewards\n\n- Watch 3 minutes: *5x Alpha Packs*\n\n## How Do TikTok Game Rewards Work?\n\n- Step 1: Watch a participating TikTok creator livestreaming Siege X gameplay. Participating channels will display a \"Game Rewards\" tag in the top-right corner of the stream.\n\n- Step 2: After 3 minutes of watch time, Click the Share arrow in the lower-right and select the Game Rewards icon to view and claim the reward.\n\n- Step 3: You will receive a code for your reward that you can redeem through this website: [https://redeem.ubisoft.com/rainbow6-siege](https://redeem.ubisoft.com/rainbow6-siege/). You must log in with your Ubisoft account (or create a new one) to enter the code. After redeeming the code to your Ubisoft account, the items can be found in your in-game inventory.\n\nTikTok Game Rewards will be available until July 9, 2025.\n\nIf you are a streamer and are looking to participate in future creator opportunities on Rainbow Six Siege, be sure to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/).",
    "categories": [
      "rainbow-six-siege",
      "community"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3JOtomdNqBdS4SXQOWO0DJ/siege-x-twitch-drops-and-tiktok-game-rewards-start-june-10",
    "date": "2025-06-09T08:00:00.000Z"
  },
  {
    "id": "1YokhAiCfRVETGqqtb4ZFp",
    "title": "Y10S2 Streamer Charm",
    "abstract": "New Rainbow Six Siege Streamer Charm for Y10S2!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7uepKcQP6sVlbKDrRBvjZl/edee5443b8fe0e39ed1d2ce768f6ac68/Y10S2_STREAMER_CHARM__NEW_960x540.png",
    "content": "# New Rainbow Six Siege Streamer Charms for Y10S2!\n\n## Announcing the next Streamer Charm!\n\nEach season will bring the release one new charm, as well as the return of streamer charms from previous seasons! Check out this season's newest charm recipient below, and read on for further updates on the Streamer Charm program.\n\n## New\n\n![[R6S] Y10S2 Streamer Charm 00](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7uepKcQP6sVlbKDrRBvjZl/edee5443b8fe0e39ed1d2ce768f6ac68/Y10S2_STREAMER_CHARM__NEW_960x540.png)\n\n[Ooziie](https://www.twitch.tv/oozie)\n\n## Returning\n\n![[R6S] Y10S2 Streamer Charm - Y10S2 STREAMER CHARMS 960x540](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1OCybC36XW8JEvsbzudCRa/a2629625cb4f2e978255ebbab611adb8/Y10S2_STREAMER_CHARMS_960x540.png)\n\n![[R6S] Y10S2 Streamer Charm - Y10S2 STREAMER CHARMS 960x540 2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1TZnTOGg7PkLGZd15Mmm35/018fac1c3a8a47bb2e2c5d90cac177f0/Y10S2_STREAMER_CHARMS_960x540_2.png)\n\n![[R6S] Y10S2 Streamer Charm - Y10S2 STREAMER CHARMS 960x540 3](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1vHnNHXovDrGmnj2YY48bQ/d366bd11accd7d5109b98fe5ad14937e/Y10S2_STREAMER_CHARMS_960x540_3.png)\n\n![[R6S] Y10S2 Streamer Charm - Y10S2 STREAMER CHARMS 960x540 5](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4EbQ2sjnTOFM9tni2PovEq/7b7ec3d9fa8d1748555841912fca533f/Y10S2_STREAMER_CHARMS_960x540_5.png)\n\n![[R6S] Y10S2 Streamer Charm - Y10S2 STREAMER CHARMS 960x540 6](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1CbNHMjAheXEiVkLnM9HWe/b088ff275df6b440239e624e4e1535ff/Y10S2_STREAMER_CHARMS_960x540_6.png)\n\n![[R6S] Y10S2 Streamer Charm - Y10S2 STREAMER CHARMS 960x540 4](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/414J5evXp1O1grOVIe6vxY/00eb0dee0d3224852bcedbec033fdada/Y10S2_STREAMER_CHARMS_960x540_4.png)\n\n![[R6S] Y10S2 Streamer Charm - Y10S2 STREAMER CHARMS 960x540 7](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2eMS7RsjcJZhpZB2Op0BeN/ccbf191bfe8113534a3e2159661069f7/Y10S2_STREAMER_CHARMS_960x540_7.png)\n\n[Alfredoplays\\\n](https://www.twitch.tv/alfredoplays)[AnneMunition\\\n](https://www.twitch.tv/annemunition)[Beaulo\\\n](https://www.twitch.tv/beaulo)[Bighead\\\n](https://www.twitch.tv/bighead033)[BikiniBodhi\\\n](https://www.twitch.tv/bikinibodhi)[Bnans\\\n](https://www.twitch.tv/bnans)[Braction\\\n](https://www.twitch.tv/bractionfps)[Drid\\\n](https://www.twitch.tv/dridgg)[FastAnne\\\n](https://www.twitch.tv/fastanne)[Gabbo\\\n](https://www.twitch.tv/JustGabbo)[Heideltraut\\\n](https://www.twitch.tv/heideltraut)[Interro\\\n](https://www.twitch.tv/interro)[JerichoFive\\\n](https://www.twitch.tv/jerichofive)[JessGOAT\\\n](https://www.twitch.tv/jessgoat)[Jynxzi\\\n](https://www.twitch.tv/jynxzi)[Just9n\\\n](https://www.twitch.tv/just9n)[KingGeorge\\\n](https://www.twitch.tv/KingGeorge)[KittyR6\\\n](https://www.twitch.tv/kitty_r6)[LagonisR6\\\n](https://www.twitch.tv/lagonis)[Lil_Lexi\\\n](https://www.twitch.tv/lil_lexi)[Lt Custard\\\n](https://www.twitch.tv/lt_custard)[Lusorkoeffizient\\\n](https://www.twitch.tv/lusorkoeffizient)[MacieJay\\\n](https://www.twitch.tv/MacieJay)[Mag6\\\n](https://www.twitch.tv/mag6)[M3ry\\\n](https://www.twitch.tv/m3ry)[Matimi0\\\n](https://www.twitch.tv/matimi0)[MrBboy45\\\n](https://www.twitch.tv/mrbboy45)[Narcoleptic Nugget\\\n](https://www.twitch.tv/narcolepticnugget)[Nesk\\\n](https://www.twitch.tv/neskwga)[PaladinAmber\\\n](https://www.twitch.tv/paladinamber)[Patife\\\n](https://www.twitch.tv/patife)[Pengu\\\n](https://www.twitch.tv/pengu)[RazaH\\\n](https://www.twitch.tv/razah)[REMGURI / 렘쨩\\\n](https://www.twitch.tv/remguri)[Rubsarb\\\n](https://www.twitch.tv/Rubsarb/)[SexyCake\\\n](https://www.twitch.tv/smexycake)[Sha77e\\\n](https://www.twitch.tv/sha77etv)[Shorty\\\n](https://www.twitch.tv/shortyyguy)[shroud\\\n](https://www.twitch.tv/shroud)[SilphTV\\\n](https://www.twitch.tv/silphtv)[Tatted\\\n](https://www.twitch.tv/tatted)[Tranth\\\n](https://www.twitch.tv/tranth)[Varsity\\\n](https://www.twitch.tv/varsitygaming)[WhiteShark67\\\n](https://www.twitch.tv/whiteshark67)[yo_boy_roy\\\n](https://www.twitch.tv/yo_boy_roy)[z1ronic\\\n](https://www.twitch.tv/zironicdk)[Zander\\\n](https://www.twitch.tv/zander)[ziGueira\\\n](https://www.twitch.tv/zigueira)[GarfieldIsDoc\\\n](https://www.twitch.tv/garfield)[Supr\\\n](https://www.twitch.tv/supr)[RyyFyy\\\n](https://www.twitch.tv/ryyfyy)[FoxA\\\n](https://www.twitch.tv/foxa_r6)[Nerdengenheiro\\\n](https://www.twitch.tv/nerdengenheiro)[Rainbow6itacom\\\n](https://www.twitch.tv/rainbow6itacom)[Minimichegga\\\n](https://www.twitch.tv/minimichegga)[JostRekt\\\n](https://www.twitch.tv/jost)[JustRyuk\\\n](https://www.twitch.tv/justryuk)[Paluhh\\\n](https://www.twitch.tv/paluhh)[Poxonlox\\\n](https://www.twitch.tv/poxonlox)[TheLionerYT\\\n](https://www.twitch.tv/thelioneryt)[itsSpoit\\\n](https://www.twitch.tv/itsspoit)[Retalha\\\n](https://www.twitch.tv/retalha)[FooYa\\\n](https://www.twitch.tv/fooya)[IceCold\\\n](https://www.twitch.tv/icecold)[Athieno\\\n](https://www.twitch.tv/athieno)[Marciu\\\n](https://www.twitch.tv/marciu)\\\n[Rembeey](https://www.twitch.tv/reembey)\\\n[rasco100](https://www.twitch.tv/rasco100)\\\n[Vetelcito01](https://www.twitch.tv/vetelcito01)\\\n[OneShooter](https://www.twitch.tv/oneshooter)\\\n[Scythe](https://www.twitch.tv/scythe)\\\n[Jenz](https://www.twitch.tv/jenz)\\\n[Frankystrings](https://www.twitch.tv/frankystrings)\\\n[Eternal_regina](https://www.twitch.tv/eternal_regina)\\\n[Pxppy](https://www.twitch.tv/eternal_regina)\\\n[Skyte](https://www.twitch.tv/skyte)\\\n[Ru_rumiiiin](https://www.twitch.tv/ru_rumiiiin)\\\n[Anifex](https://www.twitch.tv/anifex)\\\n[Vetelcito](https://www.twitch.tv/vetelcito01)\\\n[Priest](https://www.twitch.tv/omgitspriest)\\\n[Nonomiyamika](https://www.twitch.tv/nonomiyamika)\\\n[alyttleton](https://www.twitch.tv/alyttleton)\\\n[MeatyMarley](https://www.twitch.tv/meatymarley)\\\n[ThatOneBritt](https://www.twitch.tv/thatonebritt)\\\n[TitaniumRolo](https://www.twitch.tv/titaniumrolo)\\\n[KeTo](https://www.twitch.tv/keto)\n\n## Streamer Charm Program Update\n\nIn Year 10, we are bringing some changes to the Streamer Charm program by moving to __one__ exclusive new creator charm per season.\n\nOur goal with this adjustment is to introduce a brand new seasonal charm later this year that will be available to even more creators.\n\nAs part of this program update, we are also refining our selection criteria; in addition to recognizing established creators, we'll be highlighting up-and-coming talent in the Siege community. These fresh new faces are chosen for their promising future in the Siege space.\n\nStay tuned! We will be revealing more details on this new seasonal charm and associated criteria toward the end of the first season.\n\n## Screening Procedure\n\nWe have implemented additional screening procedures into our selection process for streamer charms.\n\nUpon selection for the program, streamer charm candidates' main and alt accounts are now screened for MouseTrap violations, gameplay violations, and histories of toxicty, in addition to the other screening steps they undergo for eligibility.\n\n## How to acquire charms\n\nThese charms are only available by subscribing to the respective streamer's Twitch channel with a linked Ubisoft account. For more information on how to link your Ubisoft and Twitch account, as well as opt in for Twitch Drops, please refer to [this FAQ](https://support.ubi.com/Faqs/000035432/Get-your-Twitch-Streamer-s-charm).\n\n## How to get involved\n\nWe have updated the Ubisoft Creators Program registration to open the program to TikTok and Instagram, therefore opening new collaboration opportunities for content creators, streamers, fan artists, and cosplayers from our community.\n\nWe are always on the lookout for content creators that inspire and enrich the Siege community. If you would like access to the perks of being a partnered content creator, and your goal is to one day have a charm in the game, we would like to invite you to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/en-us).\n\nFrom there, complete the following steps:\n\n1. Connect your Ubisoft Account. If you do not have one, you can create one [here](https://connect.ubisoft.com/create).\n\n2. Agree upon the eligibility criteria.\n\n3. Connect your primary channel (Twitch, YouTube, TikTok, Instagram) or secondary channels.\n\n4. Indicate your games preferences.\n\n5. Set your location, broadcast language, and communication language.\n\nYour application will then be submitted and must be approved by Ubisoft. An email will be sent to confirm your participation.",
    "categories": [
      "rainbow-six-siege",
      "community"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1YokhAiCfRVETGqqtb4ZFp/y10s2-streamer-charm",
    "date": "2025-06-06T16:00:00.000Z"
  },
  {
    "id": "4phLHZp5jpjxrTmuniLXm",
    "title": "R6 SIEGE X LAUNCH : ALL YOU NEED TO KNOW",
    "abstract": "Get ready Operators ! R6 Siege X is launching on June 10 on all platforms. Find out more about the maintenance time and everything you need to keep in mind for the launch.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4hqwufipWXRS5RMKHtQO2s/0cb354fb5449175b1b7630a79f620118/R6X-maintenance-map-timing.jpg",
    "content": "Get ready Operators ! R6 Siege X is launching on __June 10 on all platforms__. Find out more about the maintenance time and everything you need to keep in mind for the launch.\n\n# WHEN IS R6 SIEGE X LAUNCHING\n\nThe R6 SIEGE X major evolution will launch at the same time as Season 2 - Operation Daybreak on June 10, 2025.\n\n__Maintenance Start Time__ : 07:00am PDT / 10:00am EDT / 03:00pm BST / 16:00 CEST / 17:00 AST / 22:00 CST / 23:00 JST / 12:00am (June 11) AEST\n\n__Estimated Maintenance Duration__ : 90min\n\n![[R6S] NEWS - R6 SIEGE X LAUNCH : ALL YOU NEED TO KNOW - R6X-maintenance-map-timing](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4k20zThnYWcJ6OhEy8wkjZ/f2052baafdece01eed634edbce4d4a35/R6X-maintenance-map-timing.jpg)\n\n# R6 SIEGE X AVAILABILITY\n\nR6 Siege X is available on PlayStation 5, PlayStation 4*, Xbox Series X|S, Xbox One*, Ubisoft Connect, Epic Games Store and Steam on Windows PC, as well as on Ubisoft+.\n\n*The Dual Front game mode is not supported on PlayStation 4 and Xbox One.\n\n# PROGRESSION AND INVENTORY CARRY-OVER\n\nPlayers who have bought and played the game before the launch of R6 Siege X on June 10 will keep their current progression, inventory and operators.\n\nYou will also receive Veteran Rewards to thank you for your involvement with the game. The longer you’ve been playing, the more rewards you’ll get !\n\nYou simply need to launch the game starting June 10. Veteran Rewards and the badge will automatically be added to your inventory.\n\n# PC SPECS\n\n__Minimum__ :\n\n- Resolution: 1080p\n\n- Frame Rate: 60 FPS\n\n- CPU: AMD Ryzen3 3100, Intel i3 8100\n\n- GPU: NVIDIA GTX 1650 4GB, AMD RX 5500XT 4GB, INTEL ARC A380 6GB\n\n- Ram: 8GB\n\n- OS: Windows 10/11, DirectX 12\n\n- Storage: 65 GB SSD\n\n__Recommended High__ :\n\n- Resolution 1080p\n\n    - Frame Rate: 120 FPS (Core Siege), 60 FPS (Dual Front)\n\n    - CPU: AMD Ryzen5 3600, Intel i5 10400\n\n    - GPU: NVIDIA RTX 2060 6GB, AMD RX 6600 8GB, Intel ARC A750 8GB\n\n    - Ram: 16 GB\n\n    - OS: Windows 11, DirectX 12\n\n    - Storage: 65 GB SSD\n\n- Resolution 1440p\n\n    - Frame Rate: 120 FPS (Core Siege), 60 FPS (Dual Front)\n\n    - CPU: AMD Ryzen5 3600, Intel i5 10400\n\n    - GPU: NVIDIA RTX 3070 8GB, AMD RX 6600 8GB, Intel ARC B580 12GB\n\n    - Ram: 16 GB\n\n    - OS: Windows 11, DirectX 12\n\n    - Storage: 65 GB SSD\n\n- Resolution 2160p\n\n    - Frame Rate: 120 FPS (Core Siege), 60 FPS (Dual Front)\n\n    - CPU: AMD Ryzen5 3600, Intel i5 10400\n\n    - GPU: NVIDIA RTX 3080 10 GB, AMD RX 6800 XT 16 GB\n\n    - Ram: 16 GB\n\n    - OS: Windows 11, DirectX 12\n\n    - Storage: 65 GB SSD\n\n__Recommended Ultra__ :\n\n- Resolution: 2160p\n\n- Frame Rate: 120 FPS\n\n- CPU: AMD Ryzen5 5600X, Intel i5-11600K\n\n- GPU: NVIDIA RTX 4070 Ti Super 16GB, AMD RTX 7900 XT 20GB\n\n- Ram: 16 GB\n\n- OS: Windows 11, DirectX 12\n\n- Storage: 110 GB SSD\n\n![[R6S] NEWS - R6 SIEGE X LAUNCH : ALL YOU NEED TO KNOW - R6X-pc-specs](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/61isAU7TUHVxvRbTdiQOyj/e4584c8fa4e9777e11b7aa2ce7544f38/R6X-pc-specs.jpg)\n\n# CONSOLE SPECS\n\n## PlayStation 5\n\n- __Performance__\n\n  - Resolution: 2160p\n\n  - Target Performance: 120 FPS (Core Siege), 60 FPS (Dual Front)\n\n- __Quality__\n\n  - Resolution: 2160p\n\n  - Target Performance: 60 FPS\n\n## PlayStation 5 Pro\n\n- __Performance__\n\n  - Resolution: 2160p\n\n  - Target Performance: 120 FPS (Core Siege), 60 FPS (Dual Front)\n\n- __Quality__\n\n  - Resolution: 2160p\n\n  - Target Performance: 60 FPS\n\n![[R6S] NEWS - R6 SIEGE X LAUNCH : ALL YOU NEED TO KNOW - R6X-playstation-specs](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7Mu1MTcPeOzqovDvUu4X32/779c3c51fe80cc1297e044aedc80aea4/R6X-playstation-specs.jpg)\n\n## Xbox Series S\n\n- __Performance__\n\n  - Resolution: 1080p\n\n  - Target Performance: 120 FPS (Core Siege), 60 FPS (Dual Front)\n\n- __Quality__\n\n  - Resolution: 1728p\n\n  - Target Performance: 60 FPS\n\n## Xbox Series X\n\n- __Performance__\n\n  - Resolution: 2160p\n\n  - Target Performance: 120 FPS (Core Siege), 60 FPS (Dual Front)\n\n- __Quality__\n\n  - Resolution: 2160p\n\n  - Target Performance: 60 FPS\n\n![[R6S] NEWS - R6 SIEGE X LAUNCH : ALL YOU NEED TO KNOW - R6X-xbox-specs](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/GOIiTJGXaLBQVWgxblh47/3c9ddb305ed7e3f2cff6056fae03135f/R6X-xbox-specs.jpg)\n\n# R6 SIEGE X - PATCH SIZES\n\n- __Ubisoft Connect :__ 51.9 GB - with Ultra HD Textures: 91.53 GB\n\n- __Steam :__ 51.9 GB - with Ultra HD Textures: 39.1 GB\n\n- __Xbox One__ : 37.6GB\n\n- __Xbox Series X|S__ : 57.6 GB\n\n- __PlayStation 4__ : 48.63 GB\n\n- __PlayStation 5__ : 41.37 GB",
    "categories": [
      "rainbow-six-siege",
      "game-updates"
    ],
    "readTime": 5,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/4phLHZp5jpjxrTmuniLXm/r6-siege-x-launch-all-you-need-to-know",
    "date": "2025-06-04T08:00:00.000Z"
  },
  {
    "id": "8dJbwMqIt5Y8lZgwJRjWZ",
    "title": "Y10S2 Designer's Notes",
    "abstract": "In this latest edition of Designer’s Notes, we'll go into more detail about the balancing changes that’ll come with the Y10S2 update and give you some insight into the reasons behind them.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1mM91jxIs6gXuARJzjTgwf/5f3255c76bf05471fdc92c17528513b3/R6S_Y10S2_DN_Header_960x540.jpg",
    "content": "\nIn this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y10S2 update and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n## WIN DELTA VS. PRESENCE\n\n![[R6S] Y10S2 Designer's Notes - R6S DN Y10S2 BalancingMatrix Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/JqZoi7CyFOADTRwSypySj/6229a39300e1448b2f1cfda754b3535f/R6S_DN_Y10S2_BalancingMatrix_Att.mp4)\n\n![[R6S] Y10S2 Designer's Notes - R6S DN Y10S2 BalancingMatrix DEF](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7ACqWwNzkNHOZGHtN8885B/42814b4042d422e3ce5343609fce6637/R6S_DN_Y10S2_BalancingMatrix_DEF.mp4)\n\n## OPERATOR BAN RATE\n\n![[R6S] Y10S2 Designer's Notes - R6S DN Y10S2 BanMatrix Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/Dnqq5jMWPgGjdJWpvP8OI/b0ff81f4949995937cd71cf8546b5e90/R6S_DN_Y10S2_BanMatrix_Att.mp4)\n\n![[R6S] Y10S2 Designer's Notes - R6S DN Y10S2 BanMatrix DEF](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/V3XExo83LWMojYYt6nQRn/ba181d7537a9fd675b8592ffd0a814e9/R6S_DN_Y10S2_BanMatrix_DEF.mp4)\n\n## OPERATOR BALANCING\n\n* * * * *\n\n## BLACKBEARD\n\nWe've been closely monitoring Blackbeard since the Y9S4 release, and we would like to share some details about his performance. One of our concerns with Blackbeard on release was to deliver a Shield Operator with good offensive capabilities but without being the deadliest Operator in town. After the remaster, Blackbeard's Kill Death Ratio has dropped around 25% to 0.9. This makes him sit slightly higher than Blitz at 0.8, meaning both shield Operators sit in the low bracket for Attackers' K/D.\n\nAnother important metric to consider is his impact in the team's success and compositions. He is a popular operator, but is average when it comes to win rate. His ban rate has been rising since release, being higher on PC than on Console.\n\nWe are not releasing any substantial change for Blackbeard this season, but we will update his shield with some quality of life changes. This decision is based on the shared data analysis and the fact that a new Ban System is releasing this season; we want to see how his ban rate adapts to the new system before we take any action.\n\nIn this update we've added a tinted layer to the outside of the glass that should help Blackbeard's enemies to read faster and from farther if he is aiming down sight or not. We've also improved the glass movement audio to make it easier to hear if Blackbeard is aiming down sight or not.\n\nWe will keep a close eye on Blackbeard's performance and his adaptation to the new Ban System and prepare future changes if needed.\n\n### H.U.L.L. ADAPTABLE SHIELD\n\n- Added tint to outside glass\n- Made improvements to glass audio\n\n## CLASH\n\nClash's shield and taser combination can be quite frustrating to play against. Her ability to damage enemies while being heavily protected makes her difficult to challenge, especially since the taser also slows you down and the main counter is at melee range. Additionally, playing as Clash is not particularly engaging for many players, as her current mechanics do not offer a satisfying or interesting gaming experience.\n\nWe have focused on three main pillars with this update:\n\n- __Enhanced Movement__: We are giving her more freedom of movement with her shield. She won't require any special site setup to move around while still being protected. The shield will dynamically adapt to her needs, making her more versatile and agile.\n\n- __Shield as a Gadget__: Clash will be able to anchor her shield on the ground, allowing her to play around it without needing to rely on allies. This change provides her with more independence and flexibility in positioning. She can still use the taser against enemies facing the deployed shield, so she can slow down enemies on one side while managing another angle or capitalizing on the effect by herself. This adds a strategic layer, enabling her to control multiple areas simultaneously and offer support to her team without having to be in the frontline.\n\n- __Fairness__: The taser will no longer deal damage, ensuring that Clash cannot kill an enemy while being fully protected by the shield. This aligns her more closely with other Ballistic Shields, maintaining the principle that you cannot be lethal if you cannot receive lethal damage. The intensity of the slowdown effect will also vary based on the enemy's movement direction. Enemies running away from Clash will experience less slowdown, preventing Clash from punishing attackers that don't want to face her.\n\nOverall, these adjustments will make Clash a more engaging and interactive operator, enhancing her role as a versatile support player who can control key areas and disrupt enemy strategies. We believe the new Clash will be more enjoyable to play, both as and against her.\n\n### BASE STATS\n\n- __Movement:__ Can sprint, crouch, vault, and dash through barricades, but the shield will collapse automatically while performing those actions.\n\n- __Free Look:__ Is available while having the shield equipped.\n\n### CCE SHIELD MK2\n\n- __Deploy:__ The CCE Shield MK2 can be deployed. Can be picked up again.\n\n- __Vulnerabilities when deployed:__\n  - The shield can be destroyed with explosives.\n  - Anyone can bash through the shield to destroy it.\n  - The Taser Battery can be destroyed by a Kludge Drone. The shield will stay intact, but the Taser cannot be used anymore.\n\n### TASER\n\n- __Activation:__ Can be toggled on and off using the Switch Ability Button. When the shield is not equipped Clash will use a Remote Controller to do so.\n\n- __Electricity:__ Doesn't deal damage.\n\n- __Slowdown:__ The intensity depends on the movement direction (stronger towards Clash).\n\n- __Battery:__ Increased to 10 seconds (from 5).\n\n- __Area:__ Wider area of effect (Changed from a box to a cone).\n\n### LOADOUT\n\n- __Gadgets:__ Removed Deployable Shield.\n\n## SLEDGE\n\nSledge will be able to disrupt enemies equipped with a Ballistic Shield by knocking them back with his Hammer. This will remove their protection and expose them, providing an opportunity for him or his teammates to take them down.\n\nHe will become a real menace for Clash, as he can use the Impact EMP Grenade to shut down her taser, allowing him to close the gap faster and hit her with the Hammer.\n\n### BREACHING HAMMER\n\n- __Ballistic Shields:__ Hitting a Ballistic Shield will knock back the operator.\n\n## JACKAL\n\nWe believe that the most frustrating aspect of Jackal's ability is the time he can keep you pinged with relatively low effort. Scanning a hottest/red set of footprints, even though sometimes dangerous, allows him to track the enemy for almost half a minute without putting in any additional effort or being in any kind of danger. To address this issue, we have decided to reduce the outcome of a scan to always result in a single ping. This means that scanning a set of footprints will give you the precise position of the enemy, but it will last as long as a regular red ping. Keep in mind that the scanned set will be erased when the scan is completed, so Jackal will be trading precise location for the ability to actively track the target until he reaches its last known location.\n\nHowever, we want to enhance his ability to actively track targets, as we believe this is his real strength and the one that better balances the risk and reward. Therefore, we have increased the duration of the coldest/blue footprints. These prints will now be between 60-120 seconds old, so they do not provide a lot of information but will help him to get on track faster. Remember that footprints are not generated during the Preparation Phase, so defenders are free to move around and prepare the site for the assault without being punished. Even if a defender is late returning to the site and gets scanned, they will only get pinged once, and all their footprints will be deleted from the map.\n\nWe will monitor this change very closely and make adjustments if needed.\n\n### EYENOX MODEL III\n\n- __Resources:__ Increased to 5 (from 3).\n\n### HUNTER MARK\n\n- __Pings:__ Reduced to always 1 (from 2-5).\n\n- __Debuff:__ Removed.\n\n### FOOTPRINTS\n\n- __Coldest (blue):__ Duration increased to 120 seconds (from 90).\n\n## JAGER\n\nBoth Jager and Wamai serve the same role in denying projectiles, but their different methods should ideally compliment various strategies and playstyles. Feeling forced to choose one over the other based on the specific projectiles you expect to face, rather than on your overall strategy, doesn't seem correct. Therefore, we are normalizing the list of interactions so that both detect the same projectiles.\n\nFurthermore, this rule made the game more complicated to understand for newcomers, as they needed to learn specific interactions between operators instead of a generic rule. This approach is more sustainable in the long run and makes the game more user-friendly.\n\n### ACTIVE DEFENSE SYSTEM\n\n- Capitao's Incendiary and Micro Smoke Bolts are detected and destroyed.\n\n- Gridlock's Trax Stingers are detected and destroyed.\n\n## THUNDERBIRD\n\nDespite the recent enhancements to the Kóna Stations, the potential risk of enemies exploiting them outweighs the benefits they provide, limiting their viable placements and situations where they should be most helpful. Therefore, the Kóna Station will no longer target enemies.\n\n### KONA STATION\n\n- __Targeting system:__ Only heals allies.\n\n## BRAVA\n\nDue to the new changes to Thunderbird, the Kludge Drone will no longer overheat a Kóna Station. Instead, its alliance will shift to target attackers rather than defenders, making it a valuable asset to your team.\n\n### KLUDGE DRONE\n\n- __Kóna Station:__ Hacking it changes the alliance (instead of overheating).\n\n## ELA\n\nThere was a mismatch between the detection area and the area of effect of Ela's Grzmot Mine, which could lead to confusion during gameplay. The area displayed when deploying the mine was smaller than its actual effect. This discrepancy could cause Ela to mistakenly believe she had the advantage when someone triggered the mine, only to find herself affected along with her victim. By aligning both values, we aim to enable Ela to better leverage her positioning around the mines and avoid unintended consequences.\n\nWe have decided to reduce the concussion range instead of increasing the area of detection because Ela is currently placing them according to the detection area, which seems sufficient to fulfill her playstyle. Doing it the other way around would be detrimental for her, as the Scorpion EVO 3 A1 and the FO-12 are both more effective in short-range engagements.\n\n### GRZMOT MINE\n\n- __Concussion range:__ Reduced to 4 meters (from 7).\n\n## ZOFIA\n\nSimilar to Ela, there was a discrepancy between the detection area and the area of effect. Although the issue is not identical, we have decided to normalize it as well. This adjustment ensures that the Concussion Grenade is more accurate and affects the intended target rather than everyone in the room. This change addresses the discomfort among teammates, as any ally attempting to synchronize with Zofia to take down a target was most likely affected by the grenade as unintended collateral.\n\n### KS79 LIFELINE\n\n- __Concussion detection range:__ Reduced to 4 meters (from 5).\n\n- __Concussion range:__ Reduced to 4.25 meters (from 7).\n\n# SYSTEM BALANCING\n\n* * * * *\n\n## ELECTRICITY\n\nWith this update, we are making electricity a neutral element, ensuring that all gadgets and Operators in the match are vulnerable to electricity, regardless of their team alliance. This change is accompanied by improvements designed to make interactions with electricity clearer and more forgiving for players.\n\nElectricity will no longer cause damage to players. Instead, Operators will experience a reduction in movement speed. We have also reviewed how Operators get electrified. Now, Operators must intentionally interact with electrified gadgets to get zapped. Walking on electrified surfaces will electrify Operators, but merely being close to an electrified wall will not. Operators need to interact with the wall by deploying or vaulting it to become electrified.\n\nElectricity will still destroy Electronic gadgets, but Defender gadgets will no longer be invulnerable. This change requires Defenders to exercise more caution, especially when throwing gadgets through small holes on electrified reinforcements or operating moving drones like Echo's Yokai.\n\n### ELECTRICITY EFFECT\n\n- Damage to Operators removed from Electricity Effect.\n- Slowdown to Operators added to Electricity Effect.\n- Electricity is now neutral and affects equally every team.\n\n### OPERATORS AFFECTED\n\n- Bandit\n- Kaid\n\n## LIMB DAMAGE\n\nBy reducing the damage to limbs, we aim to emphasize skillful gameplay. We encourage players to target more critical areas like the head or torso, which demands greater precision. This approach makes the gameplay more challenging and rewarding. Additionally, it enhances tactical depth, as players will need to carefully consider their positioning and aiming before taking the first shot to ensure a successful elimination. This change promotes more thoughtful and strategic gameplay, preventing players from being easily eliminated by a few shots to the arms or legs.\n\n### DAMAGE MODIFIERS\n\n- Reduced damage inflicted by Handguns:\n    - 50% by Small calibers (e.g. USP40).\n    - 50% by Medium caliber (e.g. M45 MEUSOC).\n    - 60% by High caliber (e.g.D-50).\n- Reduced to 60% the damage inflicted by Revolvers.\n- Reduced to 50% the damage inflicted by Machine Pistols.\n- Reduced damage inflicted by Submachine Guns:\n    - 50% by Small caliber (e.g. Mx4 Storm).\n    - 60% by Medium caliber (e.g. K1A).\n    - 65% by High caliber (e.g. UZK50GI).\n- Reduced damage inflicted by Assault Rifles:\n    - 50% by Small caliber (e.g. POF-9).\n    - 60% by Medium caliber (e.g. AUG A2).\n    - 65% by High caliber (e.g. Spear .308).\n- Reduced to 70% the damage inflicted by Light Machine Guns.\n- Reduced to 70% the damage inflicted by Designated Marksman Rifles.\n- Reduced to 70% the damage inflicted by Sniper Rifles.\n- Reduced to 70% the damage inflicted by Slug Shotguns.\n\nAll the values are down from 75%.\n\n## RAPPEL\n\nWe are removing the requirement of having a Breach Charge deployed on a window to execute a Rappel Breach. Allowing operators to use different tools like a Sledgehammer, shotguns, or explosives to destroy barricades while rappelling provides more tactical options and adaptability in high-pressure situations. This flexibility leads to more creative and dynamic gameplay, as players can choose the best tool for the situation. It enhances the immersion of the game, making the gameplay experience more engaging and intense.\n\nFurthermore, players can think strategically about their loadout and approach. Using a shotgun for a quick breach, a Sledgehammer for a silent entry, or a Breach Charge to ensure synchronization will significantly impact the outcome of engagements. This flexibility also enhances team coordination, as players can plan and synchronize their breaching strategy based on the tools available to them, promoting communication and teamwork.\n\n### RAPPEL BREACH\n\n- Operators can execute the Rappel Breach without needing to previously damage the barricade or place a Breach Charge.\n- The operator will go through the barricade if it is sufficiently damaged by the end of the interaction.\n    - Otherwise, the operator will bounce back and damage the barricade with its feet.\n\n# WEAPON BALANCING\n\n## BALLISTIC SHIELD\n\nShielded operators will need to plan their paths more carefully, as they will no longer be able to aim down sights while vaulting over objects, through windows, or barricades. This adjustment will reduce their lethality when navigating through barricades, requiring them to rely on teammates to quickly capitalize on targets. We believe this change will encourage more strategic movement around the map and enhance the overall tactical experience.\n\n### BASE\n\n- Vault: Aiming down sight is canceled during the interaction.\n\n### OPERATORS AFFECTED\n\n- Blackbeard\n- Blitz\n- Fuze\n- Montagne\n\n# RANK DISTRIBUTION\n\n* * * * *\n\n![[R6S] Y10S2 Designer's Notes - Y10S1 Rank Distribution PC](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1NCSBxQZA7r04QpoXztQ9G/da19dea082365cffebd4a2d242b1d57e/Y10S1_Rank_Distribution_PC.jpg)\n\n![[R6S] Y10S2 Designer's Notes - Y10S1 Rank Distribution Console](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/qyKNPJn1077a6QWmJNmt2/30c5be46c0fccb133fba9d5c9e651657/Y10S1_Rank_Distribution_Console.jpg)\n\n* * * * *\n\nFollow us and share your feedback on [X](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 14,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/8dJbwMqIt5Y8lZgwJRjWZ/y10s2-designers-notes",
    "date": "2025-05-19T13:15:00.000Z"
  },
  {
    "id": "fUm14ptpr80MNeAOLWt0U",
    "title": "R6 Credit Pack Changes Starting June 10",
    "abstract": "We are adjusting the available in-game credit packs with the launch of Siege X.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3H3zq2ZMvvfFzFCgd6q7wp/8fe65fd41bb7b0e582ee8c0f7465191f/vc_960x540.png",
    "content": "As part of our long-term commitment to Rainbow Six Siege, we're updating our R6 Credit packs on June 10 for the first time in nearly a decade. These changes are designed to ensure we can continue delivering a consistent, high-quality experience - now and in the future.\n\nHere's what's changing:\n\n- The $20 USD/EUR and $35 packs will be replaced with a new __$25 pack__ offering __3,300 credits__\n\n- The $50 pack will include __7,200 credits (vs 7,560 credits today)__\n\n- The $100 pack will include __15,000 credits (vs 16,000 credits today)__\n\n- The $5 and $10 packs will remain the same\n\nDuring Year 10 Season 2, we'll also have the __Premier Pack__ available for a one-time purchase of __$20__, which includes __3,300 credits__ and __exclusive cosmetics__ - offering more value for players who want to jump into the new season.\n\nWhile these adjustments are minor, we understand that even small pricing changes can affect our players, and we take that responsibility very seriously. This update is about making the smallest changes possible while sustaining the game for the long haul and continuing to build a Siege experience we're proud of.\n\n-Rainbow Six Siege Core Team",
    "categories": [
      "rainbow-six-siege",
      "game-updates"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/fUm14ptpr80MNeAOLWt0U/r6-credit-pack-changes-starting-june-10",
    "date": "2025-05-13T12:30:00.000Z"
  },
  {
    "id": "3a6LfnM6paOsjQY6PDvfkC",
    "title": "COMMUNITY ARTIST BUNDLE PROGRAM Y10S2: GLAMBERTILUVU",
    "abstract": "Learn more about the Y10S2 Community Artist Bundle - designed by Glambertiluvu for the operator Iana.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/78DBKEmj7V1YcAVSFcC7ls/0927266d2462ae81b2691277b0b42c82/Iana_CommunityArtist_RuL_960x540.jpg",
    "content": "\n# COMMUNITY ARTIST BUNDLE: GLAMBERTILUVU\n\nThe Community Artist Bundle Program is back with yet another amazing operator set! This bundle has been designed in collaboration with artist Glambertiluvu and will be available for purchase in the in-game store for a limited time, starting May 8.\n\nWith this program, we want to celebrate our amazingly creative and dedicated community artists and give them the chance to have their art styles represented in-game. Each chosen artist will have the opportunity to design a full set for an operator of their choice and the resulting bundles will become available for limited time during Year 9 and beyond.\n\nThis season, the Community Artist Bundle not only supported a talented artist from our community, but proceeds will also benefit several content creators promoting the bundle as part of a new revenue-sharing test opportunity.\n\nGlambertiluvu's Iana Operator Bundle includes:\n\n- Uniform\n- Headgear\n- ARX200 weapon skin\n- Charm\n\nDon't forget to have a look at our previous bundles if you haven't yet: [SAU_SIEGE](https://rainbow6.com/artistbundle_y6s1), [Sunstark](https://rainbow6.com/artistbundle_y6s2), [FrAgMenT](https://rainbow6.com/artistbundle_y6s3), [Pericote](https://rainbow6.com/artistbundle_y6s4), [Shinosaaaaaaang](https://rainbow6.com/artistbundle_y7s1), [Siege Tales](https://rainbow6.com/artistbundle_y7s3), [Retrodisaster](https://rainbow6.com/artistbundle_y7s4), [LevaSoj](https://rainbow6.com/artistbundle_y8s1), and [Notamutemain](https://rainbow6.com/artistbundle_y8s2).\n\n## ABOUT THE ARTIST\n\nGlambertiluvu's - also known as RuL - interest for art started during her childhood as her parents were buying her art books and supplies. This led RuL to create doodles at a very young age, and even to draw on top of the illustrations in her school textbooks when growing up. Due to her obsession with visual arts and painting, she chose graphic design as her university major.\n\nIn 2021, RuL transitioned from semi-realism to a 2D cartoon art style using flat colors. This style is reflected in her bundle for Iana: from the design of the charm to the color palette used throughout the operator and weapon skin. Impressed by Iana's background and obsession for aerospace engineering, she chose to add different references to those in her bundle. Noticeably, the \"space buns\" hairstyle which is derived from the space-themed pop culture. Other starry details such as hair clips and face paint are found on Iana's skin. The most astute eyes will notice the graffiti on Iana's chest armor - \"Meijer\", her real last name.\n\nOriginally playing single-player games such as Assassin's Creed Black Flag, Glambertiluvu was drawn into Siege thanks to Lion's voice actor, Shawn Baichoo, who also interpreted Machiavelli in Assassin's Creed II and Wrench in Watch Dogs 2. She described being chosen to collaborate with the Rainbow Six Siege team on designing this bundle as the highlight of her career, bringing her joy and pride.\n\nAs a final word, we would like to quote RuL: \"I would like to express my gratitude to the R6S community for their passion. Creating this concept art was a labor of love, and I hope it resonates with players as much as it does with me. The community's engagement and enthusiasm inspire me to continue pushing creative boundaries, and I look forward to contributing more in the future.\"\n\nTo see more of Glambertiluvu's work, go check her [Twitter](https://twitter.com/glambertiluvu) and [Instagram](https://www.instagram.com/glambertiluvu/) accounts.\n\n## FAQ\n\n__What is the Community Artist Bundle Program?__\n\nThe Community Artist Bundle Program launched in Y6S1 and it brings operator bundles created by some of our most talented and dedicated Siege fan artists into the game.\n\n__I'm a Siege fan artist too - what can I do to get selected as well?__\n\nGiven the length of our production cycle for in-game content, the fan artists for Year 10 have already been determined. However, we are always on the lookout for future participants. If your goal is to see your bundle in-game, continue showing us your passion and strive to be an outstanding member of the Siege community.\n\n__How can I get the Y10S2 Glambertiluvu Operator bundle?__\n\nThe bundle will be available in the in-game store for a limited time, starting May 8, and will remain live until the end of Y10S3. Players can purchase the bundle with R6 credits.\n\n__Will this offer be available on all platforms?__\n\nYes, it can be redeemed on PC, Xbox One, Xbox Series S|X, PlayStation 4, PlayStation 5, and Amazon Luna.\n\n__How long will this offer be available?__\n\nFollowing its release on May 8, you have until the end of Y10S3 to purchase this bundle in the in-game store.\n",
    "categories": [
      "rainbow-six-siege",
      "community"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3a6LfnM6paOsjQY6PDvfkC/community-artist-bundle-program-y10s2-glambertiluvu",
    "date": "2025-05-08T16:00:00.000Z"
  },
  {
    "id": "1N1qEcXvlvPG8z6EIa2MXx",
    "title": "R6 Shieldguard & Anti-Toxicity – Y10S1 UPDATE",
    "abstract": "Find our latest Anti-Cheat and Anti-Toxicity updates.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2yLNs78nz6j46SLMvWnlMV/baafcf146c8f32a2d3977302d120bf61/image-2025-05-02-14-30-15-848.jpg",
    "content": "Today our R6 Shieldguard and Anti-Toxicity teams will be sharing their latest updates. We'll have a deep dive on features and results from Y10S1, as well as a look at some of the updates coming to the game in the future.\n\n## IN THIS UPDATE\n\n__R6 ShieldGuard__\n\n__ANTI-TOXICITY__\n\n- Standing Distribution\n\n- Impacts - Negative Actions Decreasing\n\n- Tuning & Additional Repercussions\n\n- Automated Textchat Moderation\n\n![[R6S] Player Protection Update Y10S1 Header ShieldGuard 150x960 Y10S1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/573Mkc8xNE3Jz4XPrrUqbV/845b361aff78777362faa96d0f1f07b8/Header_ShieldGuard_150x960_Y10S1.png)\n\n## STATUS OVERVIEW\n\nCheater reports have seen a downward trend throughout Y9S3, and this continued right up to the release of Y10S1.1. Since the Y10S1.1 update, we have seen an increase in cheater reports on PC. Thanks to your in-game cheater reports, our team has identified a correlation to some of our recent security updates.  Below we'll dive into  those updates and the action we're taking to turn this latest development around.\n\n![[R6S] Player Protection Update Y10S1 R6 CheaterReportChart 2024 Y10S1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/69Syc1J83T3IGUXWM60JJY/a37aa628e54b1e5fe8b23f98411c8a68/R6_CheaterReportChart_2024_Y10S1.jpg)\n\n## MAKING OUR CODE STRONGER - NEW TECHNOLOGY\n\nIn Y10S1 and in partnership with the security teams of Ubisoft, we introduced a hardening technology which enables new ways to secure our game code, making it more robust against cheat makers. This new technology now serves as a foundation for many other security improvements that will ship throughout the year.\n\n## WE ARE CONTINUOUSLY IMPROVING\n\nThe in-game impact of this technology was positive initially, though following Y10S1.1, we recorded an increase in cheater reports. We've seen that there is room for improvement, however this has only bolstered our commitment, and so we've worked to push new features throughout Y10S1, making the system more secure. Additionally, we've kept to our commitment to push security updates alongside patches, and so security hotfixes will continue leading up to and after the release of *Siege X*. Two additional security hotfixes are scheduled for deployment in May to further reinforce this approach.\n\n## FIGHTING LAG ABUSE TO PROTECT FAIR PLAY\n\nIn Y10S1, and with the help of the community, we fixed several exploits that were abusing network lag. We want to take the opportunity to heartfully thank the community, from content creators to everyone who submitted R6Fix reports. You have all helped us to both reproduce and fix many of these exploits that were possible on console. We're continuing to monitor the situation and to help prevent lag exploits on a wider basis, we are currently working on a global solution, using stricter network tolerations (More info to come soon).\n\n## PREVENTING MnK ON CONSOLE\n\nPreviously we shared that console cheater reports increased after the launch of Crossplay, and that we fixed an exploit that would allow spoofers to by-pass detection. We can now confirm that reports have seen a drop of approximately 20%. However, Console cheater reports are still higher than pre-crossplay  numbers and we are aware of anti-recoil cheats disrupting the community. Although our data shows that MouseTrap is performing well, catching spoofing devices such as Xim and Cronus, it currently lacks anti-recoil detection capabilities. We want to be clear, anti-recoil cheats are not acceptable, irrespective of platform. Although we cannot communicate on our roadmap at this time, rest assured that this is one of the R6 Shieldguard team's top priorities, and we are actively researching solutions. In the meantime, please continue to submit in-game reports.\n\n## SIEGE X & FUTURE PLANS\n\n__SECURITY UPDATES WITH EACH PATCH__\n\nWe will keep making our code stronger with *Siege X* and beyond. A security update will go live at launch, with more updates rolling out season after season specifically targeting the ability for cheats to stay online and disrupt the game.\n\n__R6 SHIELDGUARD UPDATES LIVE, NO MAINTENANCE REQUIRED__\n\nA major update to R6 Shieldguard will allow us to distribute new executables with updated security measures to players without the need for scheduled maintenance. Periodically, a security update will be downloaded, and players will be asked to reboot their game. Note that this will never happen during a match. After a reboot, players can continue playing, knowing that they are now on a newer executable with new security measures. This will make cheats more difficult to make and more costly to maintain, forcing cheats to stay offline longer.\n\n## SANCTIONS\n\nThanks to the new gameplay violations introduced in Y10S1, combined with automated data analysis and investigations from our team, we continued the momentum from the start of the year by issuing strong permanent ban waves in March, resulting in over 6,500 R6 Shieldguard perma-bans that month alone. On average since the beginning of the year, R6 Shieldguard has issued about 2 times more permanent bans than last year, a clear testament to the performance and evolution of our systems.\n\n## PERMA-BAN NUMBERS - BATTLEYE + R6 BANS\n\nCheck out the last 12 months of perma-ban data, including new data for 2025.\n\n![[R6S] Player Protection Update Y10S1 R6 BanChart Apr24-Mar25 Y10S1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5t8iL2wnnwFAd9CAB4XprS/e25786b8b21aeb1ec4274cdf9b44fe3c/R6_BanChart_Apr24-Mar25_Y10S1.jpg)\n\n## FINAL NOTE\n\nWith *Siege X* on the horizon, R6 Shieldguard remains at the forefront of the fight against cheating. Our team is actively researching, developing, and evolving across all areas of the Anti-Cheat space. Whether you're playing on PC or Console, we have exciting plans to further enhance your experience and ensure a fair game for everyone.\n\n![[R6S] Player Protection Update Y10S1 Header AntiToxicity 150x960 Y10S1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/gzPAX6IJDVYgBv2fzTu4E/a54266af6d10c62c198b1025127661ab/Header_AntiToxicity_150x960_Y10S1.png)\n\nOperation Prep Phase marked the full release of the Reputation System; the Beta tag is gone, and Impacts are now online. This is the first time that players have seen rewards or repercussions based on their Reputation Standing alone, and today our Anti-Toxicity team will be detailing how Impacts have affected the game so far. The team will also be sharing a few details on upcoming updates, and how they plan to make Siege and its Anti-Toxicity systems better for everyone.\n\n## REPUTATION SYSTEM FULL RELEASE\n\n### STANDING DISTRIBUTION UPDATE - [IMPACTS LIVE]\n\nThe activation of Impacts has resulted in a positive change in player behavior, and we've got the data to show it. The percentage of players in positive Standings (Respectable, Esteemed, Exemplary) has increased across the board, while the percentage of those in negative Standings (Disruptive and Dishonorable) has reduced. We can see that players who were previously recurrently toxic have adapted to the new Impacts by changing their behavior. We'd also like to insist on the fact that \"Respectable\" is a good standing where players receive positive perks.\n\n__KEY STATS__\n\nIn comparison to last season we have seen:\n\n- A decrease of -23% players in Dishonorable.\n\n- An increase of +37% players in Exemplary.\n\n![[R6S] Player Protection Update Y10S1 R6 StandingsBarChart Y10S1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2smuGnYJ6wz52B5snczUID/014e5199bdda74868e3abb58b799fcba/R6_StandingsBarChart_Y10S1.jpg)\n\n### IMPACTS - NEGATIVE ACTIONS DECREASING\n\nThere are a number of in-game behaviors that have seen an improvement as part of the shift in Standing distribution. Here are a few stats showing just how behavior has changed in Y10S1 thanks to the full release of the Reputation System.\n\n- -21% change to the number of negative actions per player match (see graph below).\n\n- +21% change to the number of positive actions per player match (see graph below).\n\n- -22% intentional team kills in Ranked and -23% in Standard.\n\n- -16% abandoned matches in Ranked, and -14% in Standard.\n\n- -35% friendly gadget destruction in Ranked, and -43% in Standard.\n\nHere is a detailed look at the amount of negative actions completed per player match, where we can see an overall downward trend. Of course, we do expect these figures to evolve over time, and particularly within the first 90 days of Impact activation. Our team will continue to analyze this data as we move forward, reacting and adapting where necessary.\n\n![[R6S] Player Protection Update Y10S1 Y10S1 ReputationActions Season](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4j3O7IvIchWL791Nax2PIK/c14f3ea134d056927a640914345f6ba2/Y10S1_ReputationActions_Season.jpg)\n\n### DISHONORABLE - ADDITIONAL REPERCUSSIONS\n\nThis season, we added additional measures specifically targeting consistently toxic players. Dishonorable players who continue to significantly exceed the negative unit limit are now automatically temporarily banned. If those players continue to be disruptive after their return, they are manually reviewed for potential permanent ban.\n\n### TUNING, EXPANDING, QOL\n\nLooking ahead, we have plans to improve the Reputation System experience. Our plans include:\n\n- Introducing more nuanced team-kill tracking to alleviate frustration around unintentional incidents.\n\n- Enhancing and expanding positive action recognition.\n\n- Addressing new areas of concern that hinder a positive environment, such as in-game idling, boosting with cheaters, and more.\n\n## AUTOMATED TEXTCHAT MODERATION\n\n### FLAGS AND FALSE POSITIVES\n\nOur Automated Textchat Moderation is helping to reduce toxicity in the game. The percentage of removed and flagged messages has decreased by 50% since launch, even while more messages are being sent overall (see graph below). Over 200 million text chat messages are analyzed each month and fewer than 1% of these are being removed, with less than 2% being flagged.\n\nWe are continuously fine-tuning the system to minimize false positives as much as possible (any messages which are flagged or removed unnecessarily). Currently, false positives are estimated to make up 0.1% of all flagged or removed messages, equating to around 6,000 messages per month. We know that an incorrect flag feels unfair; rest assured that a single false positive should not severely impact your Reputation Standing. We rely on your help to improve the system by reporting any incorrect detections that you experience through [R6Fix](https://r6fix.ubi.com/). Thanks for your cooperation!\n\n![[R6S] Player Protection Update Y10S1 R6 FlaggedMessages SeasonY10S1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7AIgzpTBbQ3FQXI63VtIbT/804c0d7a281b25d4a322fd6417d28093/R6_FlaggedMessages_SeasonY10S1.jpg)\n\n![[R6S] Player Protection Update Y10S1 R6 MessagesSent Y10S1 Final](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4tLppT7ZbZTIvTTRn1bpw3/0a077d28a56c1b9f13e762646b056c1c/R6_MessagesSent_Y10S1_Final.jpg)\n\n## WHAT ELSE IS COMING?\n\nWhile the Reputation System has our full and ongoing support, our team is also working on more features to improve the overall game experience, player comfort, and privacy.\n\n__Automated Voice Chat Moderation:__\n\n- Enhancing detection and enforcement to address the most toxic players using in-game voice chat, across both PC and consoles.\n\n__Improved Privacy Settings for PC and Consoles:__\n\n- Automatically assigning nicknames to players.\n\n- Enabling all privacy settings on consoles.\n\n__Enhanced Abandonment Penalty System:__\n\n- Reducing frustration caused by \"unfair\" abandonment penalties due to crashes.\n\n- Refining detection to focus on players who frequently abandon matches on a long window period.\n\n__Revamped In-Game Reporting:__\n\n- Introducing greater granularity to reporting options.\n\n- Providing players with clearer insights into how their reports are utilized.\n\n## FUTURE OPPORTUNITIES\n\nWe're pleased with the progress made in Siege this year when it comes to reducing toxicity and creating a more welcoming ecosystem. That said, we recognize there is still significant room for growth and refinement. Our ongoing challenge remains to be fostering a positive environment while staying true to the game's unique culture. We do understand that the perception of toxicity can vary greatly though, depending on an individual's sensitivities. As such, not everyone may align with our standards, which is why your feedback is invaluable to us---we're always listening and evolving.\n\nThank you for your continued support, understanding, and patience. Stay positive and make the game better!",
    "categories": [
      "rainbow-six-siege",
      "toxicity",
      "anti-cheat",
      "dev-blogs"
    ],
    "readTime": 10,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1N1qEcXvlvPG8z6EIa2MXx/r6-shieldguard-antitoxicity-y10s1-update",
    "date": "2025-05-08T12:30:00.000Z"
  },
  {
    "id": "3adVE0FPbli42OBNXPdrr3",
    "title": "Y10S1.3 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y10S1.3!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7lLYOpqZt63Sn40epoxgaD/50ec391f059af2a8598851a7191aae4e/PATCHNOTES_Y10S1.3_960x540.jpg",
    "content": "See the upcoming changes to Rainbow Six Siege with the release of Y10S1.3.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Ace Up the Sleeve badge doesn't count during an Ace round when enemy players reconnect to the match.\n\n### USER EXPERIENCE\n\nFIXED - Players are unable to connect on PC with error 0x00000140.\n\nFIXED - Players get stuck on the deployment phase and can't progress the match.\n\nFIXED - Equipped reputation card backgrounds don't update when a player has a change in their reputation.\n\nFIXED - Operator unlock videos don't play when unlocking Operators, and can't be viewed in the Operators section after being unlocked.\n",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 1,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3adVE0FPbli42OBNXPdrr3/y10s13-patch-notes",
    "date": "2025-04-15T09:15:00.000Z"
  },
  {
    "id": "1T6bSlv03vnlIl69xjl6Pd",
    "title": "Y10S1.2 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y10S1.2!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5obhNry0naMX0dXoOUPP12/a4958e299f1ab0502bc47d03ef24c4e9/PATCHNOTES_Y10S1.2_960x540.jpg",
    "content": "See the upcoming changes to Rainbow Six Siege with the release of Y10S1.2.\n\n## BUG FIXES\n\n### OPERATORS\n\nFIXED - Rauora's D.O.M. Panel trigger won't work if the panel is closed while on a drone.\n\nFIXED - Rauora's D.O.M. Panel can't be deployed if it's facing the front of a deployable shield.\n\nFIXED - Rauora's D.O.M. Panel appears lowered in the killcam, even when it's actually raised.\n\nFIXED - Rauora's D.O.M. Panel trigger looks closed or missing after deployment during the end of round.\n\nFIXED - Rauora's D.O.M. Panel is placed incorrectly on a double door during the end of round.\n\nFIXED - Rauora's D.O.M. Panel doesn't deploy on lower floor doorways when shot through a hatch at a specific angle.  \n\nFixed - Rauora's D.O.M. Panel becomes unresponsive when its red target is shot.\n\n### USER EXPERIENCE\n\nFIXED - Universal weapon skins are missing for Skopós' PCX-33.\n",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 1,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1T6bSlv03vnlIl69xjl6Pd/y10s12-patch-notes",
    "date": "2025-04-01T09:15:00.000Z"
  },
  {
    "id": "6XrFt8UTFXgaeLpfcwTVHq",
    "title": "Y10S1.1 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y10S1.1!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/62wFMVJt3CASa65WmGmsO3/380419aa428a9b6b83f005efc7db2d70/PATCHNOTES_Y10S1.1_960x540.jpg",
    "content": "\nHere you can find the fixes for the Y10S1.1 patch.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - End-of-match actions won't be recorded for players who disconnect then reconnect during the match. \n\nFIXED - Several operators' left hands clip through specific secondary weapons during the reload animation when the operator is in a prone position.\n\nFIXED - Rauora's D.O.M. Panel can't be deployed when the operator is facing the front side of the deployable shield.  \n\n<br>\n\n### OPERATORS\n\nFIXED - Deploying a breach charge near the trigger for Rauora's D.O.M. Panel closes the flaps.\n\nFIXED - No points are awarded when successfully deploying Rauora's D.O.M. Panel.\n\nFIXED - Rauora's D.O.M. Panel trigger does not open if the panel is closed on top of a drone.\n\nFIXED - Rauora's D.O.M. Panel won't deploy properly on doorways on a lower level if fired through a hatch.\n\nFIXED - Rauora's D.O.M. Panel won't deploy properly if fired through small hole in a wall.\n\nFIXED - Raurora's D.O.M. Panel crosshair remains visible when using Observation Tools.\n\nFIXED - Maestro's Evil Eye red laser light is improperly positioned, obstructing the player's field of view when using the camera at specific angles.\n\n<br>\n\n### USER EXPERIENCE\n\nFIXED - Incorrect message appears in the \"Ankle Biter\" drone skin description.\n",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6XrFt8UTFXgaeLpfcwTVHq/y10s11-patch-notes",
    "date": "2025-03-24T09:15:00.000Z"
  },
  {
    "id": "5tSruuyHLijziOSKy8Epk8",
    "title": "Access the limited-time R6 Siege X Closed Beta",
    "abstract": "Try out Rainbow Six Siege’s brand-new game mode, Dual Front, from March 13th to March 19th",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/K5EV6DulVy6rFyr2AlnSt/3794d154b0819ac7c51c618cf8860345/R6X_BETA_KEYART_960.jpg",
    "content": "Immediately after the Siege X Showcase on March 13<sup>th</sup>, 2025, players will be able to access and test Dual Front, Rainbow Six Siege's newly revealed 6v6 game mode, in a limited-time Closed Beta.\n\n## WHAT IS DUAL FRONT\n\nThis unique, additional, permanent 6v6 game mode will be set on Siege's biggest map yet. Form up your squad from a curated roster of 35 operators, combining both Attackers and Defenders in ways never before seen, and get ready to secure enemy sectors whilst defending your own.\n\nTune in for the R6 Siege X Showcase to discover everything about Dual Front and get your access to the Closed Beta to try out the game mode.\n\n## EVERYTHING YOU NEED TO KNOW ABOUT THE R6 SIEGE X CLOSED BETA\n\nThe R6 Siege X Closed Beta will run from __March 13<sup>th</sup> @ 12pm PT / 3pm ET/ 8pm CET__, immediately after the conclusion of the R6 Siege X Showcase, to __March 19<sup>th</sup> @ 12pm PT / 3pm ET/ 8pm CET__, and will only be available on PlayStation 5, Xbox Series X|S and PC (Ubisoft Connect).\n\nTo access the R6 Siege X Closed Beta, simply watch the R6 Siege X Showcase on March 13<sup>th</sup>, via the official [Rainbow 6 Twitch channel](https://www.twitch.tv/rainbow6) or via a wide selection of [Content Creators' Twitch livestreams](https://www.twitch.tv/directory/category/tom-clancys-rainbow-six-siege), to earn a Closed Beta Twitch drop.\n\nMake sure to [link your Twitch and Ubisoft accounts](https://www.ubisoft.com/en-us/help/account/article/linking-your-twitch-and-ubisoft-accounts/000079308) in order to claim your drops.\n\nDrops will continue to be available on a selection of participating livestreams during the whole duration of the Closed Beta.\n\nAfter claiming the Closed Beta drop, follow the link sent by email to select your preferred platform to play on. Here are the next steps for each platform:\n\nIf you pick PC\n\n- The Closed Beta will automatically be added to your Ubisoft Connect Library\n- Download the Closed Beta\n\nIf you pick PlayStation 5 or Xbox Series X|S\n\n- You will receive a platform-specific Beta key\n- Redeem the key in the PlayStation Xbox store to unlock the Closed Beta\n- Download the Closed Beta\n\nYou can download and launch the Closed Beta as soon as you complete these steps, however the game servers will go live at the conclusion of the Siege X Showcase.\n\nOwning Rainbow Six Siege is not required to access the Closed Beta.\n\nThe Twitch drop campaign is already live! So join your favorite participating livestream and claim your Closed Beta access!",
    "categories": [
      "rainbow-six-siege",
      "game-updates"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5tSruuyHLijziOSKy8Epk8/access-the-limitedtime-r6-siege-x-closed-beta",
    "date": "2025-03-13T19:30:00.000Z"
  },
  {
    "id": "7gp7yFPZJLTjyJs1pCSVI3",
    "title": "Y10S1 Patch Notes Addendum",
    "abstract": "See the changes made over the course of the Y10S1 Season Test Server.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1VpDvFkcrE9lGt6CaELxb7/422247a2b0945b301509796e1bee4e6e/PATCHNOTES_ADDENDUM_Y10S1_960x540.jpg",
    "content": "You can find here the updates and fixes made over the course of the Y10S1 Season Test Server. Find the full Operation Prep Phase Patch Notes [here](https://rainbow6.com/prepphase).\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Swapping to line of sight has no time limit, causing unintended bot behaviours.\nFIXED - Blackbeard's look/aim direction in from Defender's point of view doesn't match first person view while in free rappel.\nFIXED - The LED is missing when an operator is watching Skopós's idle V10-Pantheon Shell camera.\nFIXED - Blackbeard's fingers look strange when grasping weapons from Defender's point of view.\nFIXED - Starting with the second round on all maps, the Preparation phase red barrier is missing on all doors and windows.\nFIXED - Blackbeard's H.U.L.L. Adaptable Shield remains extended when Blackbeard is knocked back by Oryx's Remah Dash.\nFIXED - Players get minus points as Rook when destroying an empty Armor Pack container.\nFIXED - Animation in first person view is snappy when using Dokkaebi's Logic Bomb.\nFIXED - Broken reload animation on bots in Killcam and End of Round Replay.\nFIXED - Operator's hands are offset for a few frames when reinforcing a wall as a Defender. \n\n<br>\n\n### LEVEL DESIGN\n\nFIXED - Players can peek through a gap between reinforced walls if the soft part is destroyed.\nFIXED - Azami is able to vault on the shelf in 2F garage in Clubhouse by using her Kiba Barrier.\nFIXED - Players can vault on top of the boxes in the middle of the room in 2F Geisha on the Skyscraper map.\nFIXED - Echo's Yokai Drone loses signal on the stairs in 2F South Stairs on the Coastline map.\nFIXED - The drone vent marker disappears even when the player turns on the drone vent option.\nFIXED - A gap is present when a barricade is placed on the door next to B Freezer Stairs on the Oregon map.\nFIXED - Bots can't interact with a briefcase while player is using Melusi in 1F Coat Check on the Kafe Dostoyevsky map.\nFIXED - Floating paper VFX is low resolution regardless of setting in 1F Spiral Stairs of the Consulate map.\n\n<br>\n\n### OPERATORS\n\nFIXED - Rauora's Reaper MK2 emits a reflection when approaching certain areas.\\\nFIXED - Pinging the trigger of the Panel from Rauora's D.O.M. Panel Launcher shows Castle's Icon.\\\nFIXED - Rauora's Reaper MK2 Extended Magazine floats when canceling the reload animation.\\\nFIXED - Rauora's Operator Portrait rarity is missing.\\\nFIXED - When previewing Rauora, the D.O.M. Panel Launcher appears to be floating behind her.\\\nFIXED - Fuze's Ballistic Shield clips into view while deploying a Cluster Charge.\\\nFIXED - Post-shoot animation plays after equipping Rauora's D.O.M. Panel Launcher when it's empty.\\\nFIXED - Weapons are misplaced in Rauora's hands, after switching weapons while aiming down sights of D.O.M Panel Launcher.\\\nFIXED - Closing the Panel from Rauora's D.O.M. Panel Launcher doesn't destroy certain gadgets beneath it.\\\nFIXED - No Charm options available for Blackbeard's H.U.L.L. Adaptable Shield.\\\nFIXED - Operator body snaps for a frame when when they step on their first stair tread while sprinting.\\\nFIXED - Montagne takes bullet damage when a defender shoots precisely at the left side of the Le Roc Shield.\\\nFIXED - Brava's Kludge Drone is invisible in drone view in Match Replay.\\\nFIXED - Thunderbird's Kóna Station camera appears as if it's floating during deployment.\\\nFIXED - Operator's hand clips to their back when picking up the hostage in crouch position.\\\nFIXED - Kapkan's Entry Denial Device laser VFX doesn't show up after installation.\\\nFIXED - Twitch's left hand clips vertically with the observation tools phone when accessing the cameras.\\\nFIXED - Blackbeard's can push through a wall while it's being reinforced.\\\nFIXED - The LEDs on Iana's Gemini Replicator appear misaligned when deploying.\\\nFIXED - Wrong collision material on the glass of Blackbeard's H.U.L.L. Adaptable Shield.\\\nFIXED - Castle's Armor Panel can break if an Operator vaults next to it.\\\nFIXED - Blackbeard's H.U.L.L. Adaptable Shield clips through the floor while in crouch position.\n\n<br>\n\n### USER EXPERIENCE\n\nFIXED - Players get stuck in an empty Siege Cup lobby if they leave the Registration prompt on-screen and confirm after the registration period has ended.\nFIXED - Players receive a D01A error if they reconnect and select 'Keep Playing as a Team' during the After Action Report.\nFIXED - Several UI elements are missing from the player profile side panel when viewed during a local custom game.\nFIXED - Several UI elements are missing from player cards in the local custom game lobby.\nFIXED - Generic description and reward descriptor are both missing from the Reputation Bonus Drops widget.\nFIXED - Players with Disruptive/Dishonorable Reputation Standing are able to register for Siege Cup.\nFIXED - Rick and Morty bundles duplicate after purchase.\nFIXED - Searching for or selecting a weapon skin in Marketplace will give an error message.\nFIXED - Elite animations are not synchronized with the timing of animated props.\nFIXED - The Attackers spawn location is missing on Operator cards when viewed in Spectator mode.\nFIXED - The ban phase always display orange as banning for the spectator client.\nFIXED - Lights on operated observation tools are not visible from a distance of 13m or more.\nFIXED - Camera is blurred when Montagne deflects bullets with Le Roc Extendable Shield.\nFIXED - Previous Seasons section is not showing the ranks of the past seasons.\nFIXED - The Lefty preset assigns both the Aim and Shoot actions to the same input.\nFIXED - Upper and Lower Brackets are not updated after a match is cancelled.\nFIXED - Flawless Round Bonus and Match Victory score points are overlapping at the end of the match.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 5,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/7gp7yFPZJLTjyJs1pCSVI3/y10s1-patch-notes-addendum",
    "date": "2025-03-04T21:15:00.000Z"
  },
  {
    "id": "4Uf2IvRS00iq4XCR2UhkYy",
    "title": "Y10S1 Celebration Pack",
    "abstract": "Celebrate a new era of Siege with a selection of the best cosmetics released in the last 9 years.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2t08tEXWZIsDbLmnDGNASF/d843bc5d88360d7c4b8fb8960f420c72/r6s_celebration_pack.jpg",
    "content": "## BRINGING BACK THE BEST OF SIEGE\n\nWe are celebrating a new era of Rainbow Six Siege with a special limited-time cosmetics pack available only during Y10S1 - the Celebration Pack!\n\nThe Celebration Collection contains the best items released over the last 9 years of Siege, including past limited-time Event Collections, top 20 items from each Battle Pass, and seasonal signature weapon skins as far back as Year 1.\n\nUnopened Celebration Packs will be tradeable on the Marketplace later this year.\n\n### MULTIPLE WAYS TO UNLOCK\n\nCelebration Packs containing duplicates can be unlocked in the free Battle Pass and with Renown:\n\n1 Pack: 15 000 Renown\\\n5 Packs: 75 000 Renown\\\n25 Packs: 337 500 Renown\\\n50 Packs: 600 000 Renown\n\nGet non-duplicate Celebration packs from the Premium Battle Pass and Membership drops.\n\n# CELEBRATION COLLECTION\n\nThe Celebration Collection consists of more than 1400 items made up of 20% legendary, 55% epic, and 25% rare items. Each item has a 0.07% chance of dropping in packs that contain duplicates. Non-duplicate packs have moving odds depending on your inventory.\n\n<center>\n\nSee the complete list [in the PDF file](https://rainbow6.com/celebration_pack_full_list).\n\n![[R6S] Celebration Pack - QR](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6ul9LVVQoPWyGkLD4Ny56I/32933fb9f2ba820bbeec1afd81194cf2/qr-code-celebrationpackfulllist_150.png)\n\n</center>\n",
    "categories": [
      "rainbow-six-siege",
      "shop"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/4Uf2IvRS00iq4XCR2UhkYy/y10s1-celebration-pack",
    "date": "2025-03-03T15:15:00.000Z"
  }
]