[
  {
    "id": "5plhBU3RgPKheHPernoEWK",
    "title": "Y8S4.3 Patch Notes",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y8S4.3!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2oloPdm7LmljbCWmTUSnN6/aa61c483fd7e69526f39e3ec2ce476e8/Y8S4.3_Article.jpg",
    "content": "You can find here the updates and fixes for the Y8S4.3 patch.\n\n## Y8S4.3 Patch Size\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 0.4 GB\n- Steam: 0.3 GB\n- Xbox One: 0.6 GB\n- Xbox Series X: 0.7 GB\n- PlayStation 4: 0.5 GB\n- PlayStation 5: 0.7 GB\n\n# TWEAKS AND IMPROVEMENTS\n\n## GAME HEALTH\n\n### GAME STABILITY\n\nOverall stability of the game has been improved.\n\n### FPS IMPROVEMENTS\n\nWe've addressed FPS drop issue that occurs when Tubarao's Zoto Canister is used. We appreciate the input from the community that helped make this fix possible.\n\n### ANTI-CHEAT\n\nAnti-Cheat has been changed to detect a larger quantity of cheating overall. For more information, check out the devblog.\n\n[https://rainbowsix.com/AntiCheat_Feb24](https://rainbowsix.com/AntiCheat_Feb24)\n\n# BUG FIXES\n\n## LEVEL DESIGN\n\nFIXED - Rooms are too dark on the Consulate map.\n\nFIXED - Drones can't break windows by jumping through them.\n\nFollow us and share your feedback on [X](http://twitter.com/rainbow6game), [Reddit](https://www.reddit.com/r/Rainbow6/), and [Facebook.](https://www.facebook.com/Rainbow6/)",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 1,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5plhBU3RgPKheHPernoEWK/y8s43-patch-notes",
    "date": "2024-02-15T10:30:00.000Z"
  },
  {
    "id": "5YK5Mlv2HjWgV9S2uUXYEO",
    "title": "Y8S4.2 Patch Notes",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y8S4.2!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6D5gOD11es4Kb69dwdUQOP/41e4ee8e40701009405dbe74001d8f01/Y8S4.2_PatchNotes.960x540.jpg",
    "content": "# Y8S4.2 PATCH NOTES\n\nYou can find here the updates and fixes for the Y8S4.2 patch.\n\n## Y8S4.2 Patch Size\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 1.11GB\n\n- Steam: 647 MB\n\n- Xbox One: 0.95GB\n\n- Xbox Series X: 1.2 GB\n\n- PlayStation 4: 1.55GB\n\n- PlayStation 5: 1.14GB\n\n# OPERATOR BALANCING\n\n### ACE\n\n- S.E.L.M.A.'s fuse time increased to 4 seconds (from 3.2 seconds)\n\n### MAVERICK\n\n- Added Smoke Grenades\n\n### THUNDERBIRD\n\n- Added Deployable Shield\n\n### KAPKAN\n\n- Added Bulletproof Camera\n\n- Removed Impact Grenades\n\n### TUBARÃO\n\n- Zoto Canisters decreased to 3 from 4.\n\n- Zoto Canisters no longer affect Maverick's D.I.Y. Blowtorch.\n\n- The electrical insulation effect from Zoto Canisters on metallic objects (reinforcements, deployable shield, etc.) will remain for an additional 1.5 seconds after the gadget ends or is destroyed.\n\n# WEAPON BALANCING\n\n### G-36C\n\n- Increased Vertical and Horizontal Recoil.\n\n### SMG-11\n\n- Damage reduced to 32 (from 35).\n\n### SPAS-15\n\n- Reduced first shot kick.\n\n- Increased lateral recoil.\n\n# BUG FIXES\n\n## GAMEPLAY\n\nFIXED - Player spins in place when having connectivity issues.\n\nFIXED - Blur VFX from damage is not properly applied.  \n\nFIXED - Player passes through barricades without breaking them when using ballistic shield to break the barricade and switching to a weapon at the same time.\n\n## LEVEL DESIGN\n\nFIXED - Breach charges and deployable gadgets can't be placed on the window located at EXT Stable Yard on the Villa map.\n\n## OPERATORS\n\nFIXED - Tubarão's Zoto Canister speed reduction isn't applied if Tubarão is eliminated while holding the canister.\n\nFIXED - Flash VFX doesn't apply when hiding behind Osa's Talon-8 Clear Shield.\n\nFIXED - Electricity VFX continues to play after moving away from an electrified wall affected by Tubarão's Zoto Canister and hit with an EMP grenade.\n\nFIXED - Iana's Gemini Replicator gauge stays red when affected by an electronics interfering device.\n\nFIXED - Azami's Kiba Barrier occasionally doesn't stop bullets.\n\n## USER EXPERIENCE\n\nFIXED - Tubarão's unlock cinematic plays when reaching the main menu after viewing it the first time.\n\nFIXED - Greyed out settings in Options tab don't default to intended states when status is set to private in Ubisoft Connect.\n\nFIXED - Caveira's Luison Silencer missing skin in the loadout menu when the Mata-Leao legendary uniform is applied.\n\nFIXED - View Menu button doesn't redirect to the Playlist menu from the News menu.\n\nFIXED - Lair playlist uses the wrong image.\n\nFIXED - Yellow dot from Play Section is not removed after Tutorials tab is viewed.\n\nFIXED - M590A1 shotgun clips through walls with specific skins.\n\nFIXED - Animated tag is missing from item preivew in the shop menu when viewed in full screen.\n\nFIXED - Brightness is lower in the main menu while in offline mode.\n\nFIXED - Compass on drone doesn't work when viewed in spectator mode.\n\nFIXED - Leave Squad and See Ubisoft Connect Invite buttons do not function properly when leaving a squad.\n\nFIXED - Settings are not retained when using play again option in the home tab after playing a versus AI game.\n\nFIXED - In-game inventory UI does not update when transactions are completed.\n\nFIXED - Osa's idle animation plays for other operators in the Operators tab.\n\nFIXED - Mute buttons aren't functional when joining a game in progress or reconnecting.\n\nFollow us and share your feedback on [X](http://twitter.com/rainbow6game), [Reddit](https://www.reddit.com/r/Rainbow6/), and [Facebook.](https://www.facebook.com/Rainbow6/)",
    "categories": null,
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5YK5Mlv2HjWgV9S2uUXYEO/y8s42-patch-notes",
    "date": "2024-01-23T11:00:00.000Z"
  },
  {
    "id": "1VJt41BV7BPIuQURfavThd",
    "title": "Y8S4.2 Designer’s Notes",
    "abstract": "In this latest edition of Designer’s Notes, we'll go into detail about the balancing changes that’ll come with the Y8S4.2 test server and give you some insight into the reasons behind them",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/181shwE4v3YBBTzimBqQZl/acd88267efb16c021fc2d176b2c8b911/R6_DesignersNotes_Header_Y8S4.2_960x540.jpg",
    "content": "In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y8S4.2 Update and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n## WIN DELTA VS. PRESENCE\n\n![[R6S] Y8S4.2 Designer's Notes - BalancingMatrix Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/252BY6uEA8aY7V8B1gXFsD/d274cbc30314ca215305ee8e0bbb2920/R6S_DN_Y8S4.2_BalancingMatrix_Att.mp4)\n\n![[R6S] Y8S4.2 Designer's Notes - BalancingMatrix Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/492A3jfY2kqJOvTesL1qCm/a4cd18fd05ceaf1f3519eab430b30698/R6S_DN_Y8S4.2_BalancingMatrix_Def.mp4)\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n*Graphs have been adjusted on January 25th to remove some data related to cheaters. We are continuously fighting against cheating and data associated with cheaters will never be taken into consideration when making decision about balancing.*\n\n# OPERATOR BAN RATE\n\n![[R6S] Y8S4.2 Designer's Notes - BanMatrix Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3QG4XyvqKg4gaLGD1bULqf/268d62dd4c674316be2087c824e5c886/R6S_DN_Y8S4.2_BanMatrix_Att.mp4)\n\n![[R6S] Y8S4.2 Designer's Notes - BanMatrix Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/74Ht7pmRM1pXgD4jl2jgSY/a3c8f323af082395452d3b0f74a80d3c/R6S_DN_Y8S4.2_BanMatrix_Def.mp4)\n\n## OPERATOR BALANCING\n\n### TUBARÃO \n\n#### ZOTO CANISTERS\n\n-   Decreased to 3 from 4.\n-   No longer affect Maverick's D.I.Y. Blowtorch.\n-   Electrical Insulation effect extended by 1.5 seconds after Canister destruction. \n\nWe've seen how Tubarão's Zoto Canisters can be used with great success during his time on the live server. Although we're still monitoring his position within the meta as the season progresses and players learn to play and counter play him, we did want to quickly readjust an aspect of his ability following feedback we've received. Reducing the amount Zoto Canisters to 3 will mean players will need to use them more strategically throughout the round. The freezing effect will no longer cause any delay to Maverick's D.I.Y. blowtorch to better position him as a counter to Tubarão. The powerful synergy between Tubarão and Ops like Bandit, or Kaid is something we strongly believe in as it's an integral part of what makes Siege and its operators so interesting. That being said, we did observe that in his current state, those synergies left little room for counter play from attackers. The electrical insulation on metal objects affected by the Zoto Canisters previously lasted only as long as the Canister was active on a surface. The added 1.5 seconds of electrical insulation allow attacking teams with strong coordination a chance to respond and forces the defense to be much more precise in the execution of their strategy if they want to succeed in denying the breach.\n\n### ACE\n\n#### S.E.L.M.A. AQUA BREACHER\n\n-   Fuse time: Increase to 4 seconds (from 3.2)\n\nAce doesn't have many downsides. The S.E.L.M.A. is safe to use, quick to explode, fast to use in succession, opens a relatively big hole, and can destroy bulletproof utility. Its main downside is that it can be destroyed during the breaching process to prevent it from creating a navigable hole. But when compared with the downsides of other Hard Breach Operators, this is clearly not enough:\n\n-   Thermite: Only 1 at a time, must be close to the wall, is exposed while using the charge, but creates a bigger hole.\n-   Hibana: Slow deployment, slow triggering, but can be used from very far and has a lot of flexibility.\n-   Maverick: Requires quite a bit of time, must be close to the wall, is incredibly exposed while using it, but he doesn't have counters.\n\nBy increasing the fuse time, we want to give defenders a better chance to prevent the breach when a lot of resources are dedicated to protecting the wall. The extra time will increase the synchronization required between the breacher enabler (Thatcher, Impact EMP, etc.) and Ace to open an actively defended wall successfully.\n\n### KAPKAN\n\n#### LOADOUT\n\n-   Added Bulletproof Camera.\n-   Removed Impact Grenades.\n\nKapkan has a huge impact on every round regardless of the number of traps triggered. The way attackers must approach the map changes after spotting him or triggering one of his traps. They have to slow down and start paying attention to every window and door frame to ensure they won't blow up. The last buff to the EDDs made this psychological effect even stronger because you may not get a second chance.\n\nWe considered that he already has enough tools to make attackers lose time and the Impact Grenades are helping him be more elusive, allowing him to create rotations on the fly and make attackers invest even more time hunting him through a minefield.\n\n### MAVERICK\n\n#### LOADOUT\n\n-   Added Smoke Grenades.\n\nWe are aware that Maverick is a bit situational without Frag Grenades, and despite not having hard counters, there are not too many situations that justify bringing him over other Hard Breachers and an EMP source. It is dangerous to rely on him as the main breacher because of the time and danger he is in while doing the job. And as a secondary breacher, someone more flexible, such as Ace or Hibana (even the Hard Breach Charge), is usually a less limiting choice for the team.\n\nWe hope that the Smoke Grenades can help him be more appealing as a secondary breacher and increase his flexibility, so he can also help with site execution, or even cover himself while breaching through reinforcements.\n\n### THUNDERBIRD\n\n#### LOADOUT\n\n-   Added Deployable Shield.\n\nWe finished her transition to a more supportive role with the latest tweaks to the Kona Station and loadout changes back in S2.0 but it seems like her utility is not appealing enough.\n\nThe addition of the Deployable Shield will allow her to create genuine strongholds for defenders by herself. The protection from the shield and the backup from the Kona Stations can make any defender in these positions a hard target to deal with. You can add a few Active Defense Systems or Mag-Net Systems to prevent the shield from getting destroyed too easily and attackers will have a tough time trying to move you out of position.\n\nAdditionally, the SPAS-15 is also improved to encourage her to contribute to site setup.\n\nWe believe that these changes can make her more appealing to players who like to experiment with different setups and help their teammates from the backline.\n\n# WEAPON BALANCING\n\n* * * * *\n\n### SPAS-15\n\n#### RECOIL (PC & Console)\n\n-   First shot kick reduced.\n-   Lateral recoil increased.\n-   Elastic time increased.\n\n#### OPERATORS AFFECTED\n\n-   Caveira\n-   Thunderbird\n\nAutomatic Shotguns were left on the sidelines during the Shotgun rework. We were aware that some of the changes introduced could be a bit scary at first sight, so we wanted to be sure that we didn't enter a new Shotgun meta era by buffing the automatic ones too much.\n\nDespite this, we don't have plans to touch them again in the near future (we want to see how everything settles), As we wanted to buff Thunderbird, we found it a good opportunity to make a slight tweak to the SPAS-15. Depending on the effect of these changes, we might give similar treatment to the other automatic shotguns.\n\nWe are reducing the first shot kick, which eases landing consecutive shots on the target and taking full advantage of the automatic mode. On the other hand, we are increasing the lateral recoil and adding a clear tendency to the left, which also reduces its tendency upwards.\n\n### G36C\n\n#### RECOIL (PC & Console)\n\n-   Vertical recoil increased.\n-   Horizontal recoil increased.\n\n#### OPERATORS AFFECTED\n\n-   Ash\n-   Iana\n\nBoth the R4C and ARX-200 have received balancing changes to reduce their power level in the last few years, this has made players gravitate towards the G36C. That combined with Ash and Iana being two of the strongest fraggers on Attack have made the G36C the weapon with the highest Kill Death Ratio on Attack. This alone isn't an issue; it is a strong weapon in the hands of Operators dedicated to \"kills\", but the difference between this weapon and other high KDR weapons in the game is too high. Access to the 1.5x sight is an element that strongly affects this weapon's power level, but also differentiates it from its Loadout competitors the R4-C and ARX-200.\n\nWith all of that in mind we've decided to modify its recoil. It will be harder to control on every axis which will require players to use more \"recoil control\" attachments and increase the difficulty of long-range engagements while using the 1.5x.\n\n### SMG-11\n\n#### BASE STATS\n\n-   Damage: Reduced to 32hp (from 35).\n\n#### OPERATORS AFFECTED\n\n-   Amaru\n-   Mute\n-   Smoke\n-   Solis\n\nFor a very long time, the SMG-11 has been the weapon with the lowest Time to Kill among all automatic weapons by far. The change in damage will put it more in line with all the other weapons, while remaining among the fastest. The change will increase the bullets required to kill 1-armor operators by 1, rewarding precision and punishing spraying and praying. \n\nWe could have reduced the damage even more without affecting the TTKs, but we want it to remain appealing enough to pair with primary shotguns.\n\n* * * * *\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 9,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1VJt41BV7BPIuQURfavThd/y8s42-designers-notes",
    "date": "2024-01-22T20:39:00.000Z"
  },
  {
    "id": "6uMSX3GcrTsISxlA5CMmY",
    "title": "Holiday Pack 2023",
    "abstract": "Happy Holidays from the Rainbow Six Siege team! We've got a surprise for you!  The free 2023 Holiday Pack is available from December 22nd 2023 through January 3rd 2024",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4ISMUiNuNKElKj7oSHEFlk/c410c6884bdf7b7fb7bc36151fc6f9b2/R6S_2023_HP_WEB_ARTICLE.jpg",
    "content": "Happy Holidays from the Rainbow Six Siege team! We've got a surprise for you!\n\nThe free 2023 Holiday Pack is available from December 22nd 2023 through January 3rd 2024.\n\nThe Holiday Pack contains 1 random unowned Operator or a Bravo Pack if all Operators are already owned.\n\nTo get your pack go the shop and claim the \"free gift\" item. The in-game news bulletin should also direct you there.\n\nWe hope you enjoy and have a great time heading into the new year.\n\n<hr>\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 1,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6uMSX3GcrTsISxlA5CMmY/holiday-pack-2023",
    "date": "2023-12-22T11:00:00.000Z"
  },
  {
    "id": "22JLMFeayzuamhb7YKbAjm",
    "title": "Reputation System: Activation & More",
    "abstract": "See what’s new with the activation of the Reputation System.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3taVHo04St955M8kQ6BbD4/afa28642138304aa21713fa9d294dfba/SystemActivation.960x540.png",
    "content": "Operation Deep Freeze has brought with it the full release of the Reputation System in a grace period. Here we'll be covering what the full release means for players, how it will continue to improve, and the actions we've recently taken to further protect players.\n\n## PHILOSOPHY & GOAL\n\nWith the Reputation System, we are staying true to our core pillars:\n\n- __MITIGATE & DETER BEHAVIOR__\n- __PREVENT & ADDRESS__\n- __FEEDBACK & GUIDANCE__\n\nFollowing our core principles, we aim to shield our players against toxicity, curb in-game disruptions and negative behavior, encourage \"pro-social\" behavior, reform or remove toxic players, and more, while ultimately reinforcing the cooperative nature of Siege.\n\nOur guiding philosophy with the Reputation System itself is that each player should know why they have a particular Reputation Standing, what they can do to modify their playstyle or interactions and improve their position in the Reputation System. We want to ensure that players have the proper tools available to them and the opportunities to make any necessary adjustments. This release of the Reputation System marks an essential step for us, and with player feedback being a crucial part of our strategy, we will be listening to your thoughts and concerns.\n\n## SEASON 4 - WHAT'S NEW?\n\n### REVEAL RECAP\n\nBefore we delve into the latest Reputation System update, if you didn't see our Operation Deep Freeze reveal panel, we've got a recap covering what's been added in Y8S4 and what to expect in the future.\n\n<https://youtu.be/f2hqIkZSYe8>\n\n### GRACE PERIOD\n\nThe Reputation System has been released with updated features and UI, and an ongoing grace period. This grace period means that __there will currently be no impact__ based on a player's Reputation Standing alone, giving players an opportunity to become accustomed to the updated system and to adjust any behaviors before the impacts go live. In the meantime, we will be monitoring the system, collecting feedback, and performing calibrations, ensuring the Reputation System is ready before the grace period is lifted. Note however, that __this grace period does not affect currently implemented penalties__ such as communication penalties and reverse friendly fire that are already live.\n\n### REPUTATION CENTER UPDATE\n\nWe've updated the Reputation Center to bring even more information to players. Now you'll be able to see your biggest opportunities for improvement, the impacts that your Reputation Standing could have (after the grace period), and more.\n\nTwo new sections in the updated Reputation Center are Tips and Guides. Here we're sharing tips that can help players to improve their Reputation Standing and on their way to becoming great Siege community members and players.\n\n![[R6S] Reputation System: Activation & More - Rep Center](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6CQEEMlCxuyvo8I9iygZnq/0190ec1686afb0e49d2e944c9fd5c514/RepCenter.960x540.png)\n\nWith this release you'll start to see notifications with information about changes to your Reputation Standing. Players will be notified of Reputation Standing adjustments, as well as any possible effects current behavior could have on their Reputation Standing in the future. As part of these notifications, we'll also share the impacts that a player could face once the grace period has come to a close.\n\n![[R6S] Reputation System: Activation & More - notification](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4OTB9eWIFtsoERDNsHUTQY/bd5cfee06e029cc07b7b1bb6734a0361/Notifications.960x540.png)\n\n### NEW IMPACTS\n\nOnce the grace period has ended, there will be a range of positive and negative impacts depending on a player's Reputation Standing. We will share further updates in the future regarding when the grace period will end.\n\nHaving positive and good behaviour could bring:\n\n- Improved Renown gain.\n- Increased experience points.\n- Bonus Alpha Pack progress.\n- Unique rewards.\n\nAlternatively, negative and unwanted behavior could lead to:\n\n- Reduced experience and rewards.\n- Ranked rewards locks.\n- Playlist locks.\n\nThese negative impacts have been specifically chosen to help players to rehabilitate and adapt their behaviors in order to have those effects reversed or removed later in their journey.\n\n__PLAYLIST & RANKED REWARDS LOCKS - \\[NOT ACTIVE DURING CURRENT GRACE PERIOD\\]__\n\nPlayers who find their playlists restricted will need to increase their Reputation Standing in order to make them available once more. This means that players who have the lock enabled will actively need to change their behaviors in the remaining game modes, resulting in those good behaviors being reinforced.\n\nThe Ranked rewards lock will behave similarly to the playlist lock, and those who receive a lock on the upcoming Ranked rewards will also have opportunities to rectify the situation. In the following season players who increase their Reputation Standing to Respectable, will have their previous rewards granted.\n\n## PROTECTING PLAYERS AND CREATORS FROM REPORT ABUSERS\n\nIn-game reporting is incredibly helpful to our Player Protection team. Your in-game reports help to make our automatic detection more robust; they assist in investigations carried out by our Player Protection team, and aid in creating a safer playspace for everyone.\n\nWe do also want to reiterate to players that while in-game reporting continues to be an invaluable tool for our Player Protection team to leverage, __players will not be sanctioned based on in-game reports alone.__\n\nWe want players to know they can make use of the in-game reporting system, though we know that there are others looking to misuse these reporting tools as a method of abuse. Following your feedback, we've updated our system to better account for and to prevent report spamming. Critically however, players with poor behavior will still be able to be reported correctly, resulting in possible Reputation Penalties or game sanctions. In the future, we will continue to strengthen our validations while building upon and creating new safeguards, further increasing the robustness of our systems.\n\n## REPUTATION STANDING ACCURACY\n\nCurrently, the Reputation System already takes advantage of a whole host of positive and negative stats including in-game reports, Commendations, Reverse Friendly Fire, abandon abuse, and more, with the use of safeguarding logic. While these have given us enough data overall to provide a fair representation of a player's behavior, we know that we can further increase precision with additional data points covering other common player behaviors. To this end, we're working on including more granular data to define a player's Reputation with even more accuracy.\n\n## CONCLUSION\n\nThe new improvements we are introducing this season should greatly reduce occurrences of players finding undeserved reports on their Misconduct page, while also stopping illegitimate Reputation Penalties in worst case scenarios. If you continue to experience any issue with the Reputation System after this update, please report it via [R6Fix](https://r6fix.ubi.com/).\n\nYou should expect to see additional adjustments and communications in the months to come around balancing, additional actions and protections, and Reputation Standing impacts, as we work to create a system that works best for everyone. We are always listening to your feedback and working on improvements to better reflect our goals; we want to make sure we're achieving the right results by rewarding positive and reputable players, while helping other players to improve their behavior.\n\nAs we continue into Y8S4 Operation Deep Freeze, keep in mind that the Reputation System will remain in a grace period. During that time, you'll get to see the impact of your in-game actions in the Reputation Center __without having the effects applied__. None of the impacts highlighted in the Reputation Center will be activated until this system is fully balanced and officially released, however, Reputation Penalties which are already live such as voice or written chat Penalties will continue to work as usual.\n\nWe want Siege to not only be a game of competitiveness and strategy, but also of joy and comfort. The Reputation System forms an essential component of our strategy to protect players, and we remain dedicated to our mandate of creating a welcoming environment for all.",
    "categories": [
      "rainbow-six-siege",
      "toxicity"
    ],
    "readTime": 7,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/22JLMFeayzuamhb7YKbAjm/reputation-system-activation-more",
    "date": "2023-12-18T14:30:00.000Z"
  },
  {
    "id": "74jMoilp5AghJCQpjcEoE2",
    "title": "Y8S4.1 Patch Notes",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y8S4.1!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/37gOBvZUlC6XMwThNj0rA9/63b3e2fe2c48688479d63841cd902bfe/Y8S4.1_PatchNotes.960x540.jpg",
    "content": "You can find here the updates and fixes for the Y8S4.1 patch.\n\n## Y8S4.1 Patch Size\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 1.36 GB\n- Steam:  0.6 GB\n- Xbox One: 0.9 GB\n- Xbox Series X: 1.2 GB\n- PlayStation 4: 1.96 GB\n- PlayStation 5: 1.24 GB\n\n# BUG FIXES\n\n## GAMEPLAY\n\nFIXED - Lair is unavailable in Free For All mode.\n\nFIXED - AI bots attempt to breach reinforced walls with C4 explosives or Impact Grenades.\n\nFIXED - Players are unable to vault some railings across various maps.\n\n## LEVEL DESIGN\n\nFIXED - Drones can get stuck in EXT Street of the Attack Tutorial map.\n\nFIXED - Cork board prevents line of sight by clipping through wall at 1F Staff Room of Bank map.\n\nFIXED - Unintended line of sight can be reached with Azami's Kiba Barrier on a small wheel at 1F Cargo of the Nighthaven map.\n\nFIXED - Placeholder asset is visible in the north-west side of the Lair map while using caster mode.\n\nFIXED - Iana's Gemini Replicator can go out of bounds when deployed near the boxes at EXT Lift of the Lair map.\n\nFIXED - Frag grenade damage passes through a wall at 2F Library of the Chalet map.\n\nFIXED - Explosive damage passes through elevator doors at B Vault Lobby of the Bank map.\n\nFIXED - Players can get out of bounds using Azami's Kiba Barrier to vault onto a railing at EXT Shooting Range of the Lair map.\n\nFIXED - Players get stuck in falling animation on top of barrels in Tutorial 1 of the Attack Tutorial map.\n\nFIXED - Players get stuck in prone between a railing and a stone wall at EXT Lift Exit of the Lair map.\n\nFIXED - Players have an unintended line of sight between a desk and boxes located at 1F Briefing of the Lair map.\n\nFIXED - Various defuser planting and pickup issues.\n\nFIXED - Player can't retrieve throwable devices in specific spots on various maps.\n\n## AUDIO\n\nFIXED - Missing voice line during onboarding HQ in Landmark Drill, Target Drill, or Shooting Range drill. \n\n## OPERATORS\n\nFIXED - Missing VFX for Frost's Welcome Mat and Ela's Grzmot Mine when affected by Tubarao's Zoto Canister.\n\nFIXED - Missing VFX for Blitz's Flash Shield when affected by Tubarao's Zoto Canister.\n\nFIXED - Missing hit marker when destroying Melusi's Banshee Sonic Defense.\n\nFIXED - Misplaced freeze VFX when shooting while affected by Tubarao's Zoto Canister.\n\nFIXED - Score doesn't update when Tubarao's Zoto Canister freezes Opponent devices.\n\nFIXED - Warden's Glance Smart Glasses don't protect against Ying's Candela.\n\nFIXED - Various animation issues.\n\n## USER EXPERIENCE\n\nFIXED - Battle Pass content disappears when swapping between multiple menus quickly.\n\nFIXED - Amaru's Broad Blade weapon skin clips through walls.\n\nFIXED - Community Challenge UI disappears after waiting several minutes in the Challenges menu.\n\nFIXED - Option to invite players is greyed out when creating a squad.\n\nFIXED - Lair playlist uses wrong image.\n\nFIXED - Various spectator mode issues.\n\nFollow us and share your feedback on [X](http://twitter.com/rainbow6game), [Reddit](https://www.reddit.com/r/Rainbow6/), and [Facebook.](https://www.facebook.com/Rainbow6/)",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/74jMoilp5AghJCQpjcEoE2/y8s41-patch-notes",
    "date": "2023-12-12T10:30:00.000Z"
  },
  {
    "id": "BY4Wjhg2KY6kJvFzb1dvd",
    "title": "Y8S4 Patch Notes Addendum",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y8S4!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1GnYz4WXUAoIN54KKDlrAQ/ea2363e5c090ccc9f7b4e9792f9586a4/y8s4_patchnotes_addendum.jpg",
    "content": "You can find here the updates and fixes made over the course of the Y8S4 Season Test Server.\n\n## Y8S4 Patch Size\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect\n  - Base: 44.38 GB\n  - HD: 75.46 GB    \n- Steam:\n  - Base: 39.9 GB\n  - HD: 67.9 GB    \n- Xbox One: 35 GB\n- Xbox Series X: 39.4 GB\n- Playstation 4: 37.5 GB\n- Playstation 5: 35.88 GB\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Loadout changes between rounds when an Operator is picked by idling.\n\nFIXED - Round ends in a draw if a Volcan Canister is destroyed near a hostage while Goyo is eliminated.\n\nFIXED - Zero's Argus Launcher does not lose sight reticle or laser when deactivated by the Bulletproof Camera EMP.\n\nFIXED - Hard Breach Charge can't be deployed on a small area of the reinforced wall.\n\nFIXED - Hostages can set off Lesion's Gu Mines.\n\nFIXED - Basic Tutorial progress can be soft locked in multiple ways.\n\nFIXED - Attack Tutorial becomes soft locked if AI destroy the drone.\n\nFIXED - Damage falloff and curves do not match description when 2 players are in Custom Game or the Shooting Range.\n\nFIXED - Players can't lean while holding a drone while using controller.\n\nFIXED - Players can't lean function if holding one of several Observation Tools.\n\nFIXED - Game crashes when AI revives a teammate.\n\nFIXED - Player can't look around when exiting Rappel.\n\nFIXED - Scope sight disappears when in range of Mute's Signal Disruptor.\n\n### LEVEL DESIGN\n\nFIXED - Players get stuck at EXT Street when vaulting over 2F East Corridor barricade after breaking it in the Defense Tutorial.\n\nFIXED - Missing texture for pipe assets on the Clubhouse map that can be exploited by Valkyrie or Zero.\n\nFIXED - Drones can't navigate through the EXT Guard Tower opening on the Fortress map during Preparation Phase.\n\nFIXED - Players can reach an unintended vantage point in the north-eastern corner of the 1F Staff Room of the Bank.\n\nFIXED - Players can vault onto unintended vantage point at 2F Dorm Main Hall of the Oregon map.\n\nFIXED - Players can remain stuck in between the bomb and an indestructible coffee machine at B Cafeteria on the Consulate map.\n\nFIXED - Players can remain stuck in falling animation between metal pads and the metal rail located in EXT Street of the Attack Tutorial map.\n\nFIXED - Players cannot vault over the kitchen counter in 1F Staff Room of the Bank map.\n\nFIXED - Ace's S.E.L.M.A. fails to deploy on the lower destructible wall in 2F Meeting Room of the Consulate map.\n\nFIXED - Floating tree during the MVP screen of the Villa map.\n\nFIXED - Wrong compass location displayed between 1F East Stairs and 2F East Stairs of the Border map.\n\nFIXED - B site bomb isn't detected from 2F Display Room on the Lair map.\n\nFIXED - Lighting issues west of EXT South Dock on the Lair map.\n\nFIXED - Valkyrie's Black Eye can be hidden in lights in B Warehouse of the Lair map.\n\nFIXED - Texture clips through wall at 2F Blue Stairs on the Lair map.\n\nFIXED - Texture clips through wall at 2F Mezzanine on the Lair map.\n\nFIXED - Player is unable to vault onto the desk in 2F R6 Room of the Lair map.\n\nFIXED - Players can navigate on to a trash bin for an unfair line of sight through a window in 1F Security Hallway of the Lair map.\n\nFIXED - Players can navigate out of bounds by vaulting onto some crates and the cargo container in EXT Lift of the Lair map.\n\nFIXED - Attackers don't detect bomb sight located at 1F Bar or 1F Lounge of the Emerald Plains map unless they are using a drone or using IQ's Electronics Detector. \n\nFIXED - Various collision, asset, and texture issues on maps. \n\n### OPERATORS\n\nFIXED - Holes made by Maverick's Breaching Torch are hidden if affected by Tubarao's Zoto Canister.\n\nFIXED - Missing VFX for Damaged walls when affected by Tubarao's Zoto Canister.\n\nFIXED - Zero's Argus Camera can be hidden through destructible map assets.\n\nFIXED -  Amaru's Garra Hook launcher losses functionality if player goes prone while deploying the hook.\n\nFIXED - Amaru's Garra Hook can clip through wall.\n\nFIXED -  Goyo's Volcan Canister becomes invisible or stuck when a drone is deployed at the same time.\n\nFIXED - A Kludge Drone that's been hacked by a Defender can no longer hack if Dokkaebi takes over Defender Observation Tools.\n\nFIXED - Wrong animation plays for Zofia and Tachanka when self-reviving with Thunderbird's Kona Station\n\nFIXED -  Clash can fire her weapon before the weapon swap animation finishes.\n\nFIXED - Floating wall remains for a few seconds after destroying Sen's R.O.U. projector during deployment.\n\nFIXED - Players that are downed aren't affected by Sens' R.O.U. Projector System.\n\nFIXED - Valkyrie's Black Eye losses signal if it's thrown into the crevices of the ceiling at 1F Main Stairs of the Border map.\n\nFIXED - Valkyrie's Black Eye is losses signal when thrown on to the ceiling at 2F Astronomy of the Villa map.\n\nFIXED - Grim's Kawan Hive is destroyed when shot within Mute's Signal Disruptor range.\n\nFIXED - Wrong animation plays for players affected by Fenrir's F-NATT Dread Mine while leaning left and running.\n\nFIXED - Fenrir's F-NATT Dread Mine location list appears as placeholder when placed on the outside tower in EXT Back Alley of the Theme Park map.\n\nFIXED - Iana can sprint after self-reviving from Frost's Welcome Mat.\n\nFIXED - Kapkan's Entry Denial Device can be deployed through Azami's Kiba Barrier.\n\nFIXED - CSRX 3000 scope is distorted when affected by Tubarao's Zoto Canister.\n\nFIXED - Tubarao's Zoto Canister is misplaced during Victory Celebration.\n\nFIXED - Missing VFX for drones when Tubaro's Zoto canister freezing effect ends.\n\nFIXED - Wrong VFX plays when using melee attack on destructible objects while affected by Tubarão's Zoto Canister.\n\nFIXED - Ram's Bu-GI Auto-Breacher idle SFX still plays when affected by Tubarão's Zoto Canister.\n\nFIXED - Smoke explosion VFX are missing for Tubarão's Zoto Canister. \n\nFIXED - If Grim's Kawan Hive is frozen by Tubarão's Zoto Canister and destroyed, it still deploys once the freeze effect wears off.\n\nFIXED - Players can be permanently affected by Tubarao's Zoto Canister freeze VFX.\n\nFIXED - Players are permanently affected by Tubarao's Zoto Canister freeze VFX after removing a barricade with the effect.\n\nFIXED - Gadgets are not destroyed by electricity after Tubarao's Zoto Canister effect wears off.\n\nFIXED - Devices are affected by Tubarao's Zoto Canister outside of intended range if the operator is within range of the freeze effect.\n\nFIXED - Ela's Grzmot Mine remains deactivated after Tubarao's Zoto Canister freeze effect disappears.\n\nFIXED - Tubarao's Zoto Canister freeze VFX doesnt appear on some operators.\n\nFIXED - Various animation issues.\n\n### USER EXPERIENCE\n\nFIXED - RTS camera rotation is inverted when viewing a match as a spectator.\n\nFIXED - Map text and preview loads incorrectly when multiple online Custom Matches load.\n\nFIXED - HUD disappears for Defenders when Attackers pick up the hostage.\n\nFIXED -  Host cannot send invite to spectator if the teams lobby is full.\n\nFIXED - Hostage escort prompt is missing if a previous attempt to grab them is canceled halfway through.\n\nFIXED - Hip fire crosshair is missing during match replay.\n\nFIXED - LEDs on deployed Breach Charge are blue regardless of team color options.\n\nFIXED - Some devices and weapons remain on-screen during the Victory screen.\n\nFIXED - Aim toggle mode on controller differs from aim toggle mode on PC.\n\nFIXED - Controller input doesn't work for swapping between commendation timelines in the Reputation section.\n\nFIXED - Commendation graph bars show up backwards in Reputation section.\n\nFIXED - Commendation graph number axis doesn't scale properly when switching between Lifetime and Season commendations.\n\nFIXED - HUD bars for multikill persists for in Spectator mode and Match Replay.\n\nFIXED - Double kill notification is missing in Spectator mode and Match Replay.\n\nFIXED - Skybox is displayed briefly in Home section when joining or leaving a match.\n\nFIXED - Wrong season and background displayed for Tubarao's showcase in the Operators section.\n\nFIXED - Players can only interact with their current commendation in the Reputation section.\n\nFIXED - Bulletproof Camera icon is displayed on the player's HUD after being affected by Clash's CCE Shield.\n\nFIXED - Lair background image is missing in custom lobbies.\n\nFIXED - Various audio issues.\n\nFIXED - Various UI issues.\n\nFIXED - Various spectator mode issues.\n\n### AUDIO\n\nFIXED - SFX for Nomad's Airjab isn't interrupted when affected by Tubarao's Zoto Canister freeze effect.\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game), [Reddit](https://www.reddit.com/r/Rainbow6/), [Facebook](https://www.facebook.com/Rainbow6/) and on our [forums](https://discussions.ubisoft.com/category/609/rainbow-six-siege?lang=en-US).",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 8,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/BY4Wjhg2KY6kJvFzb1dvd/y8s4-patch-notes-addendum",
    "date": "2023-12-06T14:30:00.000Z"
  },
  {
    "id": "5DRZZFjkZ8LpXoBKGr7GU9",
    "title": "Y8S4 Streamer Charms",
    "abstract": "New Rainbow Six Siege Streamer Charms for Y8S4!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2GzNBwzWIdrr39fIhGw839/eeffe5aa7757a85ae259fbc7dbd59b39/Y8S4.StreamerCharms.Heade2.jpg",
    "content": "# New Rainbow Six Siege Streamer Charms for Y8S4!\n\n## Announcing the next Streamer Charms!\n\nEach season will bring the release of new charms, as well as the return of streamer charms from previous seasons!\n\n## New\n\n![[R6S] Y8S4 Streamer Charms Header 2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2GzNBwzWIdrr39fIhGw839/c80bb39a72d66f5d4fe5a18a00cec5d9/Y8S4.StreamerCharms.Heade2.jpg)\n\n[Bravenika](https://www.twitch.tv/bravenika)\n\n[Giselleglezv](https://www.twitch.tv/giselleglezv)\n\n[Jenz](https://www.twitch.tv/jenz)\n\n[Scythe](https://www.twitch.tv/scythe)\n\n## Returning\n\n![[R6S] Y8S4 Streamer Charms - img1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2MlmXK9hRtGNpDmdnW8rUY/856e1be8a144554e3e2309a0cb5e9209/y8s4_charms_updated_1.jpg)\n\n![[R6S] Y8S4 Streamer Charms - img2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6Fgf09YWqs562uCnNPG4Ny/9a5108fc1de9ba3b7bc5c78debbe2767/y8s4_charms_updated_2.jpg)\n\n![[R6S] Y8S4 Streamer Charms - img3](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5OQKr5GM2iJYEbnGNxSib4/1700271c040ef1a29328e6f372780ec4/y8s4_charms_updated_3.jpg)\n\n![[R6S] Y8S4 Streamer Charms - img4](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/50rECRXIUpmG85gLpZsA2A/41cbb7efd37f7142cf279ff2add19035/y8s4_charms_updated_4.jpg)\n\n[Ad9m](https://www.twitch.tv/ad9m)\n[Alfredoplays](https://www.twitch.tv/alfredoplays)\n[AnneMunition](https://www.twitch.tv/annemunition)\n[Beaulo](https://www.twitch.tv/beaulo)\n[Bighead](https://www.twitch.tv/bighead033)\n[BikiniBodhi](https://www.twitch.tv/bikinibodhi)\n[Bnans](https://www.twitch.tv/bnans)\n[Braction](https://www.twitch.tv/bractionfps)\n[CCSesports](https://www.twitch.tv/ccsesports)\n[Drid](https://www.twitch.tv/dridgg)\n[FastAnne](https://www.twitch.tv/fastanne)\n[Gabbo](https://www.twitch.tv/JustGabbo)\n[Heideltraut](https://www.twitch.tv/heideltraut)\n[Interro](https://www.twitch.tv/interro)\n[JerichoFive](https://www.twitch.tv/jerichofive)\n[JessGOAT](https://www.twitch.tv/jessgoat)\n[Jynxzi](https://www.twitch.tv/jynxzi)\n[Just9n](https://www.twitch.tv/just9n)\n[Kalera](https://www.twitch.tv/Kalera)\n[KingGeorge](https://www.twitch.tv/KingGeorge)\n[KittyR6](https://www.twitch.tv/kitty_r6)\n[LagonisR6](https://www.twitch.tv/lagonis)\n[Lil_Lexi](https://www.twitch.tv/lil_lexi)\n[Lt Custard](https://www.twitch.tv/lt_custard)\n[Lusorkoeffizient](https://www.twitch.tv/lusorkoeffizient)\n[MacieJay](https://www.twitch.tv/MacieJay)\n[Mag6](https://www.twitch.tv/mag6)\n[M3RYLAND](https://www.twitch.tv/M3RYLAND)\n[Matimi0](https://www.twitch.tv/matimi0)\n[MrBboy45](https://www.twitch.tv/mrbboy45)\n[Narcoleptic Nugget](https://www.twitch.tv/narcolepticnugget)\n[Nesk](https://www.twitch.tv/neskwga)\n[PaladinAmber](https://www.twitch.tv/paladinamber)\n[Patife](https://www.twitch.tv/patife)\n[Pengu](https://www.twitch.tv/pengu)\n[RazaH](https://www.twitch.tv/razah)\n[REMGURI / 렘쨩](https://www.twitch.tv/remguri)\n[Rubsarb](https://www.twitch.tv/Rubsarb/)\n[SexyCake](https://www.twitch.tv/smexycake)\n[Sha77e](https://www.twitch.tv/sha77etv)\n[Shorty](https://www.twitch.tv/shortyyguy)\n[shroud](https://www.twitch.tv/shroud)\n[SilphTV](https://www.twitch.tv/silphtv)\n[Tatted](https://www.twitch.tv/tatted)\n[Tranth](https://www.twitch.tv/tranth)\n[Varsity](https://www.twitch.tv/varsitygaming)\n[WhiteShark67](https://www.twitch.tv/whiteshark67)\n[yo_boy_roy](https://www.twitch.tv/yo_boy_roy)\n[z1ronic](https://www.twitch.tv/zironicdk)\n[Zander](https://www.twitch.tv/zander)\n[ziGueira](https://www.twitch.tv/zigueira)\n[GarfieldIsDoc](https://www.twitch.tv/garfield)\n[Supr](https://www.twitch.tv/supr)\n[RyyFyy](https://www.twitch.tv/ryyfyy)\n[FoxA](https://www.twitch.tv/foxa_r6)\n[Nerdengenheiro](https://www.twitch.tv/nerdengenheiro)\n[Rainbow6itacom](https://www.twitch.tv/rainbow6itacom)\n[Minimichegga](https://www.twitch.tv/minimichegga)\n[JostRekt](https://www.twitch.tv/jostrekt)\n[JustRyuk](https://www.twitch.tv/justryuk)\n[Paluhh](https://www.twitch.tv/paluhh)\n[Poxonlox](https://www.twitch.tv/poxonlox)\n[TheLionerYT](https://www.twitch.tv/thelioneryt)\n[itsSpoit](https://www.twitch.tv/itsspoit)\n[Retalha](https://www.twitch.tv/retalha)\n[FooYa](https://www.twitch.tv/fooya)\n[IceCold](https://www.twitch.tv/icecold)\n[Athieno](https://www.twitch.tv/athieno)\n[Marciu](https://www.twitch.tv/marciu)\n[Rembeey](https://www.twitch.tv/reembey)\n[rasco100](https://www.twitch.tv/rasco100)\n[Vetelcito01](https://www.twitch.tv/vetelcito01)\n[OneShooter](https://www.twitch.tv/oneshooter)\n\n## How to acquire charms\n\nThese charms are only available by subscribing to the respective streamer's Twitch channel with a linked Ubisoft account. For more information on how to link your Ubisoft and Twitch account, as well as opt in for Twitch Drops, please refer to [this FAQ](https://support.ubi.com/Faqs/000035432/Get-your-Twitch-Streamer-s-charm).\n\n## How to get involved\n\nWe are always on the lookout for content creators that inspire and enrich the Siege community. If you would like access to the perks of being a partnered content creator, and your goal is to one day have a charm in the game, we would like to invite you to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/en-us).",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5DRZZFjkZ8LpXoBKGr7GU9/y8s4-streamer-charms",
    "date": "2023-11-22T16:30:00.000Z"
  },
  {
    "id": "3np0dmOyTZY3BVXe4qcRZQ",
    "title": "Classified: Connectivity",
    "abstract": "A Review of connectivity in 2023 and a look at what's next.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/28CmEI8WhTFyi5P3WxJHEA/a097a73b1b43930097a56f7aad390f83/Classified_Connectivity_960x540.png",
    "content": "Whether you're jumping into Arcade or getting your squad together for a Ranked session, the one thing that all players need is a reliable online experience. In this blog, we'll shed some light on connectivity in 2023, look at what we've achieved, analyze any unplanned downtime, and take a peek at what the Connectivity team is working on.\n\n## A YEAR IN REVIEW\n\nFirstly, let's take a closer look at some of the changes brought to the game over the past year that had directly impacted Connectivity, so that we can deep dive into some of the solutions put in place to improve the overall player experience.\n\n### UNPLANNED MAJOR DOWNTIME  \n\nDowntime is likely to be the biggest concern for most players when it comes to connectivity. Downtime of a game's online services can have a wide array of causes, many of which are not linked to the game's servers themselves. Issues related to new features included as part of an update or the process and logistics behind patch deployment are just a couple of examples of triggers that could result in an online services outage. While our Connectivity team works to ensure our servers are ready for players at all times, we have multiple teams who are making improvements on their side too, with an aim to minimize these extra trigger sources as much as possible.\n\nBelow you will see the total unplanned major downtime for each month this year so far. We can see that while the most recent months of September and October have been a relative success, there are three main spikes throughout the year prior to this. Let’s inspect those spikes, why they occurred and how our teams responded.\n\n![[R6S] Classified: Connectivity 2023 - img V2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/lOkeLV2qfvDeR0sHHUnRb/376e08c564de21f5fc8e73a5ffce7f8e/UnplannedDowntimeChart.v2.png)\n\n__JANUARY__\n\nJanuary saw 15 hours and 54 minutes of unplanned downtime with a number of unique causes being identified, part of which was related to the release of Crossplay. The Connectivity team worked through both December and January bringing stability to the game and establishing areas where revisions or improvements were required. Each instance of downtime was also independently investigated by our teams, with steps taken on how to avoid or mitigate the effects of similar issues in the future. Changes made as a result of the investigations have since helped to reduce impacts from similar events.\n\n__APRIL__\n\nIn April, we had 7 hours of unplanned outages across three separate incidents all again having a unique cause. In all cases, the Connectivity team was able to detect the point of failure which was causing players to be unable to connect, and was then able to make immediate or planned changes to our systems and procedures to remedy the issues going forward.\n\n__AUGUST__\n\nY8S3 Operation Heavy Mettle was released on August 29<sup>th</sup>, and with this we encountered a major outage with overall downtime totaling 17 hours and 49 minutes. In essence, this outage was caused by a specific group of conditions arising, which led to our services being unable to handle the high amount of players attempting to connect at season launch.\n\nTo alleviate the issue, the team [disabled systems](https://twitter.com/Rainbow6Game/status/1699467502332289494) that would deliver Rank information to players, while still allowing Rank calculations to take place in the background. This allowed players to connect, matchmake, and complete meaningful Ranked matches while the team continued their work to get the game services fully operational once more. The team was then able to reinstate the delivery of Rank information to the game once conditions were stable.\n\nIn response to this situation, teams were able to make both specific and systemic changes to help ensure that the same outcome would not be repeated under similar circumstances.\n\n### DDOS (Game server)\n\nWhen talking about game server DDOS, we're looking at DDOS that directly affects players as well as a group of matches hosted on the targeted game server. The team have previously implemented a feature to reduce the number of matches affected by these attacks, resulting in less players being ejected from matches. \n\nAlthough the team has made progress in this area this year, we know that players still experience some issues with this. We see your feedback; we want to share that our work continues in this area and that the team will be making further changes in the future to help improve this situation.\n\n### SERVER REGIONS & PING TESTING\n\nWhen a player boots up Siege, it checks to find the server which will provide the lowest ping based on the player's current location. This functionality has allowed us to run live tests using new data centers, while gathering performance data. These tests are helping us to understand how activating new locations can not only improve connectivity for certain communities, but also impact the experience of all the other players.\n\nDuring 2023, after such tests had been completed, the Connectivity team made two new server regions available (one for Korea and another one from Europe Central). We've found that these new locations have been a boost for many players, enabling them to play with decreased pings leading to an improved experience overall.\n\n__SERVER REGIONS - WHAT'S NEXT?__\n\nWe've got nothing final to announce regarding additional new server locations as of right now, though we can confirm that it's an area the Connectivity team is putting a lot of resources into. In the coming seasons, the team will be running new internal tests, and we'll share more updates on this as soon as results become available.\n\nIn addition to testing new server locations, the Connectivity team is also working on updating and evolving its tooling. This will allow the team to pull more detailed information regarding their usage and ultimately facilitate decision-making when it comes to deciding which regions could benefit from additional resources the most.\n\n### CROSSPLAY\n\nCrossplay was implemented back in December and has been one of the biggest online changes to come to Siege. The feature has been a great success, though it's important to highlight just how this affected our online services in the weeks following release. During this time, we did experience issues leading to downtime which ultimately stemmed from the Crossplay feature. These issues were due to the challenges of deploying such a game-changing feature, while ensuring that all of our systems were ready to provide a stable experience with this additional load. Crucially however, the team was able to ensure that the feature remained live, while bringing stability to the game's online services, providing a highly awaited change that many players had been asking for.\n\n### TECHNOLOGY REPLACEMENT\n\nOver the last few seasons, our teams have been working iteratively to replace older technology which is integral to our online services. Some of this technology has been in place since Siege's early development, and as the game continues to evolve, there is a need to ensure that we still have state-of-the-art systems in place. Once complete, our team and players alike will be looking to gain multiple advantages, including decreased maintenance downtime. \n\n### COLLABORATION\n\nAt Ubisoft we have a wide range of titles, each with their own Programming, Art, and of course, Connectivity teams. In the last year, our Connectivity team has found new ways to collaborate with such teams from other titles, including For Honor and Roller Champions. Since the new efforts were established, the data being shared has enabled us to mitigate online issues that might have otherwise affected players and has resulted in a significant positive impact overall.\n\n## LOOKING FORWARD\n\nThe team has made multiple learnings over past seasons and applied a number of changes while working on others which will be implemented in the future. While some of these changes only represent remedies for a fraction of causes, there is no doubt that the steps taken will be beneficial moving forward. \n\nTo sum-up, here's a look at some of the areas the Connectivity team is currently working on:\n\n- Putting strategies in place to minimize unplanned downtime.\n- Reducing the impact of game server DDOS.\n- Tightening collaboration with other titles including For Honor and Roller Champions.\n- Testing for possible new data centers.\n- Removal and replacement of old technologies used throughout the game's life.\n- And much more behind the scenes.\n\nThis is just a brief overview of what the Siege Connectivity team has been up to, we hope that this article provides useful insight into some of the topics that are being looked at. We want to add that this is only a snippet of what this team is working on, and we'll share more on this topic in the future.\n\nWe thank you for providing feedback on your online experience as it's extremely helpful to the team and we couldn't make improvements without you!",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 8,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3np0dmOyTZY3BVXe4qcRZQ/classified-connectivity",
    "date": "2023-11-17T15:35:00.000Z"
  },
  {
    "id": "1BZt0t9asNHvdTBHU9OUGZ",
    "title": "Y8S4 Designer's Notes",
    "abstract": "In this latest edition of Designer’s Notes, we'll go into detail about the balancing changes that’ll come with the Y8S4 test server and give you some insight into the reasons behind them",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4OMngveP6mCNtRzteX20YT/133d5332d55a0eb5668e3e464cd76d6f/Y8S4_DesignersNotes_Header_960X540.jpg",
    "content": "# BALANCING MATRIX AND TOP OPERATOR BANS\n\n## WIN DELTA VS. PRESENCE\n\n<video controls>\n  <source src=\"//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2vLL8c9ObO2zX4icHCdvqp/cc78b35c72bc89f4c48617d311b4de20/R6S_DN_Y8S4_BalancingMatrix_Att.mp4\" type=\"video/mp4\">\n</video>\n\n<video controls>\n  <source src=\"//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5dQ1Eqn5UOYrdKQF83IU6q/344ff9d012cc7e72d31c74e7d41b1a6e/R6S_DN_Y8S4_BalancingMatrix_Def.mp4\" type=\"video/mp4\">\n</video>\n\n<center>\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n</center>\n\n# OPERATOR BAN RATE\n\n<video controls>\n  <source src=\"//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/U4hHBExAjTzBCHODNtYYi/85bba7926ec6c435bb4fd88fe08b82c4/R6S_DN_Y8S4_BanMatrix_Att.mp4\" type=\"video/mp4\">\n</video>\n\n<video controls>\n  <source src=\"//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/72qqLt1kklQCWMBvp09GG8/c81eda0e8800d9651bada4f831c68865/R6S_DN_Y8S4_BanMatrix_Def.mp4\" type=\"video/mp4\">\n</video>\n\n## GADGET BALANCING\n\n### FRAG GRENADES\n\n#### GADGET STATS\n\n- Fuse system: Removed ability to cook the grenade. Added fuse time reduction after the first bounce.\n- Initial fuse time: 4 seconds (from 5).\n- Reduced fuse time: 2 seconds.\n\nWe want to bring down the power level of the Frag Grenade to be in line with all the other Secondary Gadgets. Like all the others, it should be a weaker version of a Primary Gadget, such as the Hard Breach Charge for the Hard Breachers or the Bulletproof Camera for the Intel Gatherers. The secondary utility should not compete with or drive more attention than the main ability of an Operator. This change will put the spotlight back on Operators' abilities, and we will have more margin to make them excel in their roles.\n\nWe also want to increase the population of Frag Grenades, so more operators can get them without severely affecting their presence. We won't keep this utility as limited as it is right now forever because it conflicts with our intention to give as many options as possible to players to foster creativity.\n\nTo that end, we will remove the ability to cook grenades. This change removes a skill component when using them, but this aspect has been identified as the main reason why they are too powerful. Player ability can turn Frag Grenades into a better version of most operator abilities. Skilled players have reached a level that even ignores the correct counters for grenades, by killing defenders from below without warning.\n\nWe have not taken this decision lightly because of its impact on the skill ceiling when learning and mastering the use of Frag Grenades. We have adopted the fuse system from the Stun Grenade which means that the fuse time will be reduced to 2 seconds after the first Bounce (if the time is higher), so you'll still retain some control over the gadget. Reducing that skill ceiling is our last resort when tweaking a gadget, as we generally aim for the opposite.\n\nWe have tested multiple ideas looking for the right solution for the Frag Grenade's power level while keeping its identity intact. Here are a few of the changes we explored but ultimately did not implement:\n\n- __Damage through surfaces__: Here, we wanted to fix the competitive issue with a direct approach. We tested several options, from only reducing the damage below the lethal threshold to completely removing it along with the destruction. This solved the usage from the floor below against operators, but it didn't affect their power level for the majority of the population, so we wouldn't be able to give them to more operators.\n- __Non-lethal__: The most appealing aspect is the lethality, so we tried to reduce it directly. We tested reducing the base damage to non-lethal, so you'd have to land several Frag Grenades to kill your target. Not being able to guarantee the kill with a single throw achieved most of our objectives, but it also destroyed part of gadget's personality.\n- __Reduce amount__: We evaluated reducing the amount to only 1 per operator to see if it was enough to make the other options more appealing. Unfortunately, this change made them too binary; we only removed the ability to try again if you missed the target. If you were accurate, you could still achieve the same results, and this potential was deemed enough to favor selecting a single Frag Grenade over any other gadget.\n- __Random fuse time__: With this prototype, we tried to add a bit of uncertainty to discourage players from cooking the grenades too accurately. They are super dangerous, so it is not a device you should want around when the detonation mechanism is triggered. We changed the fuse time to be between 3 and 5 seconds. This version achieved several of our goals because the players weren't as accurate with them as they were with the live version and gave defenders time to react, which made them more interactive. But despite being a fun prototype, adding more randomness into the game while we are trying to remove it from other areas didn't convince us.\n\n## OPERATOR BALANCING\n\n### IQ\n\n#### LOADOUT\n\n- Secondary Gadgets: Added Frag Grenades.\n\n#### 552 COMMANDO\n\n- Damage: 43hp (from 47).\n- Stronger vertical and horizontal recoil.\n\nFinally, IQ gets Frag Grenades back. We will see if she can keep them depending on the power level of the new version and how her having them affects other interactions in the game. She is an intel gatherer, and her intel can help attackers use resources and time more efficiently. We don't want her increased utility to overshadow the team play.\n\nWe love her relationship with the EMP Impact Grenade. Having her on the team avoids putting drones in danger or wasting EMPs trying to hit an electricity source. She can also help the team use anti-utility gadgets more efficiently by seeing which ones are protected. She can find electronic gadgets that are normally hard to locate and track enemies using them.\n\nBecause of the increased utility and versatility, we must reduce the 552 Commando's fire power. We will reduce its damage to make the Extended Barrel combo weaker. With the new damage, 1-armor operators will take 3 bullets instead of 2 to get downed. We've also made its recoil more challenging to control, which will bring it in line with other Assault Rifles.\n\nIQ is a team player. She helps the team be more efficient and is one of the best representations of the essence of Siege.\n\n### LION\n\n#### LOADOUT\n\n- Secondary Weapons: Removed Gonne-6.\n- Secondary Gadgets: Added Frag Grenades, Removed EMP Impact Grenades.\n\nLion and Frag Grenades were previously incompatible as the EE-ONE-D forces defenders to stay still giving the defender no options against a cooked grenade.\n\nWe are reconsidering his candidacy now because of the new synergy with the detonation system. The new Frag Grenade will force targets to move instead of killing them right away, pushing defenders into the EE-ONE-D's detection. The defender will have to think fast to evaluate the different options and decide the best course of action.\n\nWe are swapping them for the EMP Impact Grenades because they are the least picked option, and of course, removing the Gonne-6.\n\n### SENS\n\n##### LOADOUT\n\n- Secondary Weapons: Removed Gonne-6.\n- Secondary Gadgets: Added Frag Grenades.\n\nYou must master the R.O.U. Projector and the new Frag Grenade to make use of Sens' full potential. They have the ability to block multiple lines of sight, pressure enemies out of strong positions, and even force them to cross the light screens. This will increase Sens' skill ceiling even more.\n\nSens has a projectile as their main ability, and it goes against a rule we broke with Gridlock in Y8S3.3 (allowing both a throwable unique ability and Frag Grenades). We will test if this rule should remain in place with the updated Frag Grenade, or if it allows more flexibility with the distribution.\n\n### OSA\n\n##### LOADOUT\n\n- Secondary Gadgets: Added Frag Grenades. Removed Smoke Grenades.\n\nThe new Frag Grenades will replace Osa's Smoke Grenades, as it was her least picked secondary gadget option (only 15% of the rounds).\n\nOsa allows attackers to create a setup, something that was exclusive for defenders until she arrived. She approaches the assault in a more methodical way, gaining terrain from defenders, but she cannot do it without help. This makes her a good candidate for this extra utility, as it is gameplay we want to encourage, but she still has good synergy with all the other secondary options, so we hope all of them will remain interesting.\n\n### BLACKBEARD\n\n##### LOADOUT\n\n- Secondary Gadgets: Added Frag Grenades. Removed EMP Impact Grenades.\n\nBlackbeard is the last attacker receiving Frag Grenades. His low presence made him an easy selection and since the Claymore is still a good option, we hope choosing between the two isn't easy or at least depends on the way you intend to play the round.\n\n### CAPITÃO\n\n##### LOADOUT\n\n- Secondary Gadgets: Added EMP Impact Grenades.\n\nWe have decided to give Capitão EMP Impact Grenades to compensate for their removal from other operators and make choosing between him and Osa a bit tougher. Having Hard Breach Charges and EMPs to choose from can allow him to fit into more attacking compositions.\n\n### GRIM\n\n##### LOADOUT\n\n- Secondary Gadgets: Added EMP Impact Grenades. Removed Breach Charges.\n\n##### 552 COMMANDO\n\n- Damage: 43hp (from 47)\n- Stronger vertical and horizontal recoil.\n\nWe are pretty happy with the results of all of Grim's buffs. Unfortunately, he shares the 552 Commando with IQ, so the changes made to it will also affect him. To compensate for that, and recoup some of the EMP Impact Grenades removed, he will also get them, replacing the Breach Charges. We believe it is a fair exchange; losing some frag potential but gaining flexibility now with the Bailiff 410 for soft destruction.\n\n### MIRA\n\n##### BULLETPROOF GLASS\n\n- The bulletproof glass will be shattered if a Drilling Projectile explodes successfully after drilling into it.\n- This change affects all bulletproof glass: Black Mirror Window, Evil Eye, Talon Shield, Bulletproof Camera, Deployable Shield.\n\n##### ASH'S BREACHING ROUND\n\n- The Breaching Round is considered a Drilling Projectile.\n\n##### KALI'S V-LANCE\n\n- The V-Lance is considered a Drilling Projectile.\n- Note that the V-Lance doesn't drill through gadgets; it only drills through surfaces (the Black Mirror Window is considered part of the wall).\n\nMira is a game-changing operator. If you spot her during the Preparation Phase, you know that something will have to change in the way you execute the attack. We love the effect she has in game, but we believe the reason for her high ban rate is purely strategic. You don't want to deal with her in situations where she alone defines the pace of the round.\n\nWe introduced the Shattered Glass system back in Y6S3 to give attackers more ways to deal with the Black Mirror Windows and penalize bad usage. We are very happy with the results, so we are going to expand that system by adding new sources, so attackers have more flexibility when spotting a Mira.\n\nWe have defined a new projectile category; \"Drilling projectiles\". These projectiles drill into the surface they impact to apply their effect. They'll explode from the inside of the surface to deal more damage and will now shatter bulletproof glass. For instance, if Ash's Breaching Round sticks to the Black Mirror glass and explodes successfully, the glass will be shattered.\n\n### MAESTRO\n\n##### LOADOUT\n\n- Main Ability: 3 Evil Eyes (from 2)\n\n##### EVIL EYE\n\n- Battery: 6 seconds (from 5)\n- Overheat: 6 seconds (from 5)\n\nMaestro has been indirectly nerfed repeatedly since the release and introduction of new systems (Shattered Glass, Outside Cameras), new operators (Flores, Brava), new gadgets (Gonne-6, EMP Impact Grenades), and tweaks to operators (Dokkaebi) and now again with the increased population of Frag Grenades. Because of all this and the current meta, his presence has understandably gone down to be one of the least-picked defenders. \n\nThe changes to Evil Eyes should make attackers treat them with more respect. The new battery will allow Maestro to kill 1-armor operators with a single turret and down 2 to 3-armor operators. Increasing the number of Evil Eyes to 3 will increase his flexibility, requiring at least two operators with the proper secondary utility to deal with all of Maestro's utility, helping him become the master of intel that he should be.\n\n## PLAYLIST ECOSYSTEM CHANGES\n\n### QUICK MATCH AND STANDARD\n\nWe feel confident about the Quick Match changes introduced last season. The faster match time provides players a much faster paced experience. Attacker Vanguard allows players a safer approach to the action and Pre-Setups let defenders play fast without having to forfeit the strategic element of reinforcements.\n\nHaving said that, we are aware of the community's concerns regarding the new playlist ecosystem, and we realize that we made changes to the Standard mode before having the completed map pool available in Quick Match. Therefore, we are making the Standard map pool the same as Ranked while we dedicate our efforts to adding all the maps back to Quick Match as soon as possible. Once the map pool is completed, we will allocate some time to revisit Standard's map pool and provide more options for players to enjoy the maps that they want. We are working on a proposal to bring back player agency by allowing you to enjoy Standard's map pool with some control over it.\n\n##### QUICK MATCH MAP POOL UPDATE\n\n##### Added:\n\n- Hereford Base\n- Presidential Plane\n- Yacht\n- Fortress\n- Emerald Plains\n- Stadium\n- NightHaven\n- Lair\n\n##### STANDARD MAP POOL UPDATE\n\n- Oregon\n- Club House\n- Consulate\n- Bank\n- Kanal\n- Chalet\n- Kafe Dostoyevsky\n- Border\n- Skyscraper\n- Coastline\n- Themepark\n- Villa\n- Outback\n- Emerald Plains\n- NightHaven\n- Lair\n\n<hr>\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 12,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1BZt0t9asNHvdTBHU9OUGZ/y8s4-designers-notes",
    "date": "2023-11-13T14:45:00.000Z"
  },
  {
    "id": "5BjYOwmKyyk6zwN6rwDxas",
    "title": "“Acceptable casualties? Nah.” – Tubarão",
    "abstract": "It’s time to turn down the heat with Operation DEEP FREEZE! The new season is just around the corner, and there’s no better time to introduce our newest Defense Operator Isaac “Tubarão” Nunes Oliviera.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3nHwDlbBoOf2el4pvPwfp7/b4aa581a73b4738e37447f3f597b129e/Y8S4_OPERATOR_KEYART_540.jpg",
    "content": "It's time to turn down the heat with Operation DEEP FREEZE! The new season is just around the corner, and there's no better time to introduce our newest Defense Operator Isaac \"Tubarão\" Nunes Oliviera. \n\nGrowing up in Ponta Delgada in Portugal, earthquakes and underwater eruptions were the norm. It taught Tubarão the value of mutual aid and community, making him a perfect fit for WOLFGUARD. He takes accountability for every life in his jurisdiction, and his teammates will be thankful for the freezing power of the ZOTO CANISTER. Not only can it slow opponents, the ZOTO CANISTER freezes electronic devices, and can even pause deployment for mechanical devices.  \n\nThe ZOTO CANISTER is a throwable device that can stick to any surface with a lot of utility. It can insulate metal from electricity, and even reveal footprints if the opponent walks on the frozen area. Attack Operators will want to wait for the freezing effect to dissipate before pushing in, but if you can't wait, Buck's SKELETON KEY or Sledge's TACTICAL BREACHING HAMMER can be reliable options against the ZOTO CANISTER. \n\nWith the NITRO CELL and PROXIMITY ALARM as secondary options, Tubarão focuses on utility denial making him a great operator for asymmetric strategies with focus on verticality. 2 HEALTH, 2 SPEED, and the AR-15 and MPX as primary weapon options and the P226 MK25 as his secondary weapon, denying breach from the attack is the foundation of Tubarão's gameplay. \n\nTubarão is driven by his unwavering dedication to civilian safety. During his time in the DAE, he would always ensure that civilians were insulated from hostile activity, going above and beyond what anyone else would do. His empathy and skills made him a high performing specialist, the perfect candidate to be recruited in to WOLFGUARD. \n\nTest out Tubarão and his chilling abilities on the Test Server starting November 13.",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5BjYOwmKyyk6zwN6rwDxas/acceptable-casualties-nah-tubaro",
    "date": "2023-11-13T09:00:00.000Z"
  },
  {
    "id": "5elVeFwuDGjHBeNxPEoZNT",
    "title": "Y8S3 MID-SEASON ROADMAP UPDATE",
    "abstract": "Check out what's coming to Rainbow Six Siege in the Y8S3 Mid-Season Roadmap Update.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/cZJILTiwMxq1OTiDdGecH/fe73759c7f01910e802faf5426022bfc/Y8S3_Mid-Season_Update.960x540.png",
    "content": "Every season when we roll out fresh content, we also provide an updated Roadmap to ensure transparency on upcoming features. When making those adjustments, we take various elements into account, including your feedback. Furthermore, we aim to offer additional insight into what you can anticipate from the upcoming Operation.\n\nNow let's delve into the mid-season Roadmap update.\n\n![[R6S] Y8S3 Mid-Season Roadmap Update - roadmap](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1ka2ZvpGF2YliVxQ48GKS0/74dbc351eeddeca1d472d1a9a788d9d3/R6SIEGE_Y8_Roadmap_1920x1080_UK.jpg)\n\n## ROADMAP UPDATES\n\n### [MAIN FEATURE] NEW MAP\n\n- __Status: Confirmed for Y8S4__\n\nY8S4 will bring an exciting addition to the Rainbow Six Siege map lineup. We have been building a new map on the foundation of verticality with carefully designed layouts and fresh avenues for strategic possibilities like never before! Make sure to watch the Y8S4 reveal panel to discover more!\n\n### [MAIN FEATURE] NEW VERSUS AI PLAYLIST\n\n- __Status: Confirmed for Y8S4__\n\nThis season will keep on delivering with the incorporation of a new versus AI Playlist tailored to let new players sharpen their skills against specially AI trained Defender bots to become the best operator they can be. Practice, strategize, and dominate like never before in this dynamic training environment. \n\n### [BALANCING] [BETA] REVAMPED SHIELD MECHANISM\n\n- __Status: BETA confirmed during Y8S4__\n\nShields have been part of Siege since the beginning and have sometimes seemed unbalanced with the current playstyles. As a game striving for tactical depth, we're committed to integrating shields seamlessly into gameplay without compromising immersion. We have been working on this strategy from the ground up, redesigning ballistic shields while retaining a unique playstyle which is both balanced and immersive. Brace yourselves for the first iteration of this revamped mechanism, available later during Y8S4 on the Lab TS. \n\n### [PLAYER COMFORT] CONTROLLER REMAPPING\n\n- __Status: Confirmed for Y8S4__\n\nWe are actively working on improving our players' comfort on consoles. In Y8S4, we will be providing an easy way to completely customize your controller inputs. This long-requested feature is dedicated to ensuring it answers all our console players' needs. Taking your feedback into account, we will also implement a new action to allow leaning while hip-firing on Consoles later in the season!\n\n### [BALANCING] [NEW] UPDATED FRAG GRENADES\n\n- __Status: Confirmed for Y8S4__\n\nAs announced in the last [Siege Classified: Balancing](https://twitter.com/Rainbow6Game/status/1694016584371634344?s=20), Frag Grenades have risen to an overpowered position in the current meta. They currently heavily influence Operator choices, tilting the balance between primary and secondary gadgets in an unbalanced way. With our commitment to providing the best FPS competitive experience, we have thoroughly examined Frag Grenades and rebalanced their impact to be more in line with all the other Secondary Gadgets. More information on this balancing change will be shared during the reveal panel, so everyone can have a blast playing Siege, so stay tuned!\n\n### [PLAYER PROTECTION] NEW RANKED REQUIREMENTS\n\n- __Status: Coming in Y9__\n\nRanked is the most popular competitive mode in Siege. Hence, it's no surprise that it's always in our line of sight in terms of priority, ensuring that players can enjoy a balanced competitive experience, both with and against similarly skilled players. We are committed to making sure Ranked is a fair environment and are adding more Ranked requirements to reinforce the core experience.\n\n### [PLAYER PROTECTION] PRIVACY MODE ON CONSOLES\n\n- __Status: Cancelled__\n\nThe work required to deliver Privacy Mode on consoles has brought up external challenges that came up late in the process. As well as this, new privacy features have been made available inside of the console ecosystem itself. For this reason, we've made the tough decision to stop the development of this feature on consoles specifically for the time being. \n\nAs you know, Player Protection remains a top priority, and we are committed to improving your experience and making Siege an even safer and fairer game to play on consoles. Discover more on our plans in the coming weeks.\n\n## FULL REVEAL\n\nStay tuned for the upcoming Year 8 Season 4 Reveal coming on __November 12th__ and join the discussion on [Twitter](https://twitter.com/Rainbow6Game/), [Instagram](https://www.instagram.com/rainbow6game/), [Reddit](https://www.reddit.com/r/Rainbow6/), [Discord](https://discord.gg/rainbow6), [Facebook](https://www.facebook.com/Rainbow6/), and [TikTok](https://www.tiktok.com/@rainbow6game).\n\nCheck out the [public Roadmap](http://rainbow6.com/roadmap) for more information on the changes coming your way!",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5elVeFwuDGjHBeNxPEoZNT/y8s3-midseason-roadmap-update",
    "date": "2023-11-02T17:45:00.000Z"
  },
  {
    "id": "6lWAGRIUkrMBsrKoGw2rEE",
    "title": "Y8S3.3 Patch Notes",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y8S3.3.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5LRRhXvrrlty1BVyAjlTVv/e48672e661fc4e6cf633191d4a7a8f26/Y8S3.3_PatchNotes.960x540.jpg",
    "content": "See the upcoming changes to Rainbow Six Siege with the release of Y8S3.3.\n\n## OPERATOR BALANCING\n\n### FROST\n\n- Operators who fall onto a Welcome Mat will be able to remove it from their leg by themselves or with the help of a teammate.\n- Operators who fall onto a Welcome Mat are considered downed. R6 allows a player to be in downed only once per round, if they have been downed already, they will be eliminated if they fall onto a Welcome Mat.\n- If Operators remove the trap without the help of a teammate, a debuff will be applied to them for 60 seconds with these effects:\n  - Move 20% slower and can't sprint.\n  - Leave a trail of blood behind.\n  - Health is set to 20, same health you get after standing up from being downed.\n\n### WARDEN\n\n__OPERATOR STATS__\n\n- Armor: 3 (from 2)\n- Speed: 1 (from 2)\n\n### GRIDLOCK\n\n__LOADOUT__\n\n- Gadgets: Frag Grenades will replace Breach Charges.\n- Secondary Weapon: Removed Gonne-6.\n\n### FINKA\n\n__LOADOUT__\n\n- Gadgets: Added Frag Grenades as 3rd option.\n- Secondary Weapon: Removed Gonne-6.\n\n### IANA\n\n__LOADOUT__\n\n- Gadgets: Stun Grenades will replace Frag Grenades.\n- Secondary Weapon: Added Gonne-6.\n\n### SENS\n\n__POF-9 (PC & Console)__\n\n- Reduced vertical recoil.\n- Reduced lateral recoil.\n- Reduced recoil increase after long bursts.\n\n### TACHANKA\n\n__DP27__\n\n- Damage: Increase to 60 (from 49)\n\n## TWEAKS AND IMPROVEMENTS\n\n### GAME HEALTH\n\n__CROSS-SAVE FUNCTIONALITY__\n\nSome parts of the player's saved profile will now be shared across all platforms, including:\n\n- Visual customizations.\n- Common gameplay options.\n- Progression.\n- Matchmaking preferences.\n\nAdditionally, Operator loadouts and equipped weapon attachments will be shared across console platforms, but not between consoles and PC.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Gadget deployment detection is inconsistent on reinforced walls.\n\nFIXED - All players receive the deactivated VFX for electronic devices when Fenrir is affected by an EMP.\n\nFIXED - Black screen encountered after eliminating Iana when she uses Gemini Replicator.\n\nFIXED - Mira's Black Mirror is removed when interacting with Ram's BU-GI.\n\n### LEVEL DESIGN\n\nFIXED - Operators can vault on the statue on the 1F Spiral Stairs in the Consulate map.\n\nFIXED - Ace's first S.E.L.M.A. Aqua Breacher fails to detonate the second time if thrown on the destructible wall that leads to 1F Emergency Exit in the Consulate map.\n\nFIXED - Incorrect compass location is displayed at 4F Cockpit on the Yacht map.\n\nFIXED - Users can skip part of the Attack tutorial by vaulting over the sandbags located at SW EXT Street.\n\n### OPERATORS\n\nFIXED - Ram's BU-GI is shown in the wrong direction when throwing it while upside down in rappel.\n\nFIXED - Ram's BU-GI sticks on wall if deployed while crouching.\n\n### USER EXPERIENCE\n\nFIXED - Incorrect PC directory name used for the game settings file that is saved in the user's My Documents.\n\n### AUDIO\n\nFIXED - Overlapping audio is played during the kill cam.\n\nFIXED - Missing audio lines when the Preparation Phase timer is running out.\n\nFIXED - Aruni's Surya Gate and gadget SFX cannot be heard through walls.",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6lWAGRIUkrMBsrKoGw2rEE/y8s33-patch-notes",
    "date": "2023-10-10T09:45:00.000Z"
  },
  {
    "id": "2iIXX6OEAI1g1b9Q3ta6lU",
    "title": "Y8S3.3 Designer’s Notes",
    "abstract": "In this latest edition of Designer’s Notes, we'll go into detail about the balancing changes that’ll come with the Y8S3.3 test server and give you some insight into the reasons behind them",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5xDbCgUK3XJSWAKwPEuPDp/d7dd1ad256688d219f516ceb4389f14d/R6_DesignersNotes_Y8S3.3_Header_960X540.png",
    "content": "In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y8S3.3 Update and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n### WIN DELTA VS. PRESENCE\n\n![[R6S] Y8S3.3 Designer's Notes - Asset 1 - Video](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2SjhqwLzZwAbNkx2QWPM10/4cdff15ffec684a122e100450f5e4a38/R6S_DN_Y8S3.3_BalancingMatrix_Att.mp4)\n\n![[R6S] Y8S3.3 Designer's Notes - Asset 2 - Video](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4PDI9KnojF3zxxyHKKbXYy/dbd39bbe98a2270575ea29313301ef28/R6S_DN_Y8S3.3_BalancingMatrix_Def.mp4)\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n# OPERATOR BAN RATE\n\n![[R6S] Y8S3.3 Designer's Notes - Asset 3 - Video](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/OtEd1HhPWfc1akBq60BG8/6d10b12130fad533c32fb1f469ec3d15/R6S_DN_Y8S3.3_BanMatrix_Att.mp4)\n\n![[R6S] Y8S3.3 Designer's Notes - Asset 4 - Video](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3dxbmKJqYSuRDwme2rhbVt/247ea3e0dd6497cd32746d5f155109d4/R6S_DN_Y8S3.3_BanMatrix_Def.mp4)\n\n## OPERATOR BALANCING\n\n* * * * *\n\n### FROST\n\nAn earlier iteration of these changes was released on the Lab Test Server and two main lines of feedback were identified from the community: \n\n-   Players don't want to lose the ability to bait extra attackers into reviving the victim trapped in the Welcome Mat.\n-   Players are afraid that these changes will make the game more run & gun oriented.\n\nWe have heard your feedback and made some tweaks aimed to tackle these issues:\n\n-   __Teammate Revive__: Players caught in the Welcome Mat can choose to wait for a teammate to perform the revive, if they do so, they will not receive the debuff when leaving the trap. This should grant Frost opportunities to hunt teammates willing to help trapped players while attackers are rewarded for playing as a team.\n-   __Stronger Debuff__: In addition to not being able to sprint we've added a movement speed reduction of 20% and increased the duration of the effect to 1 minute. This will cripple the run & gun capabilities of reckless players that separate from their teams and fall into Welcome Mats.\n-   __Slower Revive Animation__: Trapped players will now need 4 seconds to exit the trap regardless of the revive method. This should grant extra time for defenders to finish off trapped enemies before they can stand up.\n\n#### WELCOME MAT\n\n-   Welcome Mat Removal by Teammate takes 4 seconds (was 4.3 seconds). No debuff applied.\n-   Welcome Mat Removal by Self takes 4 seconds (was 2.5 seconds).\n-   If players remove the trap by themselves, a debuff will be applied to them. The effects are as follow:\n\n-   Duration is 60 seconds (Was 20 seconds on the Lab Test Server).\n-   Will move 20% slower\n-   Won't be able to sprint.\n-   Will leave a trail of blood behind them.\n-   Health is set to 20 hp. \n\n-   Being caught by a Welcome Mat is considered entering the Down But Not Out state. R6 allows DBNO only once per round, this means players that have already been DBNO will immediately die if they fall into a Frost trap.\n\nWe have two main objectives with this set of changes, the first is to make the placement of Welcome Mats more strategic and less \"deploy and forget.\" The second is to make being caught by Welcome Mats less frustrating by giving more options to players.\n\nPlayers will have now two options to escape from a Welcome Mat, they can wait for a Teammate to help them, or they can release from the trap by themselves at the cost of receiving a penalty with several negative effects that will impact their movement speed.\n\n#### FRAG GRENADES\n\nAs mentioned in the Y8S3 Designer's Notes, the next few changes are in preparation for a more definitive solution that intends to address the Frag Grenades issue.\n\n### IANA\n\n#### LOADOUT\n\n-   Gadgets: Stun Grenades will replace Frag Grenades.\n-   Secondary Weapon: Added Gonne-6.\n\nIana has been the top Attacker for almost a year since we removed Frag Grenades from Finka and changed Sledge's and Zofia's armor rates. It is time for a change that leaves more space for other Operators to excel. We are replacing the Frag Grenades with Stun Grenades to retain Iana's aggressive playstyle and adding the Gonne-6 to keep a bit of her destructive power.\n\n### FINKA\n\n#### LOADOUT\n\n-   Gadgets: Added Frag Grenades as 3rd option.\n-   Secondary Weapon: Removed Gonne-6.\n\nWe needed to add another 'competitive' operator to replace Iana during this transition period. We already know that Finka is a good fit and could take this spot. Now that the LMG-meta has been adjusted, we believe that she can have Frag Grenades again.\n\nShe won't keep the Gonne-6 however, as the combination of it and Frag Grenades will be limited to special cases.\n\n### GRIDLOCK\n\n#### LOADOUT\n\n-   Gadgets: Frag Grenades will replace Breach Charges.\n-   Secondary Weapon: Removed Gonne-6.\n\nTo allow for more operator diversity on the attacking line-up, we are also going to give Gridlock Frag Grenades instead of Breach Charges, she already has the Super Shorty for soft destruction, so we'll remove the Gonne-6.\n\n### SENS\n\n#### POF-9 (PC & Console)\n\n- Reduced vertical recoil.\n- Reduced lateral recoil.\n- Reduced recoil increase after long bursts\n\nWe believe that Sens is an operator with great potential, but it looks like they'll need a push to shine. We made them a 1-Armor and 3-Speed operator back in Y7S4, and softened the POF-9 recoil for Gamepad in Y7S3, but that wasn't enough. Operator weapons have a lot of weight on their performance, so we are taking a second look at the POF-9, but this time for both Mouse and Gamepad.\n\nThis weapon has been considered challenging to operate for a long time, and we've decided to soften its recoil. With this change we are aiming to have a weapon that feels way more forgiving to use. This should allow players to perform better with the POF-9 at longer distances and grant them more freedom to pick its weapon attachments.\n\n### TACHANKA\n\n#### DP27\n\n-   Damage: Increase to 60 (from 49)\n\nDespite the high damage, the time to kill is much higher than average regardless of enemy armor because of the low rate of fire. We never increased it because we didn't want to go lower than 3 bullets to down a player with any automatic weapon, but the recent changes on the Extended Barrel have proven that this is fine for certain operators.\n\nSo, with this change, the DP27 will be closer to other weapons with higher rates of fire in terms of time to kill a full health operator, especially against high-speed operators.\n\n-   1-armor: 0.218ms (faster than average)\n-   2-armor: 0.218ms (faster than average)\n-   3.-armor: 0.327ms (slower than average)\n\n### WARDEN\n\n#### OPERATOR STATS\n\n-   Armor: 3 (from 2)\n-   Speed: 1 (from 2)\n\nWe changed Warden to 2-Armor and 2-Speed by the end of Y4 to increase his mobility and allow him to react faster to the Attacking team. With the evolution of the game, and defenders playing more loosely than back then we will drop his speed to reduce his roaming capabilities.\n\nWe believe the 1.5x on the MPX, synergizes well with his kit to counter Smokes from far away, so rather than change that we are going to reduce his speed. He will be slower and louder while running around the map, which will make him an easier target to take down by more coordinated teams.\n\nWe want to encourage players to play him closer to the site, where he can use his ability more effectively because flashes and smokes are easier to predict. He should be a critical operator to keep alive until the end of the round because can counter most of the attacking strategies. He shouldn't be the one to go for roaming and dying too early.\n\n* * * * *\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 8,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2iIXX6OEAI1g1b9Q3ta6lU/y8s33-designers-notes",
    "date": "2023-10-06T12:45:00.000Z"
  },
  {
    "id": "5Jd2jnLL5jOGzD7xMpJNKX",
    "title": "Rainbow Six Siege X Halo Crossover Brings Master Chief Set for Sledge",
    "abstract": "New Elite set now available for Sledge, includes Spartan-117 headgear, uniform, gadget skin, weapon skins, and more, plus a Cortana Chibi charm.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/569NLMCWWrD9WyzMBZtu74/8cd0f8219a2a76fd5e425d5ce3a962b1/Sledge_Elite_Halo_960x540.jpg",
    "content": "It's time to siege the day and finish the fight as Rainbow Six Siege introduces a new Halo crossover featuring an Elite set for Sledge that outfits him in the armor of the Master Chief. Included in the set are the Spartan-117 headgear and uniform inspired by the Master Chief's armor in Halo Infinite, as well as a gadget skin that reimagines Sledge's breaching hammer as a Banished Gravity Hammer. There are weapon skins for Sledge's primary (M590A1 shotgun and L825A2 assault rifle) and secondary (P226 MK25 pistol) weapons, as well as Operator cards, a victory celebration, and the Cortana Chibi charm. The Elite set can be purchased with R6 credits and is available now in the in-game store.\n\nFor more on Rainbow Six Siege, check out the [Sixth Guardian charity bundle](https://rainbow6.com/sixth_guardian_health_cancer_research) that offers a colorful look for Twitch, and read up on the latest season in our [Operation Heavy Mettle Operator and Gadget Guide](https://rainbow6.com/operation_heavy_mettle_operator_gadget_guide).",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 1,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5Jd2jnLL5jOGzD7xMpJNKX/rainbow-six-siege-x-halo-crossover-brings-master-chief-set-for-sledge",
    "date": "2023-09-27T08:00:00.000Z"
  },
  {
    "id": "5MhtA9MfeyId8QLbETK3wx",
    "title": "Y8S3.2 Patch Notes",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y8S3.2.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5PPCskhe0zulw4qe9UgXpI/2cb9a35335740116818c497b745658a4/Y8S3.2_PatchNotes_Article.jpg",
    "content": "See the upcoming changes to Rainbow Six Siege with the release of Y8S3.2.\n\n## Y8S3.2 Patch Size\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 1.16 GB\n- Steam: 780 MB\n- Xbox One: 1.09 GB\n- Xbox Series X: 1.32 GB\n- PlayStation 4: 1.62 GB\n- PlayStation 5: 1.28 GB\n\n# BUG FIXES\n\n## GAMEPLAY\n\nFIXED - Operators can't escort the hostage using the controller input if they're holding a deployable device.\n\nFIXED - Devices placed on the ceiling are detected outside in 2F Red Stairs on the Kanal map.\n\nFIXED - Wrong VFX is triggered when using Oryx's Remah Dash against an opponent standing next to an indestructible wall.\n\nFIXED - Players get an advantageous line of sight when using Azami's Kiba Barrier.\n\nFIXED - Various advantageous position issues when using Azami's Kiba Barrier.\n\n## LEVEL DESIGN\n\nFIXED - Red barrier is missing during the Preparation Phase after destroying barrel wall in B Tasting Room on the Villa map.\n\nFIXED - Operators are able to go out of bounds at the west wall of EXT Tunnel on the Bank map.\n\nFIXED - Defenders are detected outside when standing next to a wall in 1F Trophy Room on the Chalet map.\n\nFIXED - Barricades float when placed at 2F Master Bedroom on the Oregon map.\n\nFIXED - Operator becomes stuck when going on top of the white chair next to the fruit stand in EXT Market on the Favela map.\n\nFIXED - Operators can get stuck in the barrel located on the Clubhouse map.\n\nFIXED - Ace's S.E.L.M.A. Aqua Breacher doesn't detonate a second time when throwin on the destructible wall of the Consulate map.\n\n## AUDIO\n\nFIXED - VFX does not match with the timer when joining a match in progress.\n\n## USER EXPERIENCE\n\nFIXED - Operators have improper idle animations in the Operator album.\n\nFIXED - Commendation system is occasionally greyed out.\n\nFIXED - Teammate outlines are inconsistently displayed.\n\nFIXED - Devices are detected as outside when deployed inside 2F Piano Room on the Chalet map.\n\nFIXED - The Maps tab for the Standard playlist is empty while playing in offline mode.\n\nFIXED - Crosshair disappears aiming down sight multiple times after respawning.\n\nFIXED - Operator Portraits and Card Backgrounds rewards are not displayed after opening a pack.\n\nFIXED - Match options only available to the host when in Custom Match lobby.\n\nFIXED - Placeholder text is present for the defuser location when planted at 4F Cockpit on the Yacht map.\n\nFIXED - Language packs missing for Ukraine region.\n\nFIXED - Multiple LOD issues on various maps.\n\nFIXED - Various shop and Customization issues.\n\nFIXED - Various Localization issues.\n\n---\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game), [Reddit](https://www.reddit.com/r/Rainbow6/), [Facebook](https://www.facebook.com/Rainbow6/) and on our[forums](https://discussions.ubisoft.com/category/609/rainbow-six-siege?lang=en-US).",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5MhtA9MfeyId8QLbETK3wx/y8s32-patch-notes",
    "date": "2023-09-26T09:45:00.000Z"
  },
  {
    "id": "2YtRrSCEi2eWoYEksA44FV",
    "title": "Commendation System: How It Works",
    "abstract": "An in-depth look at the Commendation System.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/l6CCkKR8pue9d37yRULXj/6562599ae6949c9610921fe8e4f3f8d0/Commendations.960x540.png",
    "content": "Y8S3.1 brings the latest update from the Player Protection team, the Commendation System. The Commendation System gives teammates a new avenue to share their thanks and appreciation with one another, while showing how they've added to the experience. In Siege your team matters, and any team member can be key to your victory and enjoyment. With this update, you can show players your gratitude and allow them to shine.\n\n## HOW IT WORKS\n\n### COMMENDING OTHERS\n\nPlayers will be able to give Commendations at the end of a Quick Match, Standard, or Ranked game, via the Commendation screen. Each session, players can commend up to two teammates by selecting one of three categories.\n\nAs well as showing your appreciation to teammates, you can vote to commend the opposing team. In order for the vote to be successful, a majority \"YES\" vote will be required.\n\n__RESTRICTIONS:__\n\n- Players who abandon the match won't be eligible for Commendations.\n\n- A player cannot give both of their Commendations to the same person.\n\n- To prevent abuse of the system, a player cannot award more than one Commendation to the same player within a 7 day period.\n\n### COMMENDATION TYPES\n\nWhen it comes to giving out your Commendations to your teammates, you'll have 3 options, and choosing the right one will help players know how their efforts have added to your experience.\n\n- __Valor__: A great teammate who stays cool and is fun to play with.\n\n- __Dedication__: A reliable teammate who stays engaged, fills in roles, and actively relays intel.\n\n- __Guidance__: A teammate who takes on a leadership role, helping the others by sharing knowledge and developing strategy.\n\n## WHAT COMMENDATIONS MEAN FOR YOU\n\nReceiving Commendations can result in rewards being given at certain points in a season, as well as a temporary passive bonus. Note that right now, it will not affect your Reputation Standing.\n\n### STREAKS\n\nIf a player receives Commendations consistently, a Streak bonus will be activated, giving a +1% drop chance on their Alpha Packs. The Streak status will be reflected in the in the Reputation Center, in the main menu squad panel, and in matches for other players to see. Of course, if a player wishes to protect their privacy, this icon can be disabled as part of Privacy Mode.\n\n__RESTRICTIONS__\n\n- Players who have a sanction or reputation penalty will have their Streak stopped and will be unable to attain a new Streak.\n\n### REWARDS\n\nAs well as an increased Alpha Pack drop rate, if you meet the right requirements, you could qualify for more rewards.\n\n- At __mid-season__, any player who has received a Commendation in the current season, will receive an Alpha Pack of Epic rarity.\n\n- At the __end of a season__, players in the top 25% of Commendations for that season, will receive an Alpha Pack of Legendary rarity.\n\n__RESTRICTIONS__\n\nThe following players will not be eligible for mid-season or end of season rewards:\n\n- Players who are under sanction of any sort.\n\n## CONCLUSION\n\nThe Player Protection team continues their work on both the Commendation System and Reputation System, helping to support and protect players' journeys in Siege. With this update, our aim has been to increase the opportunities for positive interactions in-game, with the ultimate goal of giving players a more positive overall experience. We look forward to players using the system, earning Streaks, and receiving their Alpha Packs!",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2YtRrSCEi2eWoYEksA44FV/commendation-system-how-it-works",
    "date": "2023-09-14T13:45:00.000Z"
  },
  {
    "id": "7nCrDQJ0J7KWfQcpUYvw0k",
    "title": "Y8S3.1 Patch Notes",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y8S3.1.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5ZPI2tDO4kU3Q3nuEBTyxr/359940c5f44b824b8257415bc2010684/Y8S3.1_PatchNotes_Article.jpg",
    "content": "See the upcoming changes to Rainbow Six Siege with the release of Y8S3.1.\n\n## Y8S3.1 Patch Size\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 5.82 GB\n\n- Steam: 16.9 GB\n\n- Xbox One: 3.09 GB\n\n- Xbox Series X: 3.27 GB\n\n- PS4: 3.99 GB\n\n- PS5: 3.26 GB\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Ram's BU-GI Auto Breacher doesn't completely destroy first floor walls of 1F Strip Club on the Club House map.\n\nFIXED - Ram's BU-GI Auto Breacher doesn't destroy Thunderbird's Kona Station if it's placed on a reinforced surface.\n\nFIXED - Operators get stuck inside of a barrel when exiting rappel on the Fortress map.\n\nFIXED - Defuser can't be retrieved if dropped when entering or exiting rappel stance at EXT North Rappel on the Tower map.\n\nFIXED - Ram's BU-GI Auto Breacher can't go through the wall at 2F Infirmary on the Yacht map.\n\nFIXED - Attacker drones can reach a spot with a useful line of sight and can't be destroyed on Nighthaven map.\n\nFIXED - Third spawn location description is missing for Attackers on the Bank map.\n\nFIXED - Fenrir's F-NATT Dread Mine doesn't open in the end of round replay when activated.\n\nFIXED - Some gadgets are missing collision and can be deployed inside Ram's BU-GI Auto Breacher.\n\n### LEVEL DESIGN\n\nFIXED - Staircase connecting 1F Central Hallway to 2F Central stairs is labeled as B Central Stairs on the Clubhouse map.\n\nFIXED - Indestructible windows can be barricaded during the Defense tutorial.\n\nFIXED - Wall studs are visible in B1 Red Stairs of the Kanal map.\n\nFIXED - Barricades float when placed in the doorway at 2F Dorm Main Hall on the Oregon map.\n\nFIXED - Can't properly destroy the wall between 1F Bar and 1F Lounge on the Tower map.\n\nFIXED - Operators can get out of bounds by using a space between a ladder and railing at EXT South Roof on the Tower map.\n\nFIXED - Portion of the wall can't be destroyed at 2F Master Bedroom of the Chalet map.\n\n### AUDIO\n\nFIXED - Missing SFX when destroying the canister on Mira's Black Mirror.\n\nFIXED - Missing VFX when Operator phones dropped for Dokkaebi are hacked by the Kludge Drone.\n\nFIXED - Missing SFX when drones are destroyed while in support mode during the end of the round.\n\n### OPERATORS\n\nFIXED - Ram's BU-GI Auto Breacher laser is visible through walls with low quality settings.\n\n### USER EXPERIENCE\n\nFIXED - User doesn't receive a penalty when reported for voice abuse in multiple sessions.\n\nFIXED - Warden's Smart Glasses thumbnail appears in low resolution in the Operators tab.\n\nFIXED - Cursor doesn't appear in the Operator Guides while using free camera during Match Replay.\n\nFIXED - Players aren't highlighted after swapping teams in a Custom Game lobby.\n\nFIXED - Saved game mode settings for the Quick Match and Arcade playlists reset after restarting the game.\n\nFIXED -  Hot and Spicy attachment skin is missing from the exclusive set highlighted on the Intro section of the Battle Pass.\n\nFIXED - Text for device name overlaps in Ram's Operator section.\n\nFIXED - Interaction animation doesn't play when players spectate Fenrir.\n\nFIXED - Missing reward image for when the free Alpha Pack reward popup appears.\n\nFIXED - Compass appearance can't be changed while using the normal HUD preset.\n\nFIXED - Dread Factor Ranked charms are displayed with Heavy Mettle rank information.\n\nFIXED - Multiple LOD issues on various maps.\n\nFIXED - Various Shop and Customization issues.\n\nFIXED - Various Localization issues.\n\n---\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game), [Reddit](https://www.reddit.com/r/Rainbow6/), [Facebook](https://www.facebook.com/Rainbow6/) and on our [forums](https://discussions.ubisoft.com/category/609/rainbow-six-siege?lang=en-US).",
    "categories": null,
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/7nCrDQJ0J7KWfQcpUYvw0k/y8s31-patch-notes",
    "date": "2023-09-12T09:45:00.000Z"
  },
  {
    "id": "5hrPaDUB2TZcdaiQPm4EuV",
    "title": "Join the Sixth Guardian Health fundraising for Worldwide Cancer Research!",
    "abstract": "This season, we’re partnering with the Worldwide Cancer Research for our next Sixth Guardian charity bundle!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3tCiXG5oRWkQDQ0GEyUYce/a6e9c9b55655a2aeb288591441d2dcae/R6S_WWCR_Twitch_Bundle-visuals_v1.jpg",
    "content": "The Siege team is excited to continue the Sixth Guardian Program in Y8S3 with a brand-new bundle.\n\nThis season, Sixth Guardian is partnering with Worldwide Cancer Research, an organization funding visionary, game-changing cancer research around the world to start new cures. The \"Sixth Guardian Health\" bundle will feature a full Twitch set, and 100% of net proceeds (no less than $6 USD per bundle) will go to [Worldwide Cancer Research]( https://www.worldwidecancerresearch.org/)\n\nCancer is a growing, global problem. By 2040, the number of cases worldwide is expected to rise by 55% compared to 2020. But there is hope - by funding more visionary, cutting-edge science, Worldwide Cancer Research can start new cures that will take us one step closer to a day when no life is cut short by cancer.    \n\nThis weekend (from September 8<sup>th</sup> to September 10<sup>th</sup>), your favorite creators will be joining us to raise cancer research awareness and help raise funds for the cause. A major thanks to the hundreds of creators like BikiniBohdi, Steviix Jenz, TitaniumRolo, Rasco100, Scythe, Rainbow6ItaCom, BRAVENIKA, Reembey, Supr, Garfield, CrossArchon, KingGeorge, FastAnne, JustRyuk, coreRoss, Tomjsherlock who have answered the call from the Ubisoft Creators Program already!\n\nWe invite all Rainbow Six Siege creators to join the movement too by streaming or creating content on social media over the weekend.\nYou can download the Creator kit which include some Twitch Stream overlays [here](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4128uPAKZYq66zL0b0z7uD/b61b33b145f521dc2d143538e1bf6fcd/Sixth_Guardian_Health_Creator_Kit.zip).\n\nIt's time to show the world what we can achieve together, make sure to use #Curestarter and @WorldwideCancer when sharing on social for a chance to see your content or stream featured on the Rainbow Six Siege account.\n\n### SIXTH GUARDIAN HEALTH BUNDLE \n\nThis exclusive bundle features a set of cosmetics for Twitch, all featuring Worldwide Cancer Research's signature colors and Sixth Guardian branding. Specifically, the set includes: \n\n- \"Sixth Guardian Health\" Uniform \n\n- \"Sixth Guardian Health\" Headgear \n\n- \"Sixth Guardian Health\"\" Background Card \n\n- \"Sixth Guardian Health\" Charm \n\nThe bundle is available for a limited time over the course of two seasons!\n\n<video controls>\n  <source src=\"//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1sQGrBqYLs5CVeB9oZ26Sn/1ea0162b2024e22589d0a39dcdff9438/R6_Guardian_1X1_FINAL.mp4\" type=\"video/mp4\">\n</video>\n\n### ABOUT WORLDWIDE CANCER RESEARCH \n\nWorldwide Cancer Research starts new cures for cancer. Since Worldwide Cancer Research was founded in 1979, they have funded over £200m of pioneering research in 35 different countries.  \n\nThere are still so many unanswered questions about cancer, and so many more discoveries to make. Worldwide Cancer Research keeps pushing forward to fund more outside-the-box thinking from more world-class researchers - something that they simply cannot achieve without their incredible supporters, Curestarters.  Become a Curestarter to help fund visionary, game-changing research around the world, and take us one step closer to a day when no life is cut short by cancer.  \n\nLearn more about Worldwide Cancer Research - [https://www.worldwidecancerresearch.org/](https://www.worldwidecancerresearch.org)\n\n### WHAT HAPPENS TO YOUR DONATIONS \n\nAll net proceeds from your donations will go to Worldwide Cancer Research, with no less than $6 USD per bundle going to the charity. \n\nIf you'd like to support Worldwide Cancer Research further, [click here](https://www.worldwidecancerresearch.org/donate/).\n\n### A MESSAGE FROM WORLDWIDE CANCER RESEARCH CEO - Dr Helen Rippon \n\n\"Ubisoft and the players of Rainbow Six Siege share a common desire with Worldwide Cancer Research to pioneer innovations and take a calculated approach to potential game-changing solutions. We're absolutely delighted to be partnering with them on this campaign, and we are incredibly grateful for their support.\" \n\n__- Dr Helen Rippon, Worldwide Cancer Research CEO__ \n\n### ABOUT THE SIXTH GUARDIAN PROGRAM  \n\nSince the program's launch in 2020, together with our community, we have raised over 425,000 $ USD! Big thanks once again to our past Sixth Guardian partners: AbleGamers Charity, Stack Up, Indspire, ILGA World and Ecologi. \n\nTogether with our partners, we hope to unite the Rainbow Six Siege community and make positive changes outside of our game.",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5hrPaDUB2TZcdaiQPm4EuV/join-the-sixth-guardian-health-fundraising-for-worldwide-cancer-research",
    "date": "2023-09-08T18:00:00.000Z"
  },
  {
    "id": "6Yveu38toC0MdnhkcXOgGl",
    "title": "Rainbow Six Siege Names Tennis Star Daniil Medvedev as Game Ambassador",
    "abstract": "With almost 3000 hours played, Medvedev will have his own themed cosmetic items added to the game, provide feedback on upcoming features, and promote the game.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7m346aFStR9MZzNEIrGVLa/d5bbcf40e123a3cde09cf8cd5571314c/Dani-1.jpg",
    "content": "As [Operation Heavy Mettle](http://rainbow6.com/heavymettle) kicks off, Rainbow Six Siege has announced that tennis star Daniil Medvedev will serve as a Game Ambassador. With almost 3,000 hours logged in Siege so far, Medvedev is an avid competitive player who is currently ranked Diamond, earning his spot among one of the highest tiers of Siege players. As a Game Ambassador, he will partner with the development team to provide feedback on early content and upcoming features. There will also be a Medvedev-themed cosmetic bundle coming in 2024, including a weapon skin, gear, and charm.\n\n\"We're proud and excited to work with Daniil. His creativity and strategically minded play are what make him so exciting both in tennis and in top-ranked matches of Rainbow Six Siege,\" said Director of Business Strategy Mohammed Benhenneda. \"He's the perfect ambassador, representing what makes Siege different from any other game out there.\"\n\n![Daniil Medvedev Ambassador announcement - Dani](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1Ckvz9W0sWvXhF4qgBb3EC/41214e4af8d5085ddb274927cc4778a9/Dani-2.jpg)\n\nTo learn a little bit more about Medvedev's history with Siege and his passion for the game, Ubisoft News interviewed the tennis pro about how much he plays, what he likes about the game, and which map you definitely don't want to see him on.\n\n__When did you start getting into Rainbow Six Siege?__\n\n__Daniil Medvedev:__ I got really into it in 2016; that was the year I really starting putting hours in. All of my friends were playing it, so that attracted me to the game, and as I played it more and more, I fell in love with it.\n\n__When you sit down to play a session, what are you hoping to get out of it? What kind of competitive spirit do you bring to Siege?__\n\n__DM:__ I want to have fun and be competitive. It's in my nature that I want to win at everything, and this game allows both - to have fun combined with the will to win.   \n\n__With all your travel and competition commitments, where and when do you usually find time to play Siege?__\n\n__DM:__  To be honest, I do not play when I travel for tournaments; I would be in trouble, as I would not go to sleep on time, so I only play when I am at home. I wish I could play more, but I also have to practice some tennis.\n\n__Rainbow Six Siege is a game that rewards strategizing in advance and adapting your tactics in the moment. How do you think your tennis career has influenced how you play Siege?__\n\n__DM:__  Timing is very important; like in tennis, you need to find a good moment to attack. And, just as in tennis, you need to make a plan. But if the plan is not working, finding the right time to switch to a new plan is key. I guess my experience as a pro tennis player helps me with this.\n\n__Have you ever tried to recruit any of your coaches or fellow players to join a 5-stack?__\n\n__DM:__  No, they would not be good enough, so I have not asked them to join. I started playing this game with my friends, and we have made some great memories. Spending all this time playing together, you really build a bond.\n\n__What's one piece of advice you'd give players looking to get into Siege or to elevate their game?__\n\n__DM:__  Two things: First, play to win, be competitive. And second, practice your aim.\n\n<b>Fill in the blanks: If you are matched against Daniil Medvedev in Ranked play, you should always ban the  <u>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</u> map because  <u>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</u>.</b>\n\n__DM:__  You should ban Kanal because it's my best map. But don't tell anyone.\n\n*Rainbow Six Siege just launched its latest season,* [*Operation Heavy Mettle*](https://news.ubisoft.com/en-us/article/52yt8qOctpaeT42YMmQ4je/rainbow-six-siege-operation-heavy-mettle-operator-and-gadget-guide). *The game is available now on Xbox Series X|S, PS4, PS5, PC through Ubisoft Connect, Steam, and Amazon Luna, and is included in a* [*Ubisoft+*](https://ubisoftplus.com/) *subscription.*\n",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6Yveu38toC0MdnhkcXOgGl/rainbow-six-siege-names-tennis-star-daniil-medvedev-as-game-ambassador",
    "date": "2023-09-08T16:00:00.000Z"
  },
  {
    "id": "5GbImX9Jvvoa37Bln41aAa",
    "title": "Y8S3 Patch Notes Addendum",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y8S2.3",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1Xd1rsLOZpsIHu2ml6dOHO/030a08f464d680a9374348e0d9f62347/thumbnail.jpg",
    "content": "You can find here the updates and fixes made over the course of the Y8S3 Season Test Server.\n\n## Y8S3 Patch Size\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 6.11 GB\n\n- Steam: 5.5 GB\n\n- Xbox One: 5.85 GB\n\n- Xbox Series X: 6.76 GB\n\n- PlayStation 4: 5.45 GB\n\n- PlayStation 5: 5.85 GB\n\n# BALANCING\n\n## SHOTGUN\n\n- *Further tweaks on the ITA12L, Buck's Skeleton key, SG-CQB and the M870 to bring them in line with the rest of the rework.*\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Adaptive Trigger effect for PS5 controllers is missing after changing Operators in Team Deathmatch or Free For All.\n\nFIXED - Players can't finish the Attack tutorial if they eliminate a dummy before the \"Eliminate Opponents\" objective is active.\n\nFIXED - Players can glitch through walls by exploiting an interaction with Exit Rappel and Breach Charges.\n\nFIXED - Zero's Argus cameras hacked by Defenders retain a viewable camera feed when they lose their signal outdoors.\n\nFIXED - Starting the Basics tutorial for the first time will show an ammo counter instead of the infinity symbol.\n\nFIXED - Player's drone can pass through assets and block the completion of the Basics tutorial.\n\nFIXED - The being shot VFX in 1st person last longer while aiming down sight.\n\nFIXED - Bullet spread randomization is missing when hip firing the weapon.\n\nFIXED - The defusing location for the Attack tutorial is too small and close to the bomb.\n\nFIXED - FPS drops when players spin around quickly in B Laundry Room of the Oregon map.\n\nFIXED - The wall button on the interactive panel isn't highlighted when the destructible wall is active in the Shooting Range.\n\nFIXED - Brava doesn't get scoring points when using Jager's Active Defense System or Wamai's MAG-NET System that's been hacked by a Kludge Drone.\n\nFIXED - Scoring doesn't count the 4th device deployed by Amaru, Gridlock or Castle.\n\nFIXED - Weapon SFX loops when players shoot and fast exit rappel at the same time.\n\nFIXED - Players skip reload animation during pick up or weapon swap animation.\n\n### LEVEL DESIGN\n\nFIXED - A stud is visible in 2F Attic of the Oregon map.\n\nFIXED - A stud is visible in 1F Security Corridor of the Oregon map.\n\nFIXED - LOD issue is present in the hallway between 1F Hatch Room and 1F Melee Training of the Basics tutorial.\n\nFIXED - Cliffside spawn point is missing from the Chalet map.\n\nFIXED - A stud is visible in 2F Back Stairs of the Villa map.\n\nFIXED - The Operator gets stuck after navigating across the crates in the Basics tutorial.\n\nFIXED - Defenders are detected as outside at multiple locations on various maps.\n\nFIXED -  Texture flickers on carpet in 1F Open Area of the Consulate map.\n\nFIXED - Laser attachment is visible through the wall  when the Operator is facing it while prone.\n\nFIXED - Metals crates are see-through to Operators in the 2F Server Room of the the Kanal map.\n\nFIXED - Operator gets stuck when jumping onto a balcony at EXT Back Alley on Favela map.\n\nFIXED - Operators can't retrieve the defuser if it's dropped while entering or exiting rappel in specific spots on various maps.\n\nFIXED - Various defuser planting and pickup issues.\n\nFIXED - Various collision, asset, and texture issues on maps.\n\n### OPERATORS\n\nFIXED - Placing Ram's BU-GI below a window can allow players to instantly exit rappel.\n\nFIXED - Ram's BU-GI slides through the air when thrown against uneven surfaces.\n\nFIXED - Solis can't detect Ram's BU-GI when it is held in her hands.\n\nFIXED - Ram's BU-GI loses functionality after being dropped while Ram is holding it.\n\nFIXED -  Ram's BU-GI gets stuck in multiple walls and assets on various map.\n\nFIXED - Ram's BU-GI is unable to completely destroy the walls located in 1F Joint Corridor of the Theme Park map.\n\nFIXED - When Ram holds the first BU-GI and attempts to change its trajectory, the HUD trajectory icon doesn't update.\n\nFIXED - Ram's BU-GI is unable to completely destroy the wall located in between 1F Lounge and 1F Garage of Clubhouse map.\n\nFIXED - Ram's BU-GI is unable to break the wooden walls located in 2F Ceramic Gallery of the Country Club map.\n\nFIXED - Ram's BU-GI gets stuck in the wall located in 2F Day Care of the Theme Park map.\n\nFIXED - Castle's Armor Panels aren't destroyed by Ram's BU-GI.\n\nFIXED - When Ram eliminates a player with the BU-GI, the kill cam zooms on the BU-GI at random intervals.\n\nFIXED - Scoring points aren't awarded when Operators destroy Goyo's Volcan Canister by destroying a barricade it's placed on.\n\nFIXED - Fenrir's F-NATT Dread Mine clips through the floor, making it harder to spot.\n\nFIXED - Grim's Kawan Hive Launcher doesn't ping opponents inside the swarm until affected by the decay debuff.\n\nFIXED -  Hibana's X-Kairos pellets go through the cubicles in the 2F Admin Office of the Consulate map.\n\nFIXED - Frost's Welcome Mat doesn't deploy properly when dropped on top of the defuser.\n\nFIXED -  A Bulletproof Camera affected by a hacked Signal Disruptor shows glitched VFX even after the Signal Disruptor is destroyed.\n\nFIXED - Brava's Kludge Drone looks higher and lower than intended.\n\nFIXED - Ping doesn't display the right color when used on Goyo's Vulcan Canister.\n\nFIXED - Echo's Yokai Drone doesn't move properly when exiting the Observation Tools mid-jump and then re-entering.\n\nFIXED - Brava's Kludge Drone loses signal when moved outside after re-hacking it from Mozzie's Pest.\n\nFIXED - Missing VFX feedback when spectating Nokk when HEL Presence Reduction is active.\n\nFIXED - Fenrir's F-NATT Dread Mine location displays as a placeholder when deployed outside of EXT Terrace of the Kafe Dostoyevsky map.\n\nFIXED - Drones don't recover from a lost signal status when reclaimed from Mozzie's Pest using Brava's Kludge Drone.\n\nFIXED - Sledge's Breaching Hammer can't destroy Iana's Gemini Replicator.\n\nFIXED - Valkyrie's Black Eyes are turned off when hacked outside by Brava's Kludge Drone.\n\nFIXED - Osa's Talon-8 shield can't be guard broken if Opponent is prone or crouched while Osa is standing while holding the Talon-8 Shield.\n\nFIXED - Grim's Kawan Hive Launcher ammo counter always shows 0 during replay.\n\nFIXED - Grim's Kawan Hive Launcher doesn't accurately ping the opponent's location if they're scanned by a drone.\n\nFIXED - Grim's Kawan Hive Launcher still pings Opponents if Grim is eliminated while deploying a canister.\n\nFIXED - Brava's Kludge Drone doesn't display HUD feedback when aiming at devices through certain assets.\n\nFIXED - Sen's R.O.U. Projector System doesn't destroy projectors if deployed more than once.\n\nFIXED - Operator video missing for Smoke.\n\nFIXED - Various animation issues.\n\n### USER EXPERIENCE\n\nFIXED - Can't navigate to the main menu sections by pressing the up arrow or up on the D-pad of a controller while viewing an item in full screen.\n\nFIXED - EXT Construction Site name is missing from the tile when selecting the spawn location on the Oregon map.\n\nFIXED - Ram's default uniform has some visual issues.\n\nFIXED - The main room of the elimination trial for the Basics tutorial displays the wrong compass location.\n\nFIXED - The area before entering 1F Hatch Room in the Basics tutorial displays the wrong compass location.\n\nFIXED - The compass location is missing when the Compass Appearance option is set to Simplified.\n\nFIXED - Chat input functionality is lost and the cursor disappears if the user types in chat or has the player side-panel open when the Planning Phase transitions to the Preparation Phase.\n\nFIXED - Pronounced shadows are present on Operators when viewed from the Operators section.\n\nFIXED - Dread Factor is displayed as the season name on Ram's showcase in the Operator section.\n\nFIXED - The animation in the Home section flickers before resetting.\n\nFIXED -  Players under level 5 can't reconnect to a custom online match.\n\nFIXED - Player commendations appear unresponsive when attempting to commend a player a second time.\n\nFIXED - Multiple actions can't be bound to the same button in Customize Controls menu.\n\nFIXED - Crosshair disappears when trying to aim down sight multiple times after getting eliminated.\n\nFIXED - Custom games can't be created using non-Latin characters in the playlist name.\n\nFIXED - The unread notification from Challenges doesn't refresh after exiting and re-entering the Challenges section.\n\nFIXED - Various spectator mode issues.\n\nFIXED - Various UI issues.\n\nFIXED - Various customization issues.\n\n__AUDIO__\n\nFIXED - SFX loop when players are eliminated while downed.\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game), [Reddit](https://www.reddit.com/r/Rainbow6/), [Facebook](https://www.facebook.com/Rainbow6/) and on our[forums](https://discussions.ubisoft.com/category/609/rainbow-six-siege?lang=en-US).).",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 8,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5GbImX9Jvvoa37Bln41aAa/y8s3-patch-notes-addendum",
    "date": "2023-08-29T15:45:00.000Z"
  },
  {
    "id": "1QKBL9wr6IRWbCg5tGHM4P",
    "title": "New Rainbow Six Siege Streamer Charms for Y8S3!",
    "abstract": "Announcing the next Y8S3 Streamer Charms!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7wLp1GWoC6bmNiELqAES7f/4fb8f894895f10264197ff52e546a92a/Y8S3.StreamerCharms.Header.png",
    "content": "\n## Announcing the next Streamer Charms!\n\nEach season will bring the release of new charms, as well as a return of the streamer’s charms from previous seasons!\n\n# New\n\n![[R6S] News Article - Y8S3 Streamer Charms - updated header - img](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6AMVz56TI4Oac4Wtb70bGg/c2901a60e1b43cfaf000dbac877f26ad/Y8S3.StreamerCharms.Header.png)\n\n[Rembeey](https://www.twitch.tv/reembey)\n\n[rasco100](https://www.twitch.tv/rasco100)\n\n[Vetelcito01](https://www.twitch.tv/vetelcito01)\n\n[OneShooter](https://www.twitch.tv/oneshooter)\n\n## Returning\n\n![[R6S] News Article - Y8S3 Streamer Charms - updated 1 - img](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7ayZM7UMPNMCGSNB3WIYM9/db2f4d980a62f6043bcba9d6e4016b97/Y8S3_Streamercharms_Updated1.png)\n![[R6S] News Article - Y8S3 Streamer Charms - updated 2 - img](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7LlW0JZ0YLDAbfopRpNqYA/9c462bd6414e1e7ff65fda690a808b41/Y8S3_Streamercharms_Updated2.png)\n![[R6S] News Article - Y8S3 Streamer Charms - updated 3 - img](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7wzL1p0aa8Tjc1BomMxZfu/5804b5c6011ac8d92cfb314a11660e07/Y8S3_Streamercharms_Updated3.png)\n![[R6S] News Article - Y8S3 Streamer Charms - updated 4 - img ](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7jxpackRUCsPIk02iZPexI/4f4a0f5f0111615afa9c39264b089780/Y8S3_Streamercharms_Updated4.png)\n\n[Ad9m](https://www.twitch.tv/ad9m)\n[Alfredoplays](https://www.twitch.tv/alfredoplays)\n[AnneMunition](https://www.twitch.tv/annemunition)\n[Beaulo](https://www.twitch.tv/beaulo)\n[Bighead](https://www.twitch.tv/bighead033)\n[BikiniBodhi](https://www.twitch.tv/bikinibodhi)\n[Bnans](https://www.twitch.tv/bnans)\n[Braction](https://www.twitch.tv/bractionfps)\n[CCSesports](https://www.twitch.tv/ccsesports)\n[Drid](https://www.twitch.tv/dridgg) \n[FastAnne](https://www.twitch.tv/fastanne)\n[Gabbo](https://www.twitch.tv/JustGabbo)\n[Heideltraut](https://www.twitch.tv/heideltraut)\n[Interro](https://www.twitch.tv/interro)\n[JerichoFive](https://www.twitch.tv/jerichofive)\n[JessGOAT](https://www.twitch.tv/jessgoat)\n[Jynxzi](https://www.twitch.tv/jynxzi)\n[Just9n](https://www.twitch.tv/just9n)\n[Kalera](https://www.twitch.tv/Kalera)\n[KingGeorge](https://www.twitch.tv/KingGeorge)\n[KittyR6](https://www.twitch.tv/kitty_r6)\n[LagonisR6](https://www.twitch.tv/lagonis)\n[Lil_Lexi](https://www.twitch.tv/lil_lexi)\n[Lt Custard](https://www.twitch.tv/lt_custard)\n[Lusorkoeffizient](https://www.twitch.tv/lusorkoeffizient)\n[MacieJay](https://www.twitch.tv/MacieJay)\n[Mag6](https://www.twitch.tv/mag6)\n[M3RYLAND](https://www.twitch.tv/M3RYLAND)\n[Matimi0](https://www.twitch.tv/matimi0)\n[MrBboy45](https://www.twitch.tv/mrbboy45)\n[Narcoleptic Nugget](https://www.twitch.tv/narcolepticnugget)\n[Nesk](https://www.twitch.tv/neskwga)\n[PaladinAmber](https://www.twitch.tv/paladinamber)\n[Patife](https://www.twitch.tv/patife)\n[Pengu](https://www.twitch.tv/pengu)\n[RazaH](https://www.twitch.tv/razah)\n[REMGURI / 렘쨩](https://www.twitch.tv/remguri)\n[Rubsarb](https://www.twitch.tv/Rubsarb/)\n[SexyCake](https://www.twitch.tv/smexycake)\n[Sha77e](https://www.twitch.tv/sha77etv)\n[Shorty](https://www.twitch.tv/shortyyguy)\n[shroud](https://www.twitch.tv/shroud)\n[SilphTV](https://www.twitch.tv/silphtv)\n[Tatted](https://www.twitch.tv/tatted)\n[Tranth](https://www.twitch.tv/tranth)\n[Varsity](https://www.twitch.tv/varsitygaming)\n[WhiteShark67](https://www.twitch.tv/whiteshark67)\n[yo_boy_roy](https://www.twitch.tv/yo_boy_roy)\n[z1ronic](https://www.twitch.tv/zironicdk)\n[Zander](https://www.twitch.tv/zander)\n[ziGueira](https://www.twitch.tv/zigueira)\n[GarfieldIsDoc](https://www.twitch.tv/garfield)\n[Supr](https://www.twitch.tv/supr)\n[RyyFyy](https://www.twitch.tv/ryyfyy)\n[FoxA](https://www.twitch.tv/foxa_r6)\n[Nerdengenheiro](https://www.twitch.tv/nerdengenheiro)\n[Rainbow6itacom](https://www.twitch.tv/rainbow6itacom)\n[Minimichegga](https://www.twitch.tv/minimichegga)\n[JostRekt](https://www.twitch.tv/jostrekt)\n[JustRyuk](https://www.twitch.tv/justryuk)\n[Paluhh](https://www.twitch.tv/paluhh)\n[Poxonlox](https://www.twitch.tv/poxonlox)\n[TheLionerYT](https://www.twitch.tv/thelioneryt)\n[itsSpoit](https://www.twitch.tv/itsspoit)\n[Retalha](https://www.twitch.tv/retalha)\n[FooYa](https://www.twitch.tv/fooya)\n[IceCold](https://www.twitch.tv/icecold)\n[Athieno](https://www.twitch.tv/athieno)\n[Marciu](https://www.twitch.tv/marciu)\n\n## How to acquire charms\n\nThese charms are only available by subscribing to the respective streamer’s Twitch channel with a linked Ubisoft account. For more information on how to link your Ubisoft and Twitch account, as well as opt in for Twitch Drops, please refer to [this FAQ](https://support.ubi.com/Faqs/000035432/Get-your-Twitch-Streamer-s-charm).\n\n## How to get involved\n\nWe are always on the lookout for additional content creators to add to the program. If your goal is to see your charm in game, we use the following criteria to begin the selection process for potential candidates:\n\nThis is an evolving program so to reflect this, the following requirements have been adjusted.\n\n__Requirements to be considered__\n-\tApproximately 150+ concurrent viewers.\n-\tAverage of 10 Rainbow Six streams per month.\n-\tAverage of 20 hours of Rainbow Six streamed per month.\n-\tPositive standing with Ubisoft/Rainbow Six Siege.\n-\tHigh quality level of content.\n-\tTwitch Partnered.\n-\tRainbow Six Siege reserves the right for final decision.\n\n__Consideration for Removal__\n-\tLess than 10 Rainbow Six Siege main streams over 3 months.\n-\tLevel of quality dropping below an acceptable level.\n- \tStanding with Rainbow Six Siege/Ubisoft compromised.\n-\tAny actions that may negatively affect the R6S/Ubisoft brand.\n-\tLoss of Twitch Partnership.\n-\tRainbow Six Siege reserves the right for removal of any charms.",
    "categories": [
      "rainbow-six-siege",
      "community"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1QKBL9wr6IRWbCg5tGHM4P/new-rainbow-six-siege-streamer-charms-for-y8s3",
    "date": "2023-08-25T14:45:00.000Z"
  },
  {
    "id": "dnwatjKhLBCgGuHopFmls",
    "title": "Classified: Balancing Team - Year 8 and Beyond",
    "abstract": "Setting out the philosophy and vision of the Balancing team.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/sjFBWBDhqbhfqDsI03qfZ/36ed48541ff7c6620141d42956a3e8f9/Classified_Balance_header_960x540.v2.png",
    "content": "## BALANCING PHILOSOPHY & OBJECTIVES\n\nIn Rainbow Six Siege, every operator is an expert, with a focused proficiency that gives them strength: very strong in the right situations but with flaws in the wrong ones. Our balancing philosophy is all about providing you with the right set of tools to confront very specific situations: for any situation you encounter in the game, there should be wide (but also limited) solutions.\n\nThis year, we aim to __reduce the strong jack-of-all-trades operators__ to ensure every decision you make has a thoughtful process behind it. We also want to continue to __enhance the game's tactical playstyle by__ __working towards balancing solutions which emphasize the importance of our operator's gadgets__.\n\nYou will find more details on our vision and plans below, as well as a rundown of our priorities for the rest of Year 8.\n\n## YEAR 8 AND BEYOND\n\n### ATTACHMENTS, ADS & FRAGS\n\nWe are aware of current community concerns surrounding the 1.5x sight. While your attachment choices should be meaningful, it shouldn't drive your operator pick. To this end, the Balancing team has been working over the past few months on new vectors to balance our operators and their loadouts.\n\nRight now, both Frag Grenades and the 1.5x sight are highly utilized and can have a large effect on the success and presence of an operator. Swapping these between loadouts is a short-term solution, and we are currently taking the time needed to polish a larger set of changes that will bring more sustainable balancing levers, allowing us to make less \"binary\" changes in the future. The team is actively working on a solution for this complex and entrenched issue in the game's meta.\n\n### OPERATOR BALANCING & TACTICAL GAMEPLAY\n\nWe recognize that a number of operators such as Iana, Azami, Warden, Solis and Blackbeard, don't feel right at the moment, and of course Recruit shares a similar position. We are in the process of prototyping effective solutions to make these feel balanced and worthy.\n\nIn an upcoming mid-season update, we'll be making a number of short-term adjustments to help boost operator presence and variety, or to reign it in where needed.  In parallel to this, we have longer-term plans in the pipeline for our weaker and more powerful operators. These plans will help to reinforce the tactical gameplay that Siege is known for, bringing the focus back to gadgets and utilities. With this, running and gunning will come with increased risk and difficulty.\n\nThere is a considerable amount of work to be done until we can bring all those solutions to the live server due to the nature of some of these changes. In the meantime, we continue to bring you balancing updates by selecting topics which, on one hand, allow us to make the necessary adjustments to the meta and work towards this goal, and on the other hand, aren't taking too much time or resources away from these longer-term plans and priorities.\n\n## COMING UP IN YEAR 8 AND MORE\n\n### Y8S3 - GRIM BUFF (PART 2) - KAWAN HIVE LAUNCHER\n\nWith part one of Grim's buff released in Y8S2, it's now time to look at what's next. In Y8S3, we will enable Grim to switch the firing mode on the Kawan Hive Launcher, with the alternative mode making Kawan Hives bounce off of surfaces rather than sticking to them. The update will increase Grim's versatility, giving players the ability to bounce Kawan Hives around corners and removing the line of sight requirement. This change completes our current vision for Grim and we're looking forward to seeing how players make use of this evolution.\n\n### Y8S3.3 - FROST'S WELCOME MAT REWORK\n\nAfter internal play sessions and a release on the Test Server, we felt like there was still work to be done on the Frost rework, and so we have made meaningful adjustments for the final release.\n\n__WHAT HAS CHANGED?__\n\n- Increased self-revive time\n\n- Extended and made the debuff more severe after self-reviving\n\n- Allowing teammate revive, cancelling the debuff activation\n\nThese changes make self-reviving from a Welcome Mat a much more dangerous and rewarding feat. It will allow Frost players more time to react, and this coupled with the increased debuff, will make sure that players don't want to fall victim to the traps. At the same time, with a teammate revive being an enticing option, Frost players are still going to find those \"double kill\" opportunities.\n\nWe'll be releasing this rework during Y8S3 and carefully evaluating Frost's performance throughout the season.\n\n__WHY DOES THE WELCOME MAT NEED A CHANGE?__\n\nCurrently, if an attacker falls victim to a Welcome Mat, a player is left trapped, out of options, and effectively removed from the action. We don't want players to feel helpless in any situation; an operator should always have options, even if they are limited. With this being the case, we feel that a change to the way that Welcome Mats work is needed, in order to improve the experience for stricken players. With this change we're enabling players to take action, giving them the ability to remove themselves from the Welcome Mat, however, during and after their attempted escape, players are going to feel vulnerable. Critically though, with the usual sound cues and the addition of blood trails, the huntress can still be ready to take care of her foes.\n\n### Y8S3 - FUZE'S CLUSTER CHARGE\n\nFuze packs high fire power but can still feel limited in many circumstances. To improve Fuse's usability, Cluster Charges will be able to be deployed on Deployable Shields and Osa's Talon-8 Shields, providing new strategic possibilities for players to find and utilize.\n\n### Y8S3 - SHOTGUNS\n\nWe'll also be reworking all shotguns in Y8S3 (excluding the BOSG 12, TCSG12, and ACS12) with the goal of bringing more consistency to the weapon type. This change will make aiming down sights more rewarding, while decreasing the effectiveness of hip-fire. You can find more in-depth information on this change [here](https://rainbow6.com/designersnotes/y8s3).\n\n### Y8S4 - SHIELD REWORK\n\nWe want shield operators to feel strong, while taking away the feeling of powerlessness when facing off against them; In a one-on-one situation, a player should feel that they have a chance against a shield operator, and on the other side, a shield operator should not be bullied without consequence or risk. Changes such as removing hip-fire while the shield is out will help to remove frustrations on both sides of the battle, and reinforce the idea that with a team around them, a shield operator can be a true force to be reckoned with.\n\n### YEAR 9 - AZAMI'S KIBA BARRIER\n\nKiba Barriers have allowed Azami to become one of the strongest operators in the defender lineup, giving her the ability to control areas and create angles which are difficult for opponents to deal with and see. We'll be making changes to decrease the robustness of her gadget and to give attackers the option to play more aggressively against her. Once these changes are ready, we'll be testing and evaluating them with community feedback, ensuring that they are effective and balanced.\n\n## CONCLUSION\n\nCommunity concerns are our concerns: we are refactoring and making proactive changes behind the scenes to answer the feedback you are sharing with us to make siege this unique tactical shooter experience we all enjoy.",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 7,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/dnwatjKhLBCgGuHopFmls/classified-balancing-team-year-8-and-beyond",
    "date": "2023-08-22T16:00:00.000Z"
  },
  {
    "id": "1589JIZN3Llr2uizo0hs9N",
    "title": "“I may not have a family, but I have Redhammer.” – Ram",
    "abstract": "Break through to the other side in Operation HEAVY METTLE, where nothing can stand against the unstoppable force that is our newest attack Operator: Bo-Ram Choi.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3ToiYMR4ivAYRQnXybI3ZW/b38d1236f752046c01f28fc0ccff3369/Y8S3_HeavyMettle_OperatorKeyart.jpg",
    "content": "Break through to the other side in Operation HEAVY METTLE, where nothing can stand against the unstoppable force that is our newest attack Operator: Bo-Ram Choi. \n\nJoining the REDHAMMER team, Ram is just as relentless as she is protective of her team, and nothing speaks to these qualities more than the newest device she brings to the field The BU-GI AUTO BREACHER. Once deployed, the BU-GI destroys all devices and breakable objects in the way, making Ram a terrifying destruction Operator. With 3 HEALTH, 1 SPEED and the option to bring the STUN GRENADE Ram moves with intent and deadly precision, and whatever the BU-GI can't destroy, she has the answer with the HARD BREACH CHARGE as another option for her loadout. The R4C and MK1 9mm are safe choices for her, but when she wants to get loud in a way only REDHAMMER can, she has the LMG-E and ITA 12s as options for her loadout. \n\nThe BU-GI AUTO-BREACHER is a miniature tank that can be deployed anywhere, and will destroy any breakable objects in the way, including floors. Ram can deploy the BU-GI from a safe position and then set the trajectory, letting destruction run Rampant without her need to be there. Defense Operators are going to want to rely on SOLIS' SPEC-IO ELECTRO-SENSOR to spot the device before it's activated and destroy it with IMPACT GRENADES or can rely on GOYO'S VOLCAN CANISTER to stop the push that follows the BU-GI. \n\nFrom Busan, South Korea, she grew up in orphanages and served in the Republic of Korea Armed Forces the moment she came of age. Raising quickly through the ranks, she was recruited in to an all-female CTU unit known as Tarantula. Ram has now found her new family in REDHAMMER, a family that appreciate her destructive force and fierce focus.\n\nCheck out the destructive power of Ram on Test Servers starting August 14<sup>th</sup>.",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1589JIZN3Llr2uizo0hs9N/i-may-not-have-a-family-but-i-have-redhammer-ram",
    "date": "2023-08-14T16:00:00.000Z"
  },
  {
    "id": "2Btj0mP7e7gVKIODGSLuiX",
    "title": "Y8S3 Designer’s Notes",
    "abstract": "In this latest edition of Designer’s Notes, we'll go into detail about the balancing changes that’ll come with the Y8S3 patch and give you some insight into the reasons behind them",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/sde2TZ01fJMeuROBfY7Qi/5c6336fedab1e597d9f349ead0922080/image-2023-08-09-11-14-14-463.png",
    "content": "In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y8S3 Update and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n### WIN DELTA VS. PRESENCE\n\n![[R6S] News - Y8S3 Designer’s Notes - BalancingMatrix_Att - Video](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/30OCLazuhixNzrWmArWgzL/2b88ece25ac60854d0c6d7019fa7fe17/R6S_DN_Y8S3_BalancingMatrix_Att.mp4)\n\n![[R6S] News - Y8S3 Designer’s Notes - BalancingMatrix_Def - Video](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3UYi1wvbmr3Kfbi8SuzReZ/acd6297fb0b248d464782438645817b5/R6S_DN_Y8S3_BalancingMatrix_Def.mp4)\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n# OPERATOR BAN RATE\n\n![[R6S] News - Y8S3 Designer’s Notes - BanMatrix_Att - Video](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6zwpkY1GTGqomS0xdzgqc/e1619fbbcd0ccb7fc14b9a021e06cc66/R6S_DN_Y8S3_BanMatrix_Att.mp4)\n\n![[R6S] News - Y8S3 Designer’s Notes - BanMatrix_Def - Video](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6ogtBXvIknNcbj8mTmXW1P/8868121e1dd1e55615b04c29cfc628dc/R6S_DN_Y8S3_BanMatrix_Def.mp4)\n\n## MESSAGE FROM THE TEAM\n\n* * * * *\n\nWe've been observing both Iana and Warden's continuous ascent to the top tiers of presence in matches. We are aware of the situation and the issues behind it.\\\nIana's high presence is mainly driven by her access to Frag Grenades, while Warden's high presence relates to the strength of 1.5x sights on Defender loadouts. The Community's sentiments over this topic are in alignment with ours. These operators need changes, and we will take action in an upcoming mid-season patch to make sure they feel less like \"must picks\" and more like weighted choices within a squad's lineup.\n\nThis mid-season patch adjustment is aimed at allowing more operator diversity in matches in the short term, but we are working in parallel on a bigger solution that will attend the balance situation of Frag Grenades and the 1.5x sight within Siege. Both elements are widespread through our lineup of operators, and we know that shuffling them around is not a sustainable solution, that is why we are taking the time to polish a more substantial set of changes that should open up more balancing options allowing us to make less \"binary\" changes in the future.\n\n## OPERATOR BALANCING\n\n### FUZE\n\n#### CLUSTER CHARGE\n\n-   Can be deployed on Deployable Shields and Talon Shields\n\nNow that Fuze can deploy the Cluster Charge on reinforcements, we will also allow him to do it on Deployable shields and Talon Shields. It is a small change but will create a new synergy between Fuze and Osa, allowing the use of his charges in places that weren't possible before. Though there is a cost. As with any other bulletproof glass, the Cluster Charge will shatter the shields when the drilling is successful.\n\n### ZERO\n\n#### ARGUS CAMERA\n\n-   Can pierce through Deployable Shields and Talon Shields.\n\nThis change won't have a huge impact on matches, but it will bring consistency to the rules of piercing, if the gadget can get through reinforcements, it should also be capable of piercing Deployable and Talon Shields. Since the piercing action of the Argus Camera cannot shatter Mira's Black Mirror, then the same rule applies to shields, so they won't shatter either.\n\n### GRIM\n\n#### KAWAN HIVE LAUNCHER\n\n-   Switch Ability Mode to Sticky (default) or Bouncy\n\nOne of the main weaknesses of Grim is the need to have line of sight with the location you want to activate the Hive in. With this update, we are introducing a new firing mode to address this. From now on, Grim can select if the projectile will stick or bounce after touching a surface. This adds to all the changes done in the previous season and will help you to apply the effect on your target.\n\n### LESION\n\n#### BASE STATS\n\n-   Gadget refill timer Reduced to 20 seconds (from 30)\n-   Max resources Increased to 9 mines (from 8)\n\n#### GU MINE\n\n-   Gadget type is now Mechanical (unaffected by EMPs)\n-   Initial damage Increased to 5hp (from 0)\n-   Poison damage Increased to 12hp (from 8)\n-   Poison timer Reduced to 2 seconds (from 2.5)\n-   Cloaking removed\n-   HUD Icon removed\n-   Stepping on a GU Mine while being affected by another will reset the Poison timer and deal the Poison damage instantly.\n-   Added Area of Effect feedback\n\n#### LOADOUT\n\n-   Added Super Shorty as a secondary weapon option\n\nDying because of something invisible is a source of frustration and is why we removed the initial damage from the GU mine at the beginning of Year 5. But this change also removed a situation we've been trying to recover for some time: the fear of stepping on multiple mines in a row.\n\nWe have reintroduced the initial damage and made stepping on multiple mines a bit spicier. If you are already poisoned by a GU mine and trigger another, you will receive the initial damage and an instant tick of poison damage from the one already on your foot, so you will need to be more careful. These 2 changes turn the mines into a threat again. We are also tweaking some extra values, like the poison damage and the timer, to make removing the nail more urgent.\n\nBecause of these changes we have decided to remove the cloaking completely, making GU mines always visible. This should eliminate the frustration and increase the skill ceiling, as you will need to look for good locations to place your mines. This also removes the only electronic part of the device, so IQ won't be able to detect them, and Brava won't be able to hack them.\n\n## GADGET BALANCING\n\n### DEPLOYABLE SHIELD\n\n#### BASE STATS\n\n-   Bulletproof Glass: Hitting the shield with a melee will shatter the glass windows.\n\nWe have taken the opportunity to update the Shattered Glass System for Deployable Shields along with the changes to Fuze. If the shield receives a melee hit, the glass of the windows will be shattered.\n\n## WEAPON BALANCING\n\n### SHOTGUNS\n\n#### BASE STATS\n\n-   Every shotgun excluding the BOSG 12, TCSG12 and ACS12 have had the following changes.\n-   Ranges are normalized into 3 stages.\n\n-   0-5 meters, each pellet deals 100% of the base damage\n-   6-10 meters , each pellet deals 75% of the base damage\n-   13 meters and above, each pellet deals 45% of the base damage\n\n-   Headshot modifier: A pellet getting the headshot modifier deals 1.5x the damage after its range modifier.\n-   Hip fire spread has been revisited and redistributed across the board.\n-   Shooting while aiming down sight results in a tighter spread across the board. Note that this effect is not new, just being increased to reward players when aiming down sights.\n-   Moving increases the spread.\n\nThis is a big pass on every classical shotgun in the game. With these changes we are adding consistency and something you can learn. Ranges are normalized and based on the average kill distance in the game as well as the m590A1, which we know is a favorite at this time. The goal here is to reward good practices such as aiming for the head or holding angles. These changes are aimed at making shotguns less spray and pray, and more worthy as an option without removing what is currently working.\n\n## PLAYLIST ECOSYSTEM UPDATE\n\n### QUICK MATCH\n\nAs announced during the year 8 reveal, we started to look at how we could change Quick Match to make it much more... well \"Quick.\" We realized that we needed to make tweaks to other playlists for this new Quick Match to fit.\n\n#### BASE CHANGES\n\n-   Action phase reduced to 165s (from 180).\n-   Operator pick phase duration reduced to 20s (from 30). Additionally, if the round did not involve a role swap, the operator pick phase is reduced to 15s.\n-   Preparation phase reduced to 30s (from 45).\n-   Objective locations are automatically revealed for attackers at the start of the round.\n-   Clearance Level availability increased to CL 10\n-   We have made some tweaks to the matchmaking algorithm for Quick Match to find matches quicker.\n-   We will be applying a soft reset to the casual skill level algorithm to bring everyone closer together, which should result in finding matches even faster.\n\nWe are also taking this chance to implement 2 new concepts to the Quick Match playlist: __Pre-Setups__ and the __Attacker Safeguard__\n\n__PRE-SETUPS__\n\nFor every map in the map pool, we have designed 2 sets of pre-setups for every bombsite (this new feature is bomb exclusive) which include a number of pre-deployed reinforcements on the map as well as pre-placed rotations and holes.\\\nThese new pre-setups will allow defenders to jump into the action right away without having to worry about reinforcing the entire site.\n\n__ATTACKER SAFEGUARD__\n\nAttackers in Quick Match will no longer have to worry about possible spawn peaks or runouts at the beginning of the round as we are implementing 10 seconds of invulnerability at the start of the Action Phase (for attackers only). An attacker will become vulnerable again after those 10 seconds __or if that attacker enters the building__. This way, attackers will be able to approach the building without having to check every window.\n\nWe are also extending the already known \"Red Walls\" for 10 additional seconds to keep defenders from exiting the building while the attackers are making their approach.\n\nThese changes are aimed at making Quick Match a place in Rainbow Six: Siege that allows you to jump straight into the action and jump out to another match. We want players to feel that they can have their R6 fix easier, without having to worry about the basic and repetitive actions of a normal Siege match.\n\nAdditionally, we wanted to address the fact that some of the more classic maps in the casual map pool will not be included in the new Quick Match. We know that losing access to these maps can be frustrating and we will actively work towards adding them back to the map pool as soon as they are ready with their own new pre-setups.\n\n### STANDARD (PREVIOUSLY UNRANKED)\n\nPart of this update includes changing what was previously Unranked and giving it a new identity inside Rainbow Six: Siege. With the Quick Match updates, we were losing a place in the game to experience a core Siege match outside of the Ranked environment, that's why we decided to shift Unranked into what we now call the \"Standard\" playlist.\n\nStandard will now also be the recommended playlist for new players coming into the game.\n\n#### BASE CHANGES\n\n-   Removal of Operator and Map ban phases.\n-   Overtime rounds changed to 1 (from 3).\n-   Clearance Level availability changed to CL 0.\n-   We are renaming the competitive cluster to \"Tactical\" in order to better inform players about the type of playlists that can be found inside.\n\n* * * * *\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": null,
    "readTime": 10,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2Btj0mP7e7gVKIODGSLuiX/y8s3-designers-notes",
    "date": "2023-08-13T22:00:00.000Z"
  },
  {
    "id": "hmLtXQucpD05WszOadhAO",
    "title": "Y8S2 Mid-Season Roadmap Update",
    "abstract": "Check out what's coming to Rainbow Six Siege in the Y8S2 Mid-Season Roadmap Update.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/17BpR9amZDVbV8xlGp7Mhb/c5587b8f52be4cfc4afa0944bf1eedd2/Y8S2_Midseason_Roadmap_Update.png",
    "content": "Each season, as we introduce new content, we are also providing an updated Roadmap to ensure transparency on upcoming features. When making those adjustments, we are considering multiple factors, including your feedback.\n\nToday's update is mainly to confirm that everything announced for Season 3 will be released as planned. We also wanted to provide additional insights on what to expect from the upcoming Operation. Please keep in mind that we also have a few surprises coming shortly, which are not displayed in the Roadmap below, so stay tuned for more!\n\nLet's now dive into this mid-season Roadmap update.\n\n![[R6S] Y8S2 Mid-Season Roadmap Update Midseason Roadmap](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1jHAvFCGJvytt58qF9StwK/ae582db73a4329771ad25233b14aed47/Y8S2_Midseason_Roadmap_Asset__1_.png)\n\n## ROADMAP UPDATES\n\n### [MAIN FEATURE] QUICK MATCH 2.0\n\n- Status: confirmed for Y8S3\n\nQuick Match 2.0 is ready for a release in Season 3. As announced back at the SI, it is a package of improvements which aim to speed up the playlist, making it more agile without affecting the Siege experience. We also have more game modes updates coming in Season 3, so get ready for some surprises!\n\n### [PLAYER PROTECTION] PLAYER COMMENDATION SYSTEM\n\n- Status: confirmed for Y8S3\n\nIf you follow us on social media, you might have seen some exciting news regarding the future of the Reputation System, in which we are including the new Player Commendation System. This new feature coming in season 3 will promote community recognition and encourage pro-social behavior, reinforcing that Rainbow Six Siege is a cooperative game. A full overview of the feature will be shared during the upcoming reveal panel.\n\n### [PLAYER PROTECTION] REPUTATION SYSTEM IMPROVEMENTS\n\n- Status: confirmed for Y8S3\n\nAlongside the system-wide rebalance update, the Reputation System, which is currently in Beta phase, will be getting some improvements for a more accurate calculation of a player's Standing. \n\n### [BALANCING] GRIM BUFF PART II\n\n- New earlier target delivery: Y8S3\n\nDuring our last Roadmap update, we announced that a new buff for Grim would be coming in two parts. Part I successfully released during Y8S2 and while Part II was set to release in Y8S4, it will be coming earlier than anticipated, in Y8S3. More details will be given soon, but be prepared to evade those bees!\n\n### [BALANCING] REWORK OF OPERATOR FROST\n\n- Status: confirmed during Y8S3\n\nAfter the feedback received from the Lab TS, we've decided to make some changes and rebalanced Operator Frost in Season 3. This new rework will be released during Season 3. It won't be exactly what some of you have tested on the Lab TS, so stay tuned for more info on what changes we will be bringing to those Welcome Mats.\n\n### [PLAYER COMFORT] FREE CAMERA UPDATE\n\n- Status: confirmed for Y8S3\n\nAs announced during the Y8S2 Reveal Panel, a new feature will allow players to hide the HUD when using the Match Replay feature and will provide the ability to run a free camera. We know that many of you cannot wait to test it out and create content with this new feature, which is why we are bringing it to you in Season 3!\n\nWe have even more content planned for Season 3 and 4, make sure to watch the Year 8 Season 3 Reveal on August 13 and join the discussion on [Twitter](https://twitter.com/Rainbow6Game/), [Threads](https://www.threads.net/@rainbow6game), [Instagram](https://www.instagram.com/rainbow6game_us/), [Reddit](https://www.reddit.com/r/Rainbow6/), [Discord](https://discord.gg/rainbow6) and [Facebook](https://www.facebook.com/Rainbow6/).\n\nFor a recap of all the changes coming your way, check out the [public Roadmap](http://rainbow6.com/roadmap).",
    "categories": null,
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/hmLtXQucpD05WszOadhAO/y8s2-midseason-roadmap-update",
    "date": "2023-08-03T13:50:00.000Z"
  },
  {
    "id": "1MwSYw0xxnbncvKzgdhJZS",
    "title": "Reputation System Beta: System Balancing",
    "abstract": "Details on our system balancing and how it affects players.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3Aew8jqPMbQu36rVqdl7U2/c4d7366860a671ee189c24225252c93a/Reputation.System.Balancing.960x540.png",
    "content": "# SYSTEMWIDE REBALANCING\n\nToday, the Reputation System Formula will be updated to pave the way for new changes and initiatives that will be coming in future seasons. Multiple changes will be coming into effect, leading to exciting new improvements and more accurate Reputation Standings for players. \n\n### WHAT WE'RE CHANGING\n\nWe have rebalanced the way we account for various actions in the system, ultimately affecting how easy it is to attain the highest Standings of Esteemed and Exemplary. \n\nWe have also made changes to certain measures that affect when penalties will be triggered. With the new updates, the point at which a player triggers a penalty will be more consistent.\n\n### HOW WILL THIS AFFECT PLAYERS\n\n- After this update, players' Reputation Standings may have changed. Playing fairly and respecting others is key to helping raise a player's Standing.\n\n- Repeat offenders may rapidly trigger a penalty. Avoiding further disruptive actions will be vital to maintaining a good Standing.\n\n## TO SUMMARIZE\n\nWith this major rebalancing, many players will be seeing a change in their Reputation Standing, with some disruptive players also accelerating the triggering of penalties. This is a deliberate result of our latest Reputation System update. We're working to ensure that this system works well for all players, and we know that with the efforts of our community, together, we can build a great experience for everyone . \n\nThe Reputation System remains in its Beta phase and will keep on evolving as we move forward. In the future, we will be bringing greater visibility and control to players and additional ways for you to interact with one another in prosocial ways. \n\nWe remain committed to ensuring a safe environment for all players.",
    "categories": [
      "rainbow-six-siege",
      "toxicity",
      "dev-blogs"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1MwSYw0xxnbncvKzgdhJZS/reputation-system-beta-system-balancing",
    "date": "2023-07-26T21:00:00.000Z"
  },
  {
    "id": "2HyWwS7OTwTKx3q8CZ7auZ",
    "title": "Y8S2.3 Patch Notes",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y8S2.3",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7EB8njQeeD4HxP0H99NTZj/7e5b96fb4089439e51e5901c2584c1cd/Y8S2.3_PatchNotes.960x540.png",
    "content": "See the upcoming changes to Rainbow Six Siege with the release of Y8S2.3.\n\n## Y8S2.3 Patch Size\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 1.12GB\n- Steam: 1.5 GB\n- Xbox One: 1.36 GB\n- Xbox Series X: 1.64 GB\n- PS4: 1.65 GB\n- PS5: 1.57 GB\n\n## OPERATOR BALANCING \n\n### VIGIL\n\n-   Vigil will share the same glitching behavior as Nøkk.\n-   The ERC-7 Video Disruptor will not be deactivated when performing certain actions, such as shooting, and instead will trigger the glitch effect on cameras.\n-   Vigil won't be immune to Lion's EE-ONE-D and Grim's Kawan Hive. Both gadgets will detect him, but he can prevent being pinged by activating the ERC-7.\n\n### NØKK\n\n-   The HEL gadget ability no longer reduces movement sounds.\n-   Maximum duration increased to 20 seconds (from 12).\n-   Added new glitching sources, such as being flashed or pushed.\n-   Nøkk is no longer immune to Alibi's Prisma. It will detect her, but she can prevent being pinged by activating her the HEL gadget.\n\n### THORN\n\n-   Added 1.5x sight to the UZK50GI.\n\n### ORYX\n\n-   Increased hatch climb speed by 30%.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Missing unlimited ammo in the Snipers Arcade after joining a match in progress.\n\nFIXED - Devices are detected outside when placed on the back wall of 2F Main Stairs in the Skyscraper map.\n\n### USER EXPERIENCE\n\nFIXED - The Battle Pass map flashes on screen when going to the Progress section.\n\nFIXED - Error received when accepting a Squad invite from a player that was part of the same Squad in a previous match.\n\nFIXED - Various Shop and Customization issues.\n\n---\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game), [Reddit](https://www.reddit.com/r/Rainbow6/), [Facebook](https://www.facebook.com/Rainbow6/) and on our[forums](https://discussions.ubisoft.com/category/609/rainbow-six-siege?lang=en-US).).",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2HyWwS7OTwTKx3q8CZ7auZ/y8s23-patch-notes",
    "date": "2023-07-11T10:45:00.000Z"
  },
  {
    "id": "35sHyBXl9SbG9hiIL6cnQZ",
    "title": "Y8S2.3 Designer’s Notes",
    "abstract": "In this latest edition of Designer’s Notes, we'll go into detail about the balancing changes that’ll come with the Y8S2.3 patch and give you some insight into the reasons behind them",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1JYGe6HEzihl4dmMlIj6OL/681f095d24218da67de680b7277ae2ac/R6_DesignersNotes_Y8S2.3_Header_1920X1080.jpg",
    "content": "In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y8S2.3 Update and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n## WIN DELTA VS. PRESENCE\n\n![[R6S] Y8S2.3 Designer's Notes - BalancingMatrix Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7Au3Sm38gfTTyfUPiHNsJn/18cde1d5293597b410e2b5531ce50e38/R6S_DN_Y8S2.3_BalancingMatrix_Att.mp4)\n\n![[R6S] Y8S2.3 Designer's Notes - BalancingMatrix Def v2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4LPDaTIZ44cvn8WfSrtlw2/6be069a0e9f1c85833d1b946885b1b99/R6S_DN_Y8S2.3_BalancingMatrix_Def_v2.mp4)\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n# OPERATOR BAN RATE\n\n![[R6S] Y8S2.3 Designer's Notes - BanMatrix Att v2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3tcBlaabwfYKSQaLXYuTNz/650adce6d4501c9b9a0e417c2319bc69/R6S_DN_Y8S2.3_BanMatrix_Att_v2.mp4)\n\n![[R6S] Y8S2.3 Designer's Notes - BanMatrix Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1NRxVU0VVHJHU4GNNQHDqT/c4d3292cc2f012cc538d71af41e81397/R6S_DN_Y8S2.3_BanMatrix_Def.mp4)\n\n## OPERATOR BALANCING\n\n### THORN\n\n__UZK50GI__\n\n-   Sights: Added 1.5x.\n\nThorn is currently one of the least picked trappers on defender lineups, we've decided to boost her loadout by adding a 1.5x sight to the UZK50GI, this should increase her popularity within the trapper ecosystem.\n\n### NØKK\n\n__HEL Presence Reduction__\n\n-   Remove silent steps while the ability is active.\n-   Increase duration of the ability to 20s (from 12)\n-   Update glitching reasons\n\nDeception is always a controversial topic and Nøkk's ability is conceived around it. She can become invisible to observation tools and at the same time mute her footsteps. She is leading some of the main frustration for defenders and we would like to tackle this. In a quiet environment everyone should be able to hear someone else approaching, and Nøkk's ability to move silently breaks this rule. We've decided to remove the silent facet of the ability in exchange for increased ability duration.\"\n\n### VIGIL\n\n__ERC-7__\n\n-   On observation tools Vigil will share the same glitching effect as Nøkk.\n-   The ability won't deactivate while performing certain actions, like shooting, and will instead trigger the glitch effect on observation tools.\n-   Vigil won't be immune to Lion's EE-ONE-D or Grim's Kawan Hive. Both gadgets will detect him, but he can prevent being pinged down by activating the ERC-7.\n\nNøkk and Vigil share a similar ability, and in the pursuit of consistency, we've decided to extend Nøkk's cloaking rules to Vigil. With this change Vigil will glitch on observation tools while performing actions like shooting, deploying a gadget or sprinting. These new interactions will reward players that proceed more carefully while using the ERC-7 and will punish those who act more careless.\n\n### ORYX\n\n__Hatch Climb__\n\n-   Reduced hatch climb interaction time by 30%.\n\nOur game data shows that Oryx does not profit much from his ability to climb hatches. We would like to make this interaction smoother by reducing its recovery time, now it should feel less dangerous to perform.\n\n---\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "community"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/35sHyBXl9SbG9hiIL6cnQZ/y8s23-designers-notes",
    "date": "2023-07-06T13:45:00.000Z"
  },
  {
    "id": "5PnOXwp69RWHaeN0EoDmZF",
    "title": "Reputation System Beta: Status Update – July 2023",
    "abstract": "What we’ve done and will be doing with the Reputation System Beta.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6yeNSdaqJdAkWmR18lGy2s/21a89891025bf931733e6a3033437aa0/Reputation.System.Update.960x540.png",
    "content": "## DURING Y8S1\n\n### PLAYER STANDING STABILITY\n\nSince the release of the Reputation System Beta, we've made several shadow updates to not only improve the foundations of the Reputation System, but also the stability of player Standings and this has continued throughout Y8S1.  During Y8S1, we made further changes to ensure that the occurrence and severity of a player's negative actions align with an equally severe impact on a player's Standing. We want players to have confidence in the system, so while adjusting the effects that certain actions have on a player's Reputation Standing, our goal is to make sure that Standings don't change match to match, time after time. As well as this, it's crucial that Standing changes are still happening when warranted and that the presence of the system is felt by abusers.\n\n### ADDITIONAL DETECTIONS\n\nWe are now tracking additional conditions to help increase our knowledge of players' disruptive actions. One such high-impact example of this is a player instigated crashes that are indicative of DDOS attacks. Being able to track a wider range of actions completed by a player such as DDOS, text abuse, leaving matches, and more, has allowed us to build a more robust overview of a player, enabling us to take more appropriate actions to mitigate abuse, and to help foster a more positive experience for all.\n\n### ACTION HISTORY\n\nIn the early days of the Reputation System, we were looking at a limited time period when deciding whether to give a penalty. This was due both to a limitation of the system and a desire to ensure that only the worst of the worst offenders would be receiving penalties. In the time since, the Reputation System has become more robust, and we have seen a great response to reputation penalties. Because of this, we have updated the ranges over which the system checks for negativity. The result of this longer and more dynamic 'memory' of the Reputation System is that the system will be more accurate in delivering penalties to a larger group of offending players and will make bypassing the system more difficult.\n\n## Y8S2 AND ONWARD\n\n### IN-MATCH PENALTY VISUALS\n\nIn Operation Dread Factor, we've made numerous quality of life changes to help players more clearly understand when and what penalties are active and more.\n\n__Y8S2 Updates__\n\n- Activation banner appears on the first round rather than every round\n\n- Active Penalty Banner renamed to Penalties from Warnings\n\n- Active Penalty banner disappears shortly after a round begins\n\n- Active Penalty icons remain for match duration.\n\n- Penalty pop-ups will appear when returning to the main menu. If a pop-up was missed, it will appear after launching the game.\n\n### Looking Forward\n\nAs we move forward with the Reputation System, we will continue to release updates in multiple areas. The Y8S2 update has already brought UI improvements for the reputation penalties and as we progress, we will continue to perform systemwide rebalancing as needed. In Y8S3 we will be introducing several new features that aim to improve players' insight into their Reputation Standing and create new opportunities to interact. We continue to be focused on delivering on our core goal of improving player experience in Rainbow Six Siege.",
    "categories": [
      "rainbow-six-siege",
      "anti-cheat"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5PnOXwp69RWHaeN0EoDmZF/reputation-system-beta-status-update-july-2023",
    "date": "2023-07-05T16:00:00.000Z"
  },
  {
    "id": "3OjUdY5s7KG9atPnXYucXK",
    "title": "Classified: Player Protection Updates - Year 8 and beyond",
    "abstract": "What we're doing to protect players in Year 8 and beyond.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/79kqLiDw3o93uO1X0mia2w/076923d937fb38a67db863b66572fa66/Classified_header_960x540.v2.png",
    "content": "## A YEAR IN REVIEW \n\nOne of the top complaints of PvP shooter players across the entire genre is cheating and toxic behavior. In the space of a single session, one cheater can ruin the experience for hundreds if not thousands of players. Over the last 12 months, Rainbow Six Siege and its Player Protection team have reoriented the way we think and develop features to address this challenge. This has led to the development of two industry-first systems, which we call MouseTrap and QB. These two systems have already had an enormous positive impact on the health of our game. Research and development undertaken has resulted in a suite of current and planned initiatives that are bringing creative and sometimes counter-intuitive solutions to problems that have plagued PvP shooter fans for years. \n\nThis isn't the end of the journey, but the start. Player protection is a never-ending battle and arms race, but our belief on the Siege development team is that this is one of the most important places to innovate --- both as a game, and as an industry. \n\nBelow we will share some of our learnings from these two systems, as well as updates in our Reputation System, and give some insight into how our players are driving our choices and about some of the new initiatives we are working on for the coming year.  \n\nThe Player Protection team on Rainbow Six Siege has worked diligently to address the feedback from our community and ensure transparency along the way. \n\n## RECENT RELEASES \n\n### MouseTrap\n\nMouseTrap has been live for close to 3 months now. This feature launched mid-season with Operation Commanding Force (Y8S1.2 update) on April 11, 2023. We wanted to give you a brief update on how it's going and what we have learned. \n\nMouseTrap is a new detection system which penalizes the use of Mouse and Keyboard on console by adding extra input latency (or lag) to players detected, encouraging them to switch back to using their controller. Our objective is to restore a true balance between competition and skill to improve fair play in Rainbow Six Siege. \n\nWe are very satisfied with MouseTrap's detection capabilities so far. We expected to see a moderate reduction in the number of spoofers at launch with preliminary results estimated at 30% to 50%. However, the data we've gathered has surpassed these expectations and has shown a major reduction in the amount of Mouse and Keyboard users on consoles.  \n\nThere has been a __78% reduction in the total spoofers (Mouse and Keyboard users) detected__ __in Rainbow Six Siege__. If we look at __Ranked on its own, the reduction is similar; 73% fewer spoofers than before__.  \n\n![[R6S] Classified: Player Protection July 2023 - MnKUsageChart](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3gxRRG3kb75iYn7Iqp9vUI/71896ec060ec619b388539672c3c3d60/MnKUsageChart.960x540.png)\n\nWhen first we announced this feature, many were wondering why we chose to penalize Mouse and Keyboard users instead of banning them. We wanted to give these players the chance to change their behavior and play fairly. Today, we are able to confirm that this approach and new system has indeed contributed to a behavioral change: once detected by MouseTrap, many users are returning to their controllers or switching to PC. Our data shows that after a first penalty, 43% of penalized players will continue to play the game without ever getting any further penalties.  \n\nIf you've been hesitant to play Ranked on console before or if you're thinking of returning to the game after some time away, now is the perfect time to give it a try as this means there are fewer Mouse and Keyboard players on console now than at any time in the last few years.  \n\nWe are dedicated to ensuring fairness in Rainbow Six Siege and are aware of current community concerns with MouseTrap. We are currently working to deploy a fix for the reported issue as soon as possible.\n\n### QB\n\nReleased on November 8, 2022, QB is one of our latest PC anti-cheat features which aims to make cheat development more tedious. We've seen great results from this system which has already contributed to the ban of over 10 000 cheaters, and we are only getting started! We've also been made aware that several cheat vendors have stopped creating cheats for Siege following this update and have been getting a lot of positive feedback from our community regarding their in-game experience since the deployment of this feature. We are, however, continuously monitoring this system to identify opportunities for improvement.  \n\n### Reputation Penalties\n\nReducing in-game toxicity has been a major focus for our Player Protection team this year, both in terms of abuse around friendly fire and unwanted communications. Since March 8, 2023, players who engage in voice chat abuse after two warnings receive a penalty and have their voice chat muted to others by default for the next 30 matches. This penalty is complementary to the written chat penalty introduced in the game in Year 7 on October 2022.   \n\nBoth penalties aim to reduce unwanted communication and the impact of offenders by informing these players, via a set of in-game warnings and feedback, of how they are perceived by others for them to change and adapt their behavior before they get sanctioned by the game. The data gathered so far on this feature indicate that the addition of those penalties has indeed contributed to reducing toxicity in Rainbow Six Siege: __half of the players who received a first warning for Voice or Written chat abuse have been dissuaded from continuing to abusing it__.   \n\nThis is also reflected in our first Reputation Penalty around reverse friendly fire, which aims to reduce cases associated with recidivists who injure too many teammates by abusing certain mechanism across several matches. \n\nLooking to Year 9, the Reputation System will continue to evolve. We'll be working to add further sources that we can use to help increase the coverage of the system and ultimately safeguard player safety and enjoyment. \n\n![[R6S] Classified: Player Protection July 2023 - WarningsBarChart.v2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4rTSWrp07KjMSj0mfzJZLL/ac12e01aa3cf9b0894dfcb1d5e439c19/WarningsBarChart.v2.960x540.png)\n\n## COMING UP IN YEAR 8 \n\nWe are committed to ensuring a safe environment and fair experience for all players, many features are currently being developed to reinforce players' protection and will be released throughout Year 8.  \n\n__[New] Player Commendation System -__ The Player Commendation System is a new appreciative system that will be made available in Y8S3 (Autumn 2023). With this feature, we want to reinforce and encourage positivity in our community by allowing players to recognize others at the end of a match based on their experience. \n\n__[Update] Reputation System -__ The Reputation System will get several updates this year. Y8S2 has already brought Reputation Penalty UI improvements and we will continue to support the system with ongoing rebalancing. In both Y8S3 & Y8S4, we will be introducing new features which will help players to better understand their Reputation Standing and while also bringing additional opportunities to interact with this system. \n\n__[New] Privacy Mode on Console -__ Privacy Mode, a feature to help protect streamers and players who are looking for additional privacy in-game was made available on PC last year with Y7S2 Operation Vector Glare and will be coming to console before the end of Year 8.  \n\n__[Update] Ranked Requirements -__ Phone number validation has seen a successful implementation, though our work protecting Ranked continues. During Year 8 & 9, we will be taking the first steps to start a new foundation in safeguarding the competitive integrity of the game. As part of this, we will be bringing multiple new measures which will also aim to address smurfing. Crucially, we'll be reinforcing these foundations with new initiatives throughout Year 9. Not only will this support our current Anti-Cheat efforts, but it will also encourage returning players to rediscover Siege before jumping into competition, therefore improving the ranked experience for all players. More information about this update will be revealed later this year. \n\nStay tuned during the rest of Year 8 and beyond to discover more updates to make Rainbow Six Siege fair and safe for everyone. Follow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) or [Instagram!](https://www.instagram.com/rainbow6game)",
    "categories": [
      "community",
      "anti-cheat",
      "toxicity"
    ],
    "readTime": 8,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3OjUdY5s7KG9atPnXYucXK/classified-player-protection-updates-year-8-and-beyond",
    "date": "2023-07-05T15:50:00.000Z"
  },
  {
    "id": "686r3S9cT83J0K8SUdE0PX",
    "title": "Y8S2.2 Patch Notes",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y8S2.2.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/19gbzG4CGEoGej7pKQ8nxi/18331aa2ff56cf03b8f867a1583127ad/Y8S2.2_PatchNotes.1920x1080.jpg",
    "content": "## Y8S2.2 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 1.32 GB\n- Steam: 0.97 GB\n- Xbox One: 1.19 GB\n- Xbox Series X: 1.53 GB\n- PS4: 1.93 GB\n- PS5: 1.45 GB\n\n## FEATURES\n\n__Defuser Pickup option__\n\nThis new option lets players decide the defuser pickup behavior from these choices:\n\n-   Automatic\n-   Manual\n-   Both (Default setting)\n\n## TWEAKS AND UPDATES\n\n__Playlists__\n\nModified the calculation of Squad matchmaking ratings to ensure fairer matches.\n\n__Player Protection__\n\nSanction messaging in the match feed will no longer mention BattlEye™ and instead use more generic messaging while still listing the sanction reason.\n\n## BUG FIXES\n\n### OPERATORS\n\nFIXED - Small gap on the left side of Mira's Black Mirror when deployed in the center of the reinforced walls.\n\nFIXED - Kali's CSRX 300 has excessive lateral recoil on consoles.\n\nFIXED - Lesion can reinforce walls and put up barricades in the team deathmatch game mode.\n\nFIXED - Fenrir receives additional scoring points each time he redeploys the F-NATT Dread Mine.\n\n### GAMEPLAY\n\nFIXED - In Article 5, matchmaking between Sony and Xbox is possible when players have crossplay matchmaking turned off.\n\nFIXED - Gap can be created after destroying the soft part underneath a reinforcement.\n\nFIXED - Stacking 10 Observation Blocker will block bullets. \n\n### LEVEL DESIGN\n\nFIXED - Exploitable line of sight on stacked supply crates at EXT Garage in Consulate map.\n\nFIXED - Unfair line of sight when using Azami's Kiba Barrier on the door frame in 2F Solarium on Chalet map.\n\nFIXED - Unfair line of sight when using Azami's Kiba Barrier on the door frame in 1F Bar stock on Chalet map.\n\nFIXED - Players can destroy devices on the other side of a reinforced wall by destroying the breakable floor underneath it.\n\n### AUDIO\n\nFIXED - Wrong footsteps SFX if another player is on a different floor.\n\nFIXED - No SFX play when Attacker uses a melee attack on Castle's Armor Panel.\n\nFIXED - Various Audio issues. \n\n### USER EXPERIENCE\n\nFIXED - Toggle for match replay missing from custom games.\n\nFIXED - The Tactical Timeout scoreboard is empty in custom games.\n\nFIXED - Various UI Issues.\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).\n",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/686r3S9cT83J0K8SUdE0PX/y8s22-patch-notes",
    "date": "2023-06-26T23:00:00.000Z"
  }
]