[
  {
    "id": "2SxBNqgTzfj0CTBJhu5D4K",
    "title": "New Rengoku Twitch Drops Start This Week",
    "abstract": "Rengoku is live in Siege X starting July 30, and we’re launching a new set of Twitch Drops for the duration of the event!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/27RXCyLONWF5V1GPrpEOlU/193af430d0b9c46ca863631496885aec/Y10S2_Rengoku_Variant_Fuze_Bundle_960x540.jpg",
    "content": "Rengoku returns to Siege X this week, and you can earn a brand new set of Twitch Drop rewards while the event is live!\n\nStarting at 9AM Pacific / 6PM CEST on July 30, you can unlock a new themed bundle for Fuze by watching select streamers play Rainbow Six Siege X on Twitch! See below for a full breakdown.\n\n### Rewards\n\n- Watch 30 Minutes: Portrait- SCORCHING ZEAL '25\n- Watch 1 Hour: Headgear- SCORCHING ZEAL '25\n\n- Watch 3 Hours: Uniform- SCORCHING ZEAL '25\n- Watch 5 Hours: Weapon Skin- FIRE-TOUCHED '25\n\nThese rewards will be available until 9AM Pacific / 6PM CEST on August 13.\n\nHow Do Twitch Drops Work?\n\nBe sure to follow these steps to make sure you're set up to earn Drops:\n\n- Step 1: Link your Twitch account and Ubisoft account. [Click here to link accounts now](https://drops-register.ubi.com/).\n- Step 2: Watch eligible streams. You'll earn progress toward various items by watching streams for 30 minutes or more. See above for details on how to get each available item.\n\n- Step 3: Claim Your Rewards. When you've earned a Drop, be sure to claim it in your Twitch Inventory. Once complete, your rewards will be waiting for you in-game.\n\nIf you are a streamer and are looking for info on future creator opportunities for Rainbow Six Siege X, be sure to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/).",
    "categories": [
      "community",
      "rainbow-six-siege"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2SxBNqgTzfj0CTBJhu5D4K/new-rengoku-twitch-drops-start-this-week",
    "date": "2025-07-29T16:00:00.000Z"
  },
  {
    "id": "15u8e17UKbO1RDm0lXhfXx",
    "title": "Y10S2.3 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y10S2.3!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6Chwgnr1OB8CRYZ3iWrhrN/2d2063056bc35bec5c19dc1b4c6ccd26/PATCH_NOTES_Y10S2.3_960x540.jpg",
    "content": "See the upcoming changes with the release of Y10S2.3.\n\n## DUAL FRONT\n\n- Added operators: Nokk, Jager, and Aruni.\n- Removed operators: Bandit, Vigil, and Castle.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Cannot rappel on a section of the wall located at B3 Exterior, in Dual Front.\n\nFIXED - Attackers can rappel through the roof on Outback.\n\nFIXED - Players are able to crash ongoing games with Castle's Armor Panel.\n\n### USER EXPERIENCE\n\nFIXED - Some surfaces and hatches on the first floor are not removed in Caster Cam view.\n\nFIXED - Reload UI remains on HUD for the entire round after canceling the reload animation.\n\nFIXED - The Equip and Favorite buttons are missing in the fullscreen victory celebrations view.\n\nFIXED - The entire INSPIRATION elite bundle automatically equips after equipping the elite skin on Mira's Black Mirror gadget during the selection phase.\n\nFIXED - The entire PANZERSTARKE elite bundle automatically equips after equipping the elite skin on Blitz's G52-Tactical Shield during the selection phase.\n\nFIXED - The entire MTG MK.II elite bundle automatically equips after equipping the elite skin on Montagne's Le Roc Shield during the selection phase.\n\nFIXED - Bans from the first phase are not displayed when joining a Custom Pro League Playlist match during the second ban phase.\n\n### AUDIO\n\nFIXED - Sound effects are missing when the 2F Kitchen floor is destroyed by an operator in Dual Front.\n\nFIXED - Sound effects don't play when a drone is destroyed.\n\n---\n\nJoin the discussion on [X](https://twitter.com/Rainbow6Game/), [Instagram](https://www.instagram.com/rainbow6game/), [Reddit](https://www.reddit.com/r/Rainbow6/), [Discord](https://discord.gg/rainbow6), [Facebook](https://www.facebook.com/Rainbow6/), and [TikTok](https://www.tiktok.com/@rainbow6game).\n\nEncountering a bug? Report your experience at [R6Fix](https://r6fix.ubi.com/).",
    "categories": null,
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/15u8e17UKbO1RDm0lXhfXx/y10s23-patch-notes",
    "date": "2025-07-15T09:15:00.000Z"
  },
  {
    "id": "3owjfmZ0uv2zFYU99TpkSw",
    "title": "Y10S2.2 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y10S2.2!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3sJ7TXnIxEOofnb4GgGD0R/eac88d7a9b143e5d3b02bee188ce13b9/PATCH_NOTES_Y10S2.2_960x540.jpg",
    "content": "See the upcoming changes with the release of Y10S2.2.\n\n## DUAL FRONT\n\n- The health of a downed Operator is now 50.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Clash's CCE Shield can stop Dokkaebi's Logic Bomb when equipped.\n\nFIXED - Thermite's Exothermic Charge and the Hard Breach Charge are not destroyed by electricity if they're deployed before electricity is active.\n\nFIXED - Explosives injure Operators through drone vents protected by metal sheets.\n\nFIXED - Operator gets stuck on the window frame after trying to rappel through while an ally is placing a barricade.\n\nFIXED - Passive healing resets after securing an enemy sector in Dual Front.\n\nFIXED - Skopos's Idle Shell blocks players from reinforcing a wall from inside.\n\nFIXED - Rappelling through a window doesn't kill enemy Operators in online Custom Games.\n\n### OPERATORS\n\nFIXED - Clash's leg clips through her CCE Shield while crouched.\n\n### USER EXPERIENCE\n\nFIXED - PlayStation® players receive a free weekend expired error while trying to access Siege X.\n\nFIXED - Tactical map spawn locations during the Planning Phase can't be selected.\n\nFIXED - Climb and Rappel action reminders are present while Clash's CCE Shield is expanded and the taser is active.\n\nFIXED - Wamai's elite Director of Acquisition's badge is displayed in badge list when bundle is unowned.\n\nFIXED - Clash's elite Honor-Bound Shield badge is displayed in badge list when bundle is unowned.\n\nFIXED - The hostage icon appears in the scoreboard for every player that is killed while carrying the hostage.\n\nFIXED - Missing thumbnail for M249 Filigree Blaster weapon skin.\n\nFIXED - Change Operator button in Shooting Range doesn't work.\n\nFIXED - FPS drops to 1 on modernized maps during transition between rounds.\n\nFIXED - Stuttering during gameplay for users with Intel CPUs and Nvidia GPUs.\n\nFIXED - SFX for Valkyrie's paragon Quintessence of Form victory celebration's plays in the background while scrolling through the bundle content in fullscreen view.\n\nFIXED - Level of detail issues in the District map of Dual Front.\n\nFIXED - Lighting issues in the District map of Dual Front.\n\nFIXED - First time booting Siege starts in a borderless window that behaves like fullscreen when the monitor's resolution is higher than 1600x900.\n\nFIXED - Alibi's elite Sophisticated Veneer ability skin has morphing level of detail issues.\n\nFIXED - Play again button for Field Training has a missing graphic in the Play hub.\n\n### AUDIO\n\nFIXED - Motion sensors in 1F Visa Office of Consulate map don't make sound when an Operator passes through them.\n\n---\n\nJoin the discussion on [X](https://twitter.com/Rainbow6Game/), [Instagram](https://www.instagram.com/rainbow6game/), [Reddit](https://www.reddit.com/r/Rainbow6/), [Discord](https://discord.gg/rainbow6), [Facebook](https://www.facebook.com/Rainbow6/), and [TikTok](https://www.tiktok.com/@rainbow6game).\n\nEncountering a bug? Report your experience at [R6Fix](https://r6fix.ubi.com/).",
    "categories": [
      "patch-notes"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3owjfmZ0uv2zFYU99TpkSw/y10s22-patch-notes",
    "date": "2025-07-02T09:15:00.000Z"
  },
  {
    "id": "3RTryzMS8ZmUrBryqsaYAN",
    "title": "New Twitch Drops For Siege X’s Showdown Event",
    "abstract": "Showdown is live in Siege X starting today, and we’re launching a new set of Twitch Drops for the duration of the event!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7lgYs6HlODrWMzKg2x4yR7/d2ec7c7b6b2e09dc999ad1e199b6237e/Y10S2_Glaz_Showdown_Bundle_960x540.jpg",
    "content": "This week Showdown returns to Siege, and we're kicking off a new series of Twitch Drop rewards for the duration of the event! \n\nStarting at 9AM Pacific / 6PM CEST on June 25, you can unlock a new themed bundle for Glaz by watching any streamer playing Rainbow Six Siege X on Twitch! See below for a full breakdown.\n\nRewards\n\n-  Watch 30 Minutes: SALOON VEST '25 Operator Card\n\n-  Watch 1 Hour: HARDEE MONOCLE '25 Headgear\n\n-  Watch 3 Hours: SALOON VEST '25 Uniform\n\n-  Watch 5 Hours: BARTER INTEREST '25 Weapon Skin\n\nThese rewards will be available until 9AM Pacific / 6PM CEST on July 9.\n\nHow Do Twitch Drops Work?\n\nBe sure to follow these steps to make sure you're set up to earn Drops:\n\n-  Step 1: Link your Twitch account and Ubisoft account. Click here to link accounts now.\n\n-  Step 2: Watch eligible streams. You'll earn progress toward various items by watching streams for 30 minutes or more. See above for details on how to get each available item.\n\n-  Step 3: Claim Your Rewards. When you've earned a Drop, be sure to claim it in your Twitch Inventory. Once complete, your rewards will be waiting for you in-game.\n\nIf you are a streamer and are looking for info on future creator opportunities for Rainbow Six Siege X, be sure to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/).",
    "categories": [
      "community"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3RTryzMS8ZmUrBryqsaYAN/new-twitch-drops-for-siege-xs-showdown-event",
    "date": "2025-06-24T16:00:00.000Z"
  },
  {
    "id": "6d9GuIXMWRbgoPQZYdUVip",
    "title": "Y10S2.1 Patch Notes",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y10S2.1.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3eGFEDlIiG5pdiXhhgf8cA/2700049ad02f57061c04ee84c1c1c60b/PATCH_NOTES_Y10S2.1_960x540.jpg",
    "content": "# Y10S2.1 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n- __Ubisoft Connect: 1.53 GB__ \n- __Steam: 1.53 GB__ \n- __Xbox One: 4.9 GB__\n- __Xbox Series X|S: 1.34 GB__\n- __PlayStation®4: 2.24 GB__\n- __PlayStation®5: 1.25 GB__\n\n<br>\n\n# BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Unstable animation hen opening or closing Rauora's D.O.M. Panels.\n\nFIXED - The prompt to enter windows disappears after exiting rappel, preventing completion of the tutorial.\n\nFIXED - Clash appears upside down in all Play hub backgrounds.\n\nFIXED - An incorrect reload animation plays when the player reloads the Golden Gun.\n\nFIXED - Blackbeard's Mk17 scope abruptly tilts left when aiming down sights (ADS).\n\nFIXED - Players don't receive Assist score points when an enemy they pinged is killed by an ally.\n\nFIXED - Hostage's hands are not visible when being escorted in 1<sup>st</sup> person view.\n\nFIXED - Corrupted and distorted textures appear during a Dual Front match.\n\nFIXED - Corrupted map textures appear after being knocked down by Nomad's Airjab ability into the metal fence at A1-2F Bunks Hallway.\n\nFIXED - Graphical glitches occur during a Dual Front match on certain configurations when using Ultra graphics options.\n\n<br>\n\n### USER EXPERIENCE\n\nFIXED - A small box is visible near the Clearance Level.\n\nFIXED - Iana's Solar Raid uniform patches look too dark.\n\nFIXED - The flag on Iana's Collision Point uniform is too dark.\n\nFIXED - The patches on Zofia's, Fuze's, Glaz's and Thatcher's Collision Point uniforms look too dark.\n\nFIXED - Patches and insignias on multiple Operators appear too dark when the Deadly Omen uniform is equipped.\n\nFIXED - The patches and insignias of multiple Operators are too dark while the Demon Veil uniform is equipped.\n\nFIXED - The recharge circle overlaps with the fuel gauge in the Breaching Torch UI.\n\nFIXED - Ying's Augmented Reality headgear appears on the Augmented Reality uniform thumbnail.\n\nFIXED - A message appears while piloting a drone in a newly captured enemy point after the player has died.\n\nFIXED - Azami's default headgear appears overly exposed due to lighting.\n\nFIXED - Patches on multiple Operators appear darker than the rest of their uniforms while wearing the Crystal Guard uniform.\n\nFIXED - Esports championships with invalid dates are incorrectly marked as completed.\n\nFIXED - Placeholder tiers and titles are incorrectly displayed in the Recommended Challenges section in the Play hub.\n\nFIXED - A player's Operator icon appears twice.\n\n<br>\n\n### AUDIO\n\nFIXED - Goyo's Volcan Canister explosion sound effects phase during detonation.\n\n<br>\n\n### BUG REPORTING\n\nIf you encounter any bugs during your gameplay, please report them or add your experiences to existing reports on [R6Fix.](https://r6fix.ubi.com/)",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6d9GuIXMWRbgoPQZYdUVip/y10s21-patch-notes",
    "date": "2025-06-12T09:15:00.000Z"
  },
  {
    "id": "ixjnXu9g80eFVW3X7cNFF",
    "title": "Y10S2.0 PATCH NOTES ADDENDUM",
    "abstract": "Updates and fixes made over the course of the Y10S2 Season Test Server.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3SUXyU2roKG8M93sjoQZnf/54ed03ce8f56d678474c34ee5e667723/PN_Y10S2_960x540.png",
    "content": "\nYou can find here the updates and fixes made over the course of the Y10S2 Season Test Server.\n\nFor the full Operation Daybreak Patch Notes, follow the link below.\n\n[Operation Daybreak Season Patch Notes](https://www.ubisoft.com/en-us/game/rainbow-six/siege/news-updates/seasons/daybreak)\n\n# Y10S2 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect : 51.9 GB - with Ultra HD Textures: 91.53 GB\n- Steam : 32.3 GB - with Ultra HD Textures: 39.1 GB\n- Xbox One : 37.6GB\n- Xbox Series X|S : 57.6 GB\n- PlayStation®4 : 48.63 GB\n- PlayStation®5 : 41.37 GB\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - No access to text chat for console players outside of the US.\n\nFIXED - The AirTEP and helicopter disappear from the player's screen (host or client) when extracting the hostage after a Join-In-Progress (JIP) session.\n\nFIXED - Game server crashes when a player in support mode attempts to deploy a drone immediately after pressing the respawn key.\n\nFIXED - The sabotage kit obstructs player visibility when entering DBNO at the start of sabotage.\n\nFIXED - Ace's S.E.L.M.A. Aqua Breacher can successfully breach electrified walls, bypassing electrical defenses.\n\nFIXED - The pulse animation in the minimap has been removed and now only appears in the headers when the player opens the menu or after dying.\n\nFIXED - Game crashes when Anti Aliasing is set to 4x.\n\nFIXED - Vaulting over a door barricade should result in consistent landing placement, whether or not the player has a shield equipped.\n\nFIXED - If the defuser is planted on a Kiba Barrier, it will be destroyed when that barrier is removed.\n\nFIXED - Enabling AMD FSR 2.0 causes the screen to turn black during gameplay.\n\nFIXED -Playlists are locked after exiting a 6 player squad.\n\nFIXED - A number placeholder briefly appears during the first boot while security measures are being downloaded.\n\nFIXED - The hostage extraction animation will unexpectedly appear during gameplay.\n\nFIXED - Attacking bots can be drawn indoors through combat, causing the remaining bots to stay outside for extended periods.\n\nFIXED - The free look prompt should not be visible while free look mode is active.\n\nFIXED - Player will plant instead of barricading when facing a door or window inside the objective room.\n\nFIXED - The vignette effect that appears during healing is active at the same time the player enter the objective room.\n\nFIXED - Attackers from Team B are not affected by Thatcher's EMP grenades from Team A.\n\nFIXED - The metallic middle bar of a deployed Alibi Prisma does not appear on IQ's electronic detector when viewed from below.\n\nFIXED - Oryx's Remah Dash will destroy the fire extinguishers without activating the smoke and concussion effects.\n\n### USER EXPERIENCE\n\nFIXED - Ram's BU-Gi appears with a placeholder texture in the operator menu.\n\nFIXED - \"Too many squadmates\" error message will appear if the player leaves a custom online lobby.\n\nFIXED - The lobby becomes unresponsive when the lobby owner closes the title.\n\nFIXED - Squad members remain in the After-Action Report (AAR) when the leader exits to the main menu, with the option to bring them along.\n\nFIXED - Player enters DBNO after falling to the ground.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/ixjnXu9g80eFVW3X7cNFF/y10s20-patch-notes-addendum",
    "date": "2025-06-10T21:15:00.000Z"
  },
  {
    "id": "u0TgNGWv5AJtJBMkFHpha",
    "title": "Support Your Favorite Creators With Siege Creator Codes",
    "abstract": "Alongside the launch of Siege X, we are offering a new way for you to support your favorite Siege streamers, video makers, and community leaders!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2d2KExefLYdiWDy6tYrS8C/63e8fef61258ad625a25e1bbeecb23fb/R6x-Siege-540x960.jpg",
    "content": "Alongside the launch of Siege X, we are offering a new way for you to support your favorite Siege streamers, video makers, and community leaders with Rainbow Six Creator Codes!\n\nUse a Creator Code when buying select items in-game, and your favorite creator will receive a commission for each sale. These creator codes are available for select Siege creators, with more to be added over time.\n\nTo use a creator code and support a Siege creator, check out the \"Support a Creator\" section of the in-game shop and enter the code using the Ubisoft Connect overlay. Your selected code will remain active for 14 days, and any purchase you make from the \"Support a Creator\" store section will directly support your preferred Siege partner!\n\nIf you're a creator and want to be considered for a Siege creator code, be sure to [apply to the Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/).",
    "categories": [
      "rainbow-six-siege",
      "community"
    ],
    "readTime": 1,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/u0TgNGWv5AJtJBMkFHpha/support-your-favorite-creators-with-siege-creator-codes",
    "date": "2025-06-10T14:15:00.000Z"
  },
  {
    "id": "3JOtomdNqBdS4SXQOWO0DJ",
    "title": "Siege X Twitch Drops And TikTok Game Rewards Start June 10",
    "abstract": "Get in-game bonuses by watching live Siege X gameplay on Twitch and TikTok!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3vkD8q7CiAMYmnAi3723RI/2bf38ceda723603c0a3125492ebd4a4a/R6TwitchDrops.jpg",
    "content": "A new era for Siege begins when Siege X launches tomorrow, June 10, and to celebrate we're offering limited-time in-game rewards on both Twitch and TikTok!\n\n# Twitch Drops\n\nStarting at 9AM Pacific / 6PM CEST on June 10, you can unlock the __Dokkaebi Community Bundle__ by watching select partner streams on Twitch! See below for a full breakdown.\n\n## Rewards\n\n- Watch 30 Minutes: *SUISUI Weapon Charm*\n\n- Watch 2 Hours: *SUISUI Mk 14 EBR Weapon Skin*\n\n- Watch 4 Hours: *SUISUI Uniform*\n\n- Watch 6 Hours: *SUISUI Headgear*\n\nThese rewards will be available until 9AM Pacific / 6PM CEST on June 16.\n\nHow Do Twitch Drops Work?\n\nBe sure to follow these steps to make sure you're set up to earn Drops:\n\n- Step 1: Link your Twitch account and Ubisoft account. [Click here to link accounts now](https://drops-register.ubi.com/).\n\n- Step 2: Watch eligible streams. You'll earn progress toward various items by watching streams for 60 minutes or more. See above for details on how to get each available item.\n\n- Step 3: Claim Your Rewards. When you've earned a Drop, be sure to claim it in your Twitch Inventory. Once complete, your rewards will be waiting for you in-game.\n\n# TikTok Game Rewards\n\nAlso kicking off at 9AM Pacific / 6PM CEST on June 10 is the Siege X TikTok Game Reward offer, allowing you to earn 5 Alpha Packs by watching live gameplay from select creators streaming Siege X.\n\n## Rewards\n\n- Watch 3 minutes: *5x Alpha Packs*\n\n## How Do TikTok Game Rewards Work?\n\n- Step 1: Watch a participating TikTok creator livestreaming Siege X gameplay. Participating channels will display a \"Game Rewards\" tag in the top-right corner of the stream.\n\n- Step 2: After 3 minutes of watch time, Click the Share arrow in the lower-right and select the Game Rewards icon to view and claim the reward.\n\n- Step 3: You will receive a code for your reward that you can redeem through this website: [https://redeem.ubisoft.com/rainbow6-siege](https://redeem.ubisoft.com/rainbow6-siege/). You must log in with your Ubisoft account (or create a new one) to enter the code. After redeeming the code to your Ubisoft account, the items can be found in your in-game inventory.\n\nTikTok Game Rewards will be available until July 9, 2025.\n\nIf you are a streamer and are looking to participate in future creator opportunities on Rainbow Six Siege, be sure to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/).",
    "categories": [
      "rainbow-six-siege",
      "community"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3JOtomdNqBdS4SXQOWO0DJ/siege-x-twitch-drops-and-tiktok-game-rewards-start-june-10",
    "date": "2025-06-09T08:00:00.000Z"
  },
  {
    "id": "1YokhAiCfRVETGqqtb4ZFp",
    "title": "Y10S2 Streamer Charm",
    "abstract": "New Rainbow Six Siege Streamer Charm for Y10S2!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7uepKcQP6sVlbKDrRBvjZl/edee5443b8fe0e39ed1d2ce768f6ac68/Y10S2_STREAMER_CHARM__NEW_960x540.png",
    "content": "# New Rainbow Six Siege Streamer Charms for Y10S2!\n\n## Announcing the next Streamer Charm!\n\nEach season will bring the release one new charm, as well as the return of streamer charms from previous seasons! Check out this season's newest charm recipient below, and read on for further updates on the Streamer Charm program.\n\n## New\n\n![[R6S] Y10S2 Streamer Charm 00](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7uepKcQP6sVlbKDrRBvjZl/edee5443b8fe0e39ed1d2ce768f6ac68/Y10S2_STREAMER_CHARM__NEW_960x540.png)\n\n[Ooziie](https://www.twitch.tv/oozie)\n\n## Returning\n\n![[R6S] Y10S2 Streamer Charm - Y10S2 STREAMER CHARMS 960x540](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1OCybC36XW8JEvsbzudCRa/a2629625cb4f2e978255ebbab611adb8/Y10S2_STREAMER_CHARMS_960x540.png)\n\n![[R6S] Y10S2 Streamer Charm - Y10S2 STREAMER CHARMS 960x540 2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1TZnTOGg7PkLGZd15Mmm35/018fac1c3a8a47bb2e2c5d90cac177f0/Y10S2_STREAMER_CHARMS_960x540_2.png)\n\n![[R6S] Y10S2 Streamer Charm - Y10S2 STREAMER CHARMS 960x540 3](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1vHnNHXovDrGmnj2YY48bQ/d366bd11accd7d5109b98fe5ad14937e/Y10S2_STREAMER_CHARMS_960x540_3.png)\n\n![[R6S] Y10S2 Streamer Charm - Y10S2 STREAMER CHARMS 960x540 5](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4EbQ2sjnTOFM9tni2PovEq/7b7ec3d9fa8d1748555841912fca533f/Y10S2_STREAMER_CHARMS_960x540_5.png)\n\n![[R6S] Y10S2 Streamer Charm - Y10S2 STREAMER CHARMS 960x540 6](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1CbNHMjAheXEiVkLnM9HWe/b088ff275df6b440239e624e4e1535ff/Y10S2_STREAMER_CHARMS_960x540_6.png)\n\n![[R6S] Y10S2 Streamer Charm - Y10S2 STREAMER CHARMS 960x540 4](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/414J5evXp1O1grOVIe6vxY/00eb0dee0d3224852bcedbec033fdada/Y10S2_STREAMER_CHARMS_960x540_4.png)\n\n![[R6S] Y10S2 Streamer Charm - Y10S2 STREAMER CHARMS 960x540 7](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2eMS7RsjcJZhpZB2Op0BeN/ccbf191bfe8113534a3e2159661069f7/Y10S2_STREAMER_CHARMS_960x540_7.png)\n\n[Alfredoplays\\\n](https://www.twitch.tv/alfredoplays)[AnneMunition\\\n](https://www.twitch.tv/annemunition)[Beaulo\\\n](https://www.twitch.tv/beaulo)[Bighead\\\n](https://www.twitch.tv/bighead033)[BikiniBodhi\\\n](https://www.twitch.tv/bikinibodhi)[Bnans\\\n](https://www.twitch.tv/bnans)[Braction\\\n](https://www.twitch.tv/bractionfps)[Drid\\\n](https://www.twitch.tv/dridgg)[FastAnne\\\n](https://www.twitch.tv/fastanne)[Gabbo\\\n](https://www.twitch.tv/JustGabbo)[Heideltraut\\\n](https://www.twitch.tv/heideltraut)[Interro\\\n](https://www.twitch.tv/interro)[JerichoFive\\\n](https://www.twitch.tv/jerichofive)[JessGOAT\\\n](https://www.twitch.tv/jessgoat)[Jynxzi\\\n](https://www.twitch.tv/jynxzi)[Just9n\\\n](https://www.twitch.tv/just9n)[KingGeorge\\\n](https://www.twitch.tv/KingGeorge)[KittyR6\\\n](https://www.twitch.tv/kitty_r6)[LagonisR6\\\n](https://www.twitch.tv/lagonis)[Lil_Lexi\\\n](https://www.twitch.tv/lil_lexi)[Lt Custard\\\n](https://www.twitch.tv/lt_custard)[Lusorkoeffizient\\\n](https://www.twitch.tv/lusorkoeffizient)[MacieJay\\\n](https://www.twitch.tv/MacieJay)[Mag6\\\n](https://www.twitch.tv/mag6)[M3ry\\\n](https://www.twitch.tv/m3ry)[Matimi0\\\n](https://www.twitch.tv/matimi0)[MrBboy45\\\n](https://www.twitch.tv/mrbboy45)[Narcoleptic Nugget\\\n](https://www.twitch.tv/narcolepticnugget)[Nesk\\\n](https://www.twitch.tv/neskwga)[PaladinAmber\\\n](https://www.twitch.tv/paladinamber)[Patife\\\n](https://www.twitch.tv/patife)[Pengu\\\n](https://www.twitch.tv/pengu)[RazaH\\\n](https://www.twitch.tv/razah)[REMGURI / 렘쨩\\\n](https://www.twitch.tv/remguri)[Rubsarb\\\n](https://www.twitch.tv/Rubsarb/)[SexyCake\\\n](https://www.twitch.tv/smexycake)[Sha77e\\\n](https://www.twitch.tv/sha77etv)[Shorty\\\n](https://www.twitch.tv/shortyyguy)[shroud\\\n](https://www.twitch.tv/shroud)[SilphTV\\\n](https://www.twitch.tv/silphtv)[Tatted\\\n](https://www.twitch.tv/tatted)[Tranth\\\n](https://www.twitch.tv/tranth)[Varsity\\\n](https://www.twitch.tv/varsitygaming)[WhiteShark67\\\n](https://www.twitch.tv/whiteshark67)[yo_boy_roy\\\n](https://www.twitch.tv/yo_boy_roy)[z1ronic\\\n](https://www.twitch.tv/zironicdk)[Zander\\\n](https://www.twitch.tv/zander)[ziGueira\\\n](https://www.twitch.tv/zigueira)[GarfieldIsDoc\\\n](https://www.twitch.tv/garfield)[Supr\\\n](https://www.twitch.tv/supr)[RyyFyy\\\n](https://www.twitch.tv/ryyfyy)[FoxA\\\n](https://www.twitch.tv/foxa_r6)[Nerdengenheiro\\\n](https://www.twitch.tv/nerdengenheiro)[Rainbow6itacom\\\n](https://www.twitch.tv/rainbow6itacom)[Minimichegga\\\n](https://www.twitch.tv/minimichegga)[JostRekt\\\n](https://www.twitch.tv/jost)[JustRyuk\\\n](https://www.twitch.tv/justryuk)[Paluhh\\\n](https://www.twitch.tv/paluhh)[Poxonlox\\\n](https://www.twitch.tv/poxonlox)[TheLionerYT\\\n](https://www.twitch.tv/thelioneryt)[itsSpoit\\\n](https://www.twitch.tv/itsspoit)[Retalha\\\n](https://www.twitch.tv/retalha)[FooYa\\\n](https://www.twitch.tv/fooya)[IceCold\\\n](https://www.twitch.tv/icecold)[Athieno\\\n](https://www.twitch.tv/athieno)[Marciu\\\n](https://www.twitch.tv/marciu)\\\n[Rembeey](https://www.twitch.tv/reembey)\\\n[rasco100](https://www.twitch.tv/rasco100)\\\n[Vetelcito01](https://www.twitch.tv/vetelcito01)\\\n[OneShooter](https://www.twitch.tv/oneshooter)\\\n[Scythe](https://www.twitch.tv/scythe)\\\n[Jenz](https://www.twitch.tv/jenz)\\\n[Frankystrings](https://www.twitch.tv/frankystrings)\\\n[Eternal_regina](https://www.twitch.tv/eternal_regina)\\\n[Pxppy](https://www.twitch.tv/eternal_regina)\\\n[Skyte](https://www.twitch.tv/skyte)\\\n[Ru_rumiiiin](https://www.twitch.tv/ru_rumiiiin)\\\n[Anifex](https://www.twitch.tv/anifex)\\\n[Vetelcito](https://www.twitch.tv/vetelcito01)\\\n[Priest](https://www.twitch.tv/omgitspriest)\\\n[Nonomiyamika](https://www.twitch.tv/nonomiyamika)\\\n[alyttleton](https://www.twitch.tv/alyttleton)\\\n[MeatyMarley](https://www.twitch.tv/meatymarley)\\\n[ThatOneBritt](https://www.twitch.tv/thatonebritt)\\\n[TitaniumRolo](https://www.twitch.tv/titaniumrolo)\\\n[KeTo](https://www.twitch.tv/keto)\n\n## Streamer Charm Program Update\n\nIn Year 10, we are bringing some changes to the Streamer Charm program by moving to __one__ exclusive new creator charm per season.\n\nOur goal with this adjustment is to introduce a brand new seasonal charm later this year that will be available to even more creators.\n\nAs part of this program update, we are also refining our selection criteria; in addition to recognizing established creators, we'll be highlighting up-and-coming talent in the Siege community. These fresh new faces are chosen for their promising future in the Siege space.\n\nStay tuned! We will be revealing more details on this new seasonal charm and associated criteria toward the end of the first season.\n\n## Screening Procedure\n\nWe have implemented additional screening procedures into our selection process for streamer charms.\n\nUpon selection for the program, streamer charm candidates' main and alt accounts are now screened for MouseTrap violations, gameplay violations, and histories of toxicty, in addition to the other screening steps they undergo for eligibility.\n\n## How to acquire charms\n\nThese charms are only available by subscribing to the respective streamer's Twitch channel with a linked Ubisoft account. For more information on how to link your Ubisoft and Twitch account, as well as opt in for Twitch Drops, please refer to [this FAQ](https://support.ubi.com/Faqs/000035432/Get-your-Twitch-Streamer-s-charm).\n\n## How to get involved\n\nWe have updated the Ubisoft Creators Program registration to open the program to TikTok and Instagram, therefore opening new collaboration opportunities for content creators, streamers, fan artists, and cosplayers from our community.\n\nWe are always on the lookout for content creators that inspire and enrich the Siege community. If you would like access to the perks of being a partnered content creator, and your goal is to one day have a charm in the game, we would like to invite you to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/en-us).\n\nFrom there, complete the following steps:\n\n1. Connect your Ubisoft Account. If you do not have one, you can create one [here](https://connect.ubisoft.com/create).\n\n2. Agree upon the eligibility criteria.\n\n3. Connect your primary channel (Twitch, YouTube, TikTok, Instagram) or secondary channels.\n\n4. Indicate your games preferences.\n\n5. Set your location, broadcast language, and communication language.\n\nYour application will then be submitted and must be approved by Ubisoft. An email will be sent to confirm your participation.",
    "categories": [
      "rainbow-six-siege",
      "community"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1YokhAiCfRVETGqqtb4ZFp/y10s2-streamer-charm",
    "date": "2025-06-06T16:00:00.000Z"
  },
  {
    "id": "4phLHZp5jpjxrTmuniLXm",
    "title": "R6 SIEGE X LAUNCH : ALL YOU NEED TO KNOW",
    "abstract": "Get ready Operators ! R6 Siege X is launching on June 10 on all platforms. Find out more about the maintenance time and everything you need to keep in mind for the launch.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4hqwufipWXRS5RMKHtQO2s/0cb354fb5449175b1b7630a79f620118/R6X-maintenance-map-timing.jpg",
    "content": "Get ready Operators ! R6 Siege X is launching on __June 10 on all platforms__. Find out more about the maintenance time and everything you need to keep in mind for the launch.\n\n# WHEN IS R6 SIEGE X LAUNCHING\n\nThe R6 SIEGE X major evolution will launch at the same time as Season 2 - Operation Daybreak on June 10, 2025.\n\n__Maintenance Start Time__ : 07:00am PDT / 10:00am EDT / 03:00pm BST / 16:00 CEST / 17:00 AST / 22:00 CST / 23:00 JST / 12:00am (June 11) AEST\n\n__Estimated Maintenance Duration__ : 90min\n\n![[R6S] NEWS - R6 SIEGE X LAUNCH : ALL YOU NEED TO KNOW - R6X-maintenance-map-timing](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4k20zThnYWcJ6OhEy8wkjZ/f2052baafdece01eed634edbce4d4a35/R6X-maintenance-map-timing.jpg)\n\n# R6 SIEGE X AVAILABILITY\n\nR6 Siege X is available on PlayStation 5, PlayStation 4*, Xbox Series X|S, Xbox One*, Ubisoft Connect, Epic Games Store and Steam on Windows PC, as well as on Ubisoft+.\n\n*The Dual Front game mode is not supported on PlayStation 4 and Xbox One.\n\n# PROGRESSION AND INVENTORY CARRY-OVER\n\nPlayers who have bought and played the game before the launch of R6 Siege X on June 10 will keep their current progression, inventory and operators.\n\nYou will also receive Veteran Rewards to thank you for your involvement with the game. The longer you’ve been playing, the more rewards you’ll get !\n\nYou simply need to launch the game starting June 10. Veteran Rewards and the badge will automatically be added to your inventory.\n\n# PC SPECS\n\n__Minimum__ :\n\n- Resolution: 1080p\n\n- Frame Rate: 60 FPS\n\n- CPU: AMD Ryzen3 3100, Intel i3 8100\n\n- GPU: NVIDIA GTX 1650 4GB, AMD RX 5500XT 4GB, INTEL ARC A380 6GB\n\n- Ram: 8GB\n\n- OS: Windows 10/11, DirectX 12\n\n- Storage: 65 GB SSD\n\n__Recommended High__ :\n\n- Resolution 1080p\n\n    - Frame Rate: 120 FPS (Core Siege), 60 FPS (Dual Front)\n\n    - CPU: AMD Ryzen5 3600, Intel i5 10400\n\n    - GPU: NVIDIA RTX 2060 6GB, AMD RX 6600 8GB, Intel ARC A750 8GB\n\n    - Ram: 16 GB\n\n    - OS: Windows 11, DirectX 12\n\n    - Storage: 65 GB SSD\n\n- Resolution 1440p\n\n    - Frame Rate: 120 FPS (Core Siege), 60 FPS (Dual Front)\n\n    - CPU: AMD Ryzen5 3600, Intel i5 10400\n\n    - GPU: NVIDIA RTX 3070 8GB, AMD RX 6600 8GB, Intel ARC B580 12GB\n\n    - Ram: 16 GB\n\n    - OS: Windows 11, DirectX 12\n\n    - Storage: 65 GB SSD\n\n- Resolution 2160p\n\n    - Frame Rate: 120 FPS (Core Siege), 60 FPS (Dual Front)\n\n    - CPU: AMD Ryzen5 3600, Intel i5 10400\n\n    - GPU: NVIDIA RTX 3080 10 GB, AMD RX 6800 XT 16 GB\n\n    - Ram: 16 GB\n\n    - OS: Windows 11, DirectX 12\n\n    - Storage: 65 GB SSD\n\n__Recommended Ultra__ :\n\n- Resolution: 2160p\n\n- Frame Rate: 120 FPS\n\n- CPU: AMD Ryzen5 5600X, Intel i5-11600K\n\n- GPU: NVIDIA RTX 4070 Ti Super 16GB, AMD RTX 7900 XT 20GB\n\n- Ram: 16 GB\n\n- OS: Windows 11, DirectX 12\n\n- Storage: 110 GB SSD\n\n![[R6S] NEWS - R6 SIEGE X LAUNCH : ALL YOU NEED TO KNOW - R6X-pc-specs](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/61isAU7TUHVxvRbTdiQOyj/e4584c8fa4e9777e11b7aa2ce7544f38/R6X-pc-specs.jpg)\n\n# CONSOLE SPECS\n\n## PlayStation 5\n\n- __Performance__\n\n  - Resolution: 2160p\n\n  - Target Performance: 120 FPS (Core Siege), 60 FPS (Dual Front)\n\n- __Quality__\n\n  - Resolution: 2160p\n\n  - Target Performance: 60 FPS\n\n## PlayStation 5 Pro\n\n- __Performance__\n\n  - Resolution: 2160p\n\n  - Target Performance: 120 FPS (Core Siege), 60 FPS (Dual Front)\n\n- __Quality__\n\n  - Resolution: 2160p\n\n  - Target Performance: 60 FPS\n\n![[R6S] NEWS - R6 SIEGE X LAUNCH : ALL YOU NEED TO KNOW - R6X-playstation-specs](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7Mu1MTcPeOzqovDvUu4X32/779c3c51fe80cc1297e044aedc80aea4/R6X-playstation-specs.jpg)\n\n## Xbox Series S\n\n- __Performance__\n\n  - Resolution: 1080p\n\n  - Target Performance: 120 FPS (Core Siege), 60 FPS (Dual Front)\n\n- __Quality__\n\n  - Resolution: 1728p\n\n  - Target Performance: 60 FPS\n\n## Xbox Series X\n\n- __Performance__\n\n  - Resolution: 2160p\n\n  - Target Performance: 120 FPS (Core Siege), 60 FPS (Dual Front)\n\n- __Quality__\n\n  - Resolution: 2160p\n\n  - Target Performance: 60 FPS\n\n![[R6S] NEWS - R6 SIEGE X LAUNCH : ALL YOU NEED TO KNOW - R6X-xbox-specs](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/GOIiTJGXaLBQVWgxblh47/3c9ddb305ed7e3f2cff6056fae03135f/R6X-xbox-specs.jpg)\n\n# R6 SIEGE X - PATCH SIZES\n\n- __Ubisoft Connect :__ 51.9 GB - with Ultra HD Textures: 91.53 GB\n\n- __Steam :__ 51.9 GB - with Ultra HD Textures: 39.1 GB\n\n- __Xbox One__ : 37.6GB\n\n- __Xbox Series X|S__ : 57.6 GB\n\n- __PlayStation 4__ : 48.63 GB\n\n- __PlayStation 5__ : 41.37 GB",
    "categories": [
      "rainbow-six-siege",
      "game-updates"
    ],
    "readTime": 5,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/4phLHZp5jpjxrTmuniLXm/r6-siege-x-launch-all-you-need-to-know",
    "date": "2025-06-04T08:00:00.000Z"
  },
  {
    "id": "8dJbwMqIt5Y8lZgwJRjWZ",
    "title": "Y10S2 Designer's Notes",
    "abstract": "In this latest edition of Designer’s Notes, we'll go into more detail about the balancing changes that’ll come with the Y10S2 update and give you some insight into the reasons behind them.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1mM91jxIs6gXuARJzjTgwf/5f3255c76bf05471fdc92c17528513b3/R6S_Y10S2_DN_Header_960x540.jpg",
    "content": "\nIn this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y10S2 update and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n## WIN DELTA VS. PRESENCE\n\n![[R6S] Y10S2 Designer's Notes - R6S DN Y10S2 BalancingMatrix Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/JqZoi7CyFOADTRwSypySj/6229a39300e1448b2f1cfda754b3535f/R6S_DN_Y10S2_BalancingMatrix_Att.mp4)\n\n![[R6S] Y10S2 Designer's Notes - R6S DN Y10S2 BalancingMatrix DEF](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7ACqWwNzkNHOZGHtN8885B/42814b4042d422e3ce5343609fce6637/R6S_DN_Y10S2_BalancingMatrix_DEF.mp4)\n\n## OPERATOR BAN RATE\n\n![[R6S] Y10S2 Designer's Notes - R6S DN Y10S2 BanMatrix Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/Dnqq5jMWPgGjdJWpvP8OI/b0ff81f4949995937cd71cf8546b5e90/R6S_DN_Y10S2_BanMatrix_Att.mp4)\n\n![[R6S] Y10S2 Designer's Notes - R6S DN Y10S2 BanMatrix DEF](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/V3XExo83LWMojYYt6nQRn/ba181d7537a9fd675b8592ffd0a814e9/R6S_DN_Y10S2_BanMatrix_DEF.mp4)\n\n## OPERATOR BALANCING\n\n* * * * *\n\n## BLACKBEARD\n\nWe've been closely monitoring Blackbeard since the Y9S4 release, and we would like to share some details about his performance. One of our concerns with Blackbeard on release was to deliver a Shield Operator with good offensive capabilities but without being the deadliest Operator in town. After the remaster, Blackbeard's Kill Death Ratio has dropped around 25% to 0.9. This makes him sit slightly higher than Blitz at 0.8, meaning both shield Operators sit in the low bracket for Attackers' K/D.\n\nAnother important metric to consider is his impact in the team's success and compositions. He is a popular operator, but is average when it comes to win rate. His ban rate has been rising since release, being higher on PC than on Console.\n\nWe are not releasing any substantial change for Blackbeard this season, but we will update his shield with some quality of life changes. This decision is based on the shared data analysis and the fact that a new Ban System is releasing this season; we want to see how his ban rate adapts to the new system before we take any action.\n\nIn this update we've added a tinted layer to the outside of the glass that should help Blackbeard's enemies to read faster and from farther if he is aiming down sight or not. We've also improved the glass movement audio to make it easier to hear if Blackbeard is aiming down sight or not.\n\nWe will keep a close eye on Blackbeard's performance and his adaptation to the new Ban System and prepare future changes if needed.\n\n### H.U.L.L. ADAPTABLE SHIELD\n\n- Added tint to outside glass\n- Made improvements to glass audio\n\n## CLASH\n\nClash's shield and taser combination can be quite frustrating to play against. Her ability to damage enemies while being heavily protected makes her difficult to challenge, especially since the taser also slows you down and the main counter is at melee range. Additionally, playing as Clash is not particularly engaging for many players, as her current mechanics do not offer a satisfying or interesting gaming experience.\n\nWe have focused on three main pillars with this update:\n\n- __Enhanced Movement__: We are giving her more freedom of movement with her shield. She won't require any special site setup to move around while still being protected. The shield will dynamically adapt to her needs, making her more versatile and agile.\n\n- __Shield as a Gadget__: Clash will be able to anchor her shield on the ground, allowing her to play around it without needing to rely on allies. This change provides her with more independence and flexibility in positioning. She can still use the taser against enemies facing the deployed shield, so she can slow down enemies on one side while managing another angle or capitalizing on the effect by herself. This adds a strategic layer, enabling her to control multiple areas simultaneously and offer support to her team without having to be in the frontline.\n\n- __Fairness__: The taser will no longer deal damage, ensuring that Clash cannot kill an enemy while being fully protected by the shield. This aligns her more closely with other Ballistic Shields, maintaining the principle that you cannot be lethal if you cannot receive lethal damage. The intensity of the slowdown effect will also vary based on the enemy's movement direction. Enemies running away from Clash will experience less slowdown, preventing Clash from punishing attackers that don't want to face her.\n\nOverall, these adjustments will make Clash a more engaging and interactive operator, enhancing her role as a versatile support player who can control key areas and disrupt enemy strategies. We believe the new Clash will be more enjoyable to play, both as and against her.\n\n### BASE STATS\n\n- __Movement:__ Can sprint, crouch, vault, and dash through barricades, but the shield will collapse automatically while performing those actions.\n\n- __Free Look:__ Is available while having the shield equipped.\n\n### CCE SHIELD MK2\n\n- __Deploy:__ The CCE Shield MK2 can be deployed. Can be picked up again.\n\n- __Vulnerabilities when deployed:__\n  - The shield can be destroyed with explosives.\n  - Anyone can bash through the shield to destroy it.\n  - The Taser Battery can be destroyed by a Kludge Drone. The shield will stay intact, but the Taser cannot be used anymore.\n\n### TASER\n\n- __Activation:__ Can be toggled on and off using the Switch Ability Button. When the shield is not equipped Clash will use a Remote Controller to do so.\n\n- __Electricity:__ Doesn't deal damage.\n\n- __Slowdown:__ The intensity depends on the movement direction (stronger towards Clash).\n\n- __Battery:__ Increased to 10 seconds (from 5).\n\n- __Area:__ Wider area of effect (Changed from a box to a cone).\n\n### LOADOUT\n\n- __Gadgets:__ Removed Deployable Shield.\n\n## SLEDGE\n\nSledge will be able to disrupt enemies equipped with a Ballistic Shield by knocking them back with his Hammer. This will remove their protection and expose them, providing an opportunity for him or his teammates to take them down.\n\nHe will become a real menace for Clash, as he can use the Impact EMP Grenade to shut down her taser, allowing him to close the gap faster and hit her with the Hammer.\n\n### BREACHING HAMMER\n\n- __Ballistic Shields:__ Hitting a Ballistic Shield will knock back the operator.\n\n## JACKAL\n\nWe believe that the most frustrating aspect of Jackal's ability is the time he can keep you pinged with relatively low effort. Scanning a hottest/red set of footprints, even though sometimes dangerous, allows him to track the enemy for almost half a minute without putting in any additional effort or being in any kind of danger. To address this issue, we have decided to reduce the outcome of a scan to always result in a single ping. This means that scanning a set of footprints will give you the precise position of the enemy, but it will last as long as a regular red ping. Keep in mind that the scanned set will be erased when the scan is completed, so Jackal will be trading precise location for the ability to actively track the target until he reaches its last known location.\n\nHowever, we want to enhance his ability to actively track targets, as we believe this is his real strength and the one that better balances the risk and reward. Therefore, we have increased the duration of the coldest/blue footprints. These prints will now be between 60-120 seconds old, so they do not provide a lot of information but will help him to get on track faster. Remember that footprints are not generated during the Preparation Phase, so defenders are free to move around and prepare the site for the assault without being punished. Even if a defender is late returning to the site and gets scanned, they will only get pinged once, and all their footprints will be deleted from the map.\n\nWe will monitor this change very closely and make adjustments if needed.\n\n### EYENOX MODEL III\n\n- __Resources:__ Increased to 5 (from 3).\n\n### HUNTER MARK\n\n- __Pings:__ Reduced to always 1 (from 2-5).\n\n- __Debuff:__ Removed.\n\n### FOOTPRINTS\n\n- __Coldest (blue):__ Duration increased to 120 seconds (from 90).\n\n## JAGER\n\nBoth Jager and Wamai serve the same role in denying projectiles, but their different methods should ideally compliment various strategies and playstyles. Feeling forced to choose one over the other based on the specific projectiles you expect to face, rather than on your overall strategy, doesn't seem correct. Therefore, we are normalizing the list of interactions so that both detect the same projectiles.\n\nFurthermore, this rule made the game more complicated to understand for newcomers, as they needed to learn specific interactions between operators instead of a generic rule. This approach is more sustainable in the long run and makes the game more user-friendly.\n\n### ACTIVE DEFENSE SYSTEM\n\n- Capitao's Incendiary and Micro Smoke Bolts are detected and destroyed.\n\n- Gridlock's Trax Stingers are detected and destroyed.\n\n## THUNDERBIRD\n\nDespite the recent enhancements to the Kóna Stations, the potential risk of enemies exploiting them outweighs the benefits they provide, limiting their viable placements and situations where they should be most helpful. Therefore, the Kóna Station will no longer target enemies.\n\n### KONA STATION\n\n- __Targeting system:__ Only heals allies.\n\n## BRAVA\n\nDue to the new changes to Thunderbird, the Kludge Drone will no longer overheat a Kóna Station. Instead, its alliance will shift to target attackers rather than defenders, making it a valuable asset to your team.\n\n### KLUDGE DRONE\n\n- __Kóna Station:__ Hacking it changes the alliance (instead of overheating).\n\n## ELA\n\nThere was a mismatch between the detection area and the area of effect of Ela's Grzmot Mine, which could lead to confusion during gameplay. The area displayed when deploying the mine was smaller than its actual effect. This discrepancy could cause Ela to mistakenly believe she had the advantage when someone triggered the mine, only to find herself affected along with her victim. By aligning both values, we aim to enable Ela to better leverage her positioning around the mines and avoid unintended consequences.\n\nWe have decided to reduce the concussion range instead of increasing the area of detection because Ela is currently placing them according to the detection area, which seems sufficient to fulfill her playstyle. Doing it the other way around would be detrimental for her, as the Scorpion EVO 3 A1 and the FO-12 are both more effective in short-range engagements.\n\n### GRZMOT MINE\n\n- __Concussion range:__ Reduced to 4 meters (from 7).\n\n## ZOFIA\n\nSimilar to Ela, there was a discrepancy between the detection area and the area of effect. Although the issue is not identical, we have decided to normalize it as well. This adjustment ensures that the Concussion Grenade is more accurate and affects the intended target rather than everyone in the room. This change addresses the discomfort among teammates, as any ally attempting to synchronize with Zofia to take down a target was most likely affected by the grenade as unintended collateral.\n\n### KS79 LIFELINE\n\n- __Concussion detection range:__ Reduced to 4 meters (from 5).\n\n- __Concussion range:__ Reduced to 4.25 meters (from 7).\n\n# SYSTEM BALANCING\n\n* * * * *\n\n## ELECTRICITY\n\nWith this update, we are making electricity a neutral element, ensuring that all gadgets and Operators in the match are vulnerable to electricity, regardless of their team alliance. This change is accompanied by improvements designed to make interactions with electricity clearer and more forgiving for players.\n\nElectricity will no longer cause damage to players. Instead, Operators will experience a reduction in movement speed. We have also reviewed how Operators get electrified. Now, Operators must intentionally interact with electrified gadgets to get zapped. Walking on electrified surfaces will electrify Operators, but merely being close to an electrified wall will not. Operators need to interact with the wall by deploying or vaulting it to become electrified.\n\nElectricity will still destroy Electronic gadgets, but Defender gadgets will no longer be invulnerable. This change requires Defenders to exercise more caution, especially when throwing gadgets through small holes on electrified reinforcements or operating moving drones like Echo's Yokai.\n\n### ELECTRICITY EFFECT\n\n- Damage to Operators removed from Electricity Effect.\n- Slowdown to Operators added to Electricity Effect.\n- Electricity is now neutral and affects equally every team.\n\n### OPERATORS AFFECTED\n\n- Bandit\n- Kaid\n\n## LIMB DAMAGE\n\nBy reducing the damage to limbs, we aim to emphasize skillful gameplay. We encourage players to target more critical areas like the head or torso, which demands greater precision. This approach makes the gameplay more challenging and rewarding. Additionally, it enhances tactical depth, as players will need to carefully consider their positioning and aiming before taking the first shot to ensure a successful elimination. This change promotes more thoughtful and strategic gameplay, preventing players from being easily eliminated by a few shots to the arms or legs.\n\n### DAMAGE MODIFIERS\n\n- Reduced damage inflicted by Handguns:\n    - 50% by Small calibers (e.g. USP40).\n    - 50% by Medium caliber (e.g. M45 MEUSOC).\n    - 60% by High caliber (e.g.D-50).\n- Reduced to 60% the damage inflicted by Revolvers.\n- Reduced to 50% the damage inflicted by Machine Pistols.\n- Reduced damage inflicted by Submachine Guns:\n    - 50% by Small caliber (e.g. Mx4 Storm).\n    - 60% by Medium caliber (e.g. K1A).\n    - 65% by High caliber (e.g. UZK50GI).\n- Reduced damage inflicted by Assault Rifles:\n    - 50% by Small caliber (e.g. POF-9).\n    - 60% by Medium caliber (e.g. AUG A2).\n    - 65% by High caliber (e.g. Spear .308).\n- Reduced to 70% the damage inflicted by Light Machine Guns.\n- Reduced to 70% the damage inflicted by Designated Marksman Rifles.\n- Reduced to 70% the damage inflicted by Sniper Rifles.\n- Reduced to 70% the damage inflicted by Slug Shotguns.\n\nAll the values are down from 75%.\n\n## RAPPEL\n\nWe are removing the requirement of having a Breach Charge deployed on a window to execute a Rappel Breach. Allowing operators to use different tools like a Sledgehammer, shotguns, or explosives to destroy barricades while rappelling provides more tactical options and adaptability in high-pressure situations. This flexibility leads to more creative and dynamic gameplay, as players can choose the best tool for the situation. It enhances the immersion of the game, making the gameplay experience more engaging and intense.\n\nFurthermore, players can think strategically about their loadout and approach. Using a shotgun for a quick breach, a Sledgehammer for a silent entry, or a Breach Charge to ensure synchronization will significantly impact the outcome of engagements. This flexibility also enhances team coordination, as players can plan and synchronize their breaching strategy based on the tools available to them, promoting communication and teamwork.\n\n### RAPPEL BREACH\n\n- Operators can execute the Rappel Breach without needing to previously damage the barricade or place a Breach Charge.\n- The operator will go through the barricade if it is sufficiently damaged by the end of the interaction.\n    - Otherwise, the operator will bounce back and damage the barricade with its feet.\n\n# WEAPON BALANCING\n\n## BALLISTIC SHIELD\n\nShielded operators will need to plan their paths more carefully, as they will no longer be able to aim down sights while vaulting over objects, through windows, or barricades. This adjustment will reduce their lethality when navigating through barricades, requiring them to rely on teammates to quickly capitalize on targets. We believe this change will encourage more strategic movement around the map and enhance the overall tactical experience.\n\n### BASE\n\n- Vault: Aiming down sight is canceled during the interaction.\n\n### OPERATORS AFFECTED\n\n- Blackbeard\n- Blitz\n- Fuze\n- Montagne\n\n# RANK DISTRIBUTION\n\n* * * * *\n\n![[R6S] Y10S2 Designer's Notes - Y10S1 Rank Distribution PC](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1NCSBxQZA7r04QpoXztQ9G/da19dea082365cffebd4a2d242b1d57e/Y10S1_Rank_Distribution_PC.jpg)\n\n![[R6S] Y10S2 Designer's Notes - Y10S1 Rank Distribution Console](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/qyKNPJn1077a6QWmJNmt2/30c5be46c0fccb133fba9d5c9e651657/Y10S1_Rank_Distribution_Console.jpg)\n\n* * * * *\n\nFollow us and share your feedback on [X](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 14,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/8dJbwMqIt5Y8lZgwJRjWZ/y10s2-designers-notes",
    "date": "2025-05-19T13:15:00.000Z"
  },
  {
    "id": "fUm14ptpr80MNeAOLWt0U",
    "title": "R6 Credit Pack Changes Starting June 10",
    "abstract": "We are adjusting the available in-game credit packs with the launch of Siege X.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3H3zq2ZMvvfFzFCgd6q7wp/8fe65fd41bb7b0e582ee8c0f7465191f/vc_960x540.png",
    "content": "As part of our long-term commitment to Rainbow Six Siege, we're updating our R6 Credit packs on June 10 for the first time in nearly a decade. These changes are designed to ensure we can continue delivering a consistent, high-quality experience - now and in the future.\n\nHere's what's changing:\n\n- The $20 USD/EUR and $35 packs will be replaced with a new __$25 pack__ offering __3,300 credits__\n\n- The $50 pack will include __7,200 credits (vs 7,560 credits today)__\n\n- The $100 pack will include __15,000 credits (vs 16,000 credits today)__\n\n- The $5 and $10 packs will remain the same\n\nDuring Year 10 Season 2, we'll also have the __Premier Pack__ available for a one-time purchase of __$20__, which includes __3,300 credits__ and __exclusive cosmetics__ - offering more value for players who want to jump into the new season.\n\nWhile these adjustments are minor, we understand that even small pricing changes can affect our players, and we take that responsibility very seriously. This update is about making the smallest changes possible while sustaining the game for the long haul and continuing to build a Siege experience we're proud of.\n\n-Rainbow Six Siege Core Team",
    "categories": [
      "rainbow-six-siege",
      "game-updates"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/fUm14ptpr80MNeAOLWt0U/r6-credit-pack-changes-starting-june-10",
    "date": "2025-05-13T12:30:00.000Z"
  },
  {
    "id": "3a6LfnM6paOsjQY6PDvfkC",
    "title": "COMMUNITY ARTIST BUNDLE PROGRAM Y10S2: GLAMBERTILUVU",
    "abstract": "Learn more about the Y10S2 Community Artist Bundle - designed by Glambertiluvu for the operator Iana.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/78DBKEmj7V1YcAVSFcC7ls/0927266d2462ae81b2691277b0b42c82/Iana_CommunityArtist_RuL_960x540.jpg",
    "content": "\n# COMMUNITY ARTIST BUNDLE: GLAMBERTILUVU\n\nThe Community Artist Bundle Program is back with yet another amazing operator set! This bundle has been designed in collaboration with artist Glambertiluvu and will be available for purchase in the in-game store for a limited time, starting May 8.\n\nWith this program, we want to celebrate our amazingly creative and dedicated community artists and give them the chance to have their art styles represented in-game. Each chosen artist will have the opportunity to design a full set for an operator of their choice and the resulting bundles will become available for limited time during Year 9 and beyond.\n\nThis season, the Community Artist Bundle not only supported a talented artist from our community, but proceeds will also benefit several content creators promoting the bundle as part of a new revenue-sharing test opportunity.\n\nGlambertiluvu's Iana Operator Bundle includes:\n\n- Uniform\n- Headgear\n- ARX200 weapon skin\n- Charm\n\nDon't forget to have a look at our previous bundles if you haven't yet: [SAU_SIEGE](https://rainbow6.com/artistbundle_y6s1), [Sunstark](https://rainbow6.com/artistbundle_y6s2), [FrAgMenT](https://rainbow6.com/artistbundle_y6s3), [Pericote](https://rainbow6.com/artistbundle_y6s4), [Shinosaaaaaaang](https://rainbow6.com/artistbundle_y7s1), [Siege Tales](https://rainbow6.com/artistbundle_y7s3), [Retrodisaster](https://rainbow6.com/artistbundle_y7s4), [LevaSoj](https://rainbow6.com/artistbundle_y8s1), and [Notamutemain](https://rainbow6.com/artistbundle_y8s2).\n\n## ABOUT THE ARTIST\n\nGlambertiluvu's - also known as RuL - interest for art started during her childhood as her parents were buying her art books and supplies. This led RuL to create doodles at a very young age, and even to draw on top of the illustrations in her school textbooks when growing up. Due to her obsession with visual arts and painting, she chose graphic design as her university major.\n\nIn 2021, RuL transitioned from semi-realism to a 2D cartoon art style using flat colors. This style is reflected in her bundle for Iana: from the design of the charm to the color palette used throughout the operator and weapon skin. Impressed by Iana's background and obsession for aerospace engineering, she chose to add different references to those in her bundle. Noticeably, the \"space buns\" hairstyle which is derived from the space-themed pop culture. Other starry details such as hair clips and face paint are found on Iana's skin. The most astute eyes will notice the graffiti on Iana's chest armor - \"Meijer\", her real last name.\n\nOriginally playing single-player games such as Assassin's Creed Black Flag, Glambertiluvu was drawn into Siege thanks to Lion's voice actor, Shawn Baichoo, who also interpreted Machiavelli in Assassin's Creed II and Wrench in Watch Dogs 2. She described being chosen to collaborate with the Rainbow Six Siege team on designing this bundle as the highlight of her career, bringing her joy and pride.\n\nAs a final word, we would like to quote RuL: \"I would like to express my gratitude to the R6S community for their passion. Creating this concept art was a labor of love, and I hope it resonates with players as much as it does with me. The community's engagement and enthusiasm inspire me to continue pushing creative boundaries, and I look forward to contributing more in the future.\"\n\nTo see more of Glambertiluvu's work, go check her [Twitter](https://twitter.com/glambertiluvu) and [Instagram](https://www.instagram.com/glambertiluvu/) accounts.\n\n## FAQ\n\n__What is the Community Artist Bundle Program?__\n\nThe Community Artist Bundle Program launched in Y6S1 and it brings operator bundles created by some of our most talented and dedicated Siege fan artists into the game.\n\n__I'm a Siege fan artist too - what can I do to get selected as well?__\n\nGiven the length of our production cycle for in-game content, the fan artists for Year 10 have already been determined. However, we are always on the lookout for future participants. If your goal is to see your bundle in-game, continue showing us your passion and strive to be an outstanding member of the Siege community.\n\n__How can I get the Y10S2 Glambertiluvu Operator bundle?__\n\nThe bundle will be available in the in-game store for a limited time, starting May 8, and will remain live until the end of Y10S3. Players can purchase the bundle with R6 credits.\n\n__Will this offer be available on all platforms?__\n\nYes, it can be redeemed on PC, Xbox One, Xbox Series S|X, PlayStation 4, PlayStation 5, and Amazon Luna.\n\n__How long will this offer be available?__\n\nFollowing its release on May 8, you have until the end of Y10S3 to purchase this bundle in the in-game store.\n",
    "categories": [
      "rainbow-six-siege",
      "community"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3a6LfnM6paOsjQY6PDvfkC/community-artist-bundle-program-y10s2-glambertiluvu",
    "date": "2025-05-08T16:00:00.000Z"
  },
  {
    "id": "1N1qEcXvlvPG8z6EIa2MXx",
    "title": "R6 Shieldguard & Anti-Toxicity – Y10S1 UPDATE",
    "abstract": "Find our latest Anti-Cheat and Anti-Toxicity updates.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2yLNs78nz6j46SLMvWnlMV/baafcf146c8f32a2d3977302d120bf61/image-2025-05-02-14-30-15-848.jpg",
    "content": "Today our R6 Shieldguard and Anti-Toxicity teams will be sharing their latest updates. We'll have a deep dive on features and results from Y10S1, as well as a look at some of the updates coming to the game in the future.\n\n## IN THIS UPDATE\n\n__R6 ShieldGuard__\n\n__ANTI-TOXICITY__\n\n- Standing Distribution\n\n- Impacts - Negative Actions Decreasing\n\n- Tuning & Additional Repercussions\n\n- Automated Textchat Moderation\n\n![[R6S] Player Protection Update Y10S1 Header ShieldGuard 150x960 Y10S1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/573Mkc8xNE3Jz4XPrrUqbV/845b361aff78777362faa96d0f1f07b8/Header_ShieldGuard_150x960_Y10S1.png)\n\n## STATUS OVERVIEW\n\nCheater reports have seen a downward trend throughout Y9S3, and this continued right up to the release of Y10S1.1. Since the Y10S1.1 update, we have seen an increase in cheater reports on PC. Thanks to your in-game cheater reports, our team has identified a correlation to some of our recent security updates.  Below we'll dive into  those updates and the action we're taking to turn this latest development around.\n\n![[R6S] Player Protection Update Y10S1 R6 CheaterReportChart 2024 Y10S1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/69Syc1J83T3IGUXWM60JJY/a37aa628e54b1e5fe8b23f98411c8a68/R6_CheaterReportChart_2024_Y10S1.jpg)\n\n## MAKING OUR CODE STRONGER - NEW TECHNOLOGY\n\nIn Y10S1 and in partnership with the security teams of Ubisoft, we introduced a hardening technology which enables new ways to secure our game code, making it more robust against cheat makers. This new technology now serves as a foundation for many other security improvements that will ship throughout the year.\n\n## WE ARE CONTINUOUSLY IMPROVING\n\nThe in-game impact of this technology was positive initially, though following Y10S1.1, we recorded an increase in cheater reports. We've seen that there is room for improvement, however this has only bolstered our commitment, and so we've worked to push new features throughout Y10S1, making the system more secure. Additionally, we've kept to our commitment to push security updates alongside patches, and so security hotfixes will continue leading up to and after the release of *Siege X*. Two additional security hotfixes are scheduled for deployment in May to further reinforce this approach.\n\n## FIGHTING LAG ABUSE TO PROTECT FAIR PLAY\n\nIn Y10S1, and with the help of the community, we fixed several exploits that were abusing network lag. We want to take the opportunity to heartfully thank the community, from content creators to everyone who submitted R6Fix reports. You have all helped us to both reproduce and fix many of these exploits that were possible on console. We're continuing to monitor the situation and to help prevent lag exploits on a wider basis, we are currently working on a global solution, using stricter network tolerations (More info to come soon).\n\n## PREVENTING MnK ON CONSOLE\n\nPreviously we shared that console cheater reports increased after the launch of Crossplay, and that we fixed an exploit that would allow spoofers to by-pass detection. We can now confirm that reports have seen a drop of approximately 20%. However, Console cheater reports are still higher than pre-crossplay  numbers and we are aware of anti-recoil cheats disrupting the community. Although our data shows that MouseTrap is performing well, catching spoofing devices such as Xim and Cronus, it currently lacks anti-recoil detection capabilities. We want to be clear, anti-recoil cheats are not acceptable, irrespective of platform. Although we cannot communicate on our roadmap at this time, rest assured that this is one of the R6 Shieldguard team's top priorities, and we are actively researching solutions. In the meantime, please continue to submit in-game reports.\n\n## SIEGE X & FUTURE PLANS\n\n__SECURITY UPDATES WITH EACH PATCH__\n\nWe will keep making our code stronger with *Siege X* and beyond. A security update will go live at launch, with more updates rolling out season after season specifically targeting the ability for cheats to stay online and disrupt the game.\n\n__R6 SHIELDGUARD UPDATES LIVE, NO MAINTENANCE REQUIRED__\n\nA major update to R6 Shieldguard will allow us to distribute new executables with updated security measures to players without the need for scheduled maintenance. Periodically, a security update will be downloaded, and players will be asked to reboot their game. Note that this will never happen during a match. After a reboot, players can continue playing, knowing that they are now on a newer executable with new security measures. This will make cheats more difficult to make and more costly to maintain, forcing cheats to stay offline longer.\n\n## SANCTIONS\n\nThanks to the new gameplay violations introduced in Y10S1, combined with automated data analysis and investigations from our team, we continued the momentum from the start of the year by issuing strong permanent ban waves in March, resulting in over 6,500 R6 Shieldguard perma-bans that month alone. On average since the beginning of the year, R6 Shieldguard has issued about 2 times more permanent bans than last year, a clear testament to the performance and evolution of our systems.\n\n## PERMA-BAN NUMBERS - BATTLEYE + R6 BANS\n\nCheck out the last 12 months of perma-ban data, including new data for 2025.\n\n![[R6S] Player Protection Update Y10S1 R6 BanChart Apr24-Mar25 Y10S1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5t8iL2wnnwFAd9CAB4XprS/e25786b8b21aeb1ec4274cdf9b44fe3c/R6_BanChart_Apr24-Mar25_Y10S1.jpg)\n\n## FINAL NOTE\n\nWith *Siege X* on the horizon, R6 Shieldguard remains at the forefront of the fight against cheating. Our team is actively researching, developing, and evolving across all areas of the Anti-Cheat space. Whether you're playing on PC or Console, we have exciting plans to further enhance your experience and ensure a fair game for everyone.\n\n![[R6S] Player Protection Update Y10S1 Header AntiToxicity 150x960 Y10S1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/gzPAX6IJDVYgBv2fzTu4E/a54266af6d10c62c198b1025127661ab/Header_AntiToxicity_150x960_Y10S1.png)\n\nOperation Prep Phase marked the full release of the Reputation System; the Beta tag is gone, and Impacts are now online. This is the first time that players have seen rewards or repercussions based on their Reputation Standing alone, and today our Anti-Toxicity team will be detailing how Impacts have affected the game so far. The team will also be sharing a few details on upcoming updates, and how they plan to make Siege and its Anti-Toxicity systems better for everyone.\n\n## REPUTATION SYSTEM FULL RELEASE\n\n### STANDING DISTRIBUTION UPDATE - [IMPACTS LIVE]\n\nThe activation of Impacts has resulted in a positive change in player behavior, and we've got the data to show it. The percentage of players in positive Standings (Respectable, Esteemed, Exemplary) has increased across the board, while the percentage of those in negative Standings (Disruptive and Dishonorable) has reduced. We can see that players who were previously recurrently toxic have adapted to the new Impacts by changing their behavior. We'd also like to insist on the fact that \"Respectable\" is a good standing where players receive positive perks.\n\n__KEY STATS__\n\nIn comparison to last season we have seen:\n\n- A decrease of -23% players in Dishonorable.\n\n- An increase of +37% players in Exemplary.\n\n![[R6S] Player Protection Update Y10S1 R6 StandingsBarChart Y10S1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2smuGnYJ6wz52B5snczUID/014e5199bdda74868e3abb58b799fcba/R6_StandingsBarChart_Y10S1.jpg)\n\n### IMPACTS - NEGATIVE ACTIONS DECREASING\n\nThere are a number of in-game behaviors that have seen an improvement as part of the shift in Standing distribution. Here are a few stats showing just how behavior has changed in Y10S1 thanks to the full release of the Reputation System.\n\n- -21% change to the number of negative actions per player match (see graph below).\n\n- +21% change to the number of positive actions per player match (see graph below).\n\n- -22% intentional team kills in Ranked and -23% in Standard.\n\n- -16% abandoned matches in Ranked, and -14% in Standard.\n\n- -35% friendly gadget destruction in Ranked, and -43% in Standard.\n\nHere is a detailed look at the amount of negative actions completed per player match, where we can see an overall downward trend. Of course, we do expect these figures to evolve over time, and particularly within the first 90 days of Impact activation. Our team will continue to analyze this data as we move forward, reacting and adapting where necessary.\n\n![[R6S] Player Protection Update Y10S1 Y10S1 ReputationActions Season](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4j3O7IvIchWL791Nax2PIK/c14f3ea134d056927a640914345f6ba2/Y10S1_ReputationActions_Season.jpg)\n\n### DISHONORABLE - ADDITIONAL REPERCUSSIONS\n\nThis season, we added additional measures specifically targeting consistently toxic players. Dishonorable players who continue to significantly exceed the negative unit limit are now automatically temporarily banned. If those players continue to be disruptive after their return, they are manually reviewed for potential permanent ban.\n\n### TUNING, EXPANDING, QOL\n\nLooking ahead, we have plans to improve the Reputation System experience. Our plans include:\n\n- Introducing more nuanced team-kill tracking to alleviate frustration around unintentional incidents.\n\n- Enhancing and expanding positive action recognition.\n\n- Addressing new areas of concern that hinder a positive environment, such as in-game idling, boosting with cheaters, and more.\n\n## AUTOMATED TEXTCHAT MODERATION\n\n### FLAGS AND FALSE POSITIVES\n\nOur Automated Textchat Moderation is helping to reduce toxicity in the game. The percentage of removed and flagged messages has decreased by 50% since launch, even while more messages are being sent overall (see graph below). Over 200 million text chat messages are analyzed each month and fewer than 1% of these are being removed, with less than 2% being flagged.\n\nWe are continuously fine-tuning the system to minimize false positives as much as possible (any messages which are flagged or removed unnecessarily). Currently, false positives are estimated to make up 0.1% of all flagged or removed messages, equating to around 6,000 messages per month. We know that an incorrect flag feels unfair; rest assured that a single false positive should not severely impact your Reputation Standing. We rely on your help to improve the system by reporting any incorrect detections that you experience through [R6Fix](https://r6fix.ubi.com/). Thanks for your cooperation!\n\n![[R6S] Player Protection Update Y10S1 R6 FlaggedMessages SeasonY10S1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7AIgzpTBbQ3FQXI63VtIbT/804c0d7a281b25d4a322fd6417d28093/R6_FlaggedMessages_SeasonY10S1.jpg)\n\n![[R6S] Player Protection Update Y10S1 R6 MessagesSent Y10S1 Final](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4tLppT7ZbZTIvTTRn1bpw3/0a077d28a56c1b9f13e762646b056c1c/R6_MessagesSent_Y10S1_Final.jpg)\n\n## WHAT ELSE IS COMING?\n\nWhile the Reputation System has our full and ongoing support, our team is also working on more features to improve the overall game experience, player comfort, and privacy.\n\n__Automated Voice Chat Moderation:__\n\n- Enhancing detection and enforcement to address the most toxic players using in-game voice chat, across both PC and consoles.\n\n__Improved Privacy Settings for PC and Consoles:__\n\n- Automatically assigning nicknames to players.\n\n- Enabling all privacy settings on consoles.\n\n__Enhanced Abandonment Penalty System:__\n\n- Reducing frustration caused by \"unfair\" abandonment penalties due to crashes.\n\n- Refining detection to focus on players who frequently abandon matches on a long window period.\n\n__Revamped In-Game Reporting:__\n\n- Introducing greater granularity to reporting options.\n\n- Providing players with clearer insights into how their reports are utilized.\n\n## FUTURE OPPORTUNITIES\n\nWe're pleased with the progress made in Siege this year when it comes to reducing toxicity and creating a more welcoming ecosystem. That said, we recognize there is still significant room for growth and refinement. Our ongoing challenge remains to be fostering a positive environment while staying true to the game's unique culture. We do understand that the perception of toxicity can vary greatly though, depending on an individual's sensitivities. As such, not everyone may align with our standards, which is why your feedback is invaluable to us---we're always listening and evolving.\n\nThank you for your continued support, understanding, and patience. Stay positive and make the game better!",
    "categories": [
      "rainbow-six-siege",
      "toxicity",
      "anti-cheat",
      "dev-blogs"
    ],
    "readTime": 10,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1N1qEcXvlvPG8z6EIa2MXx/r6-shieldguard-antitoxicity-y10s1-update",
    "date": "2025-05-08T12:30:00.000Z"
  },
  {
    "id": "3adVE0FPbli42OBNXPdrr3",
    "title": "Y10S1.3 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y10S1.3!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7lLYOpqZt63Sn40epoxgaD/50ec391f059af2a8598851a7191aae4e/PATCHNOTES_Y10S1.3_960x540.jpg",
    "content": "See the upcoming changes to Rainbow Six Siege with the release of Y10S1.3.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Ace Up the Sleeve badge doesn't count during an Ace round when enemy players reconnect to the match.\n\n### USER EXPERIENCE\n\nFIXED - Players are unable to connect on PC with error 0x00000140.\n\nFIXED - Players get stuck on the deployment phase and can't progress the match.\n\nFIXED - Equipped reputation card backgrounds don't update when a player has a change in their reputation.\n\nFIXED - Operator unlock videos don't play when unlocking Operators, and can't be viewed in the Operators section after being unlocked.\n",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 1,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3adVE0FPbli42OBNXPdrr3/y10s13-patch-notes",
    "date": "2025-04-15T09:15:00.000Z"
  },
  {
    "id": "1T6bSlv03vnlIl69xjl6Pd",
    "title": "Y10S1.2 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y10S1.2!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5obhNry0naMX0dXoOUPP12/a4958e299f1ab0502bc47d03ef24c4e9/PATCHNOTES_Y10S1.2_960x540.jpg",
    "content": "See the upcoming changes to Rainbow Six Siege with the release of Y10S1.2.\n\n## BUG FIXES\n\n### OPERATORS\n\nFIXED - Rauora's D.O.M. Panel trigger won't work if the panel is closed while on a drone.\n\nFIXED - Rauora's D.O.M. Panel can't be deployed if it's facing the front of a deployable shield.\n\nFIXED - Rauora's D.O.M. Panel appears lowered in the killcam, even when it's actually raised.\n\nFIXED - Rauora's D.O.M. Panel trigger looks closed or missing after deployment during the end of round.\n\nFIXED - Rauora's D.O.M. Panel is placed incorrectly on a double door during the end of round.\n\nFIXED - Rauora's D.O.M. Panel doesn't deploy on lower floor doorways when shot through a hatch at a specific angle.  \n\nFixed - Rauora's D.O.M. Panel becomes unresponsive when its red target is shot.\n\n### USER EXPERIENCE\n\nFIXED - Universal weapon skins are missing for Skopós' PCX-33.\n",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 1,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1T6bSlv03vnlIl69xjl6Pd/y10s12-patch-notes",
    "date": "2025-04-01T09:15:00.000Z"
  },
  {
    "id": "6XrFt8UTFXgaeLpfcwTVHq",
    "title": "Y10S1.1 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y10S1.1!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/62wFMVJt3CASa65WmGmsO3/380419aa428a9b6b83f005efc7db2d70/PATCHNOTES_Y10S1.1_960x540.jpg",
    "content": "\nHere you can find the fixes for the Y10S1.1 patch.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - End-of-match actions won't be recorded for players who disconnect then reconnect during the match. \n\nFIXED - Several operators' left hands clip through specific secondary weapons during the reload animation when the operator is in a prone position.\n\nFIXED - Rauora's D.O.M. Panel can't be deployed when the operator is facing the front side of the deployable shield.  \n\n<br>\n\n### OPERATORS\n\nFIXED - Deploying a breach charge near the trigger for Rauora's D.O.M. Panel closes the flaps.\n\nFIXED - No points are awarded when successfully deploying Rauora's D.O.M. Panel.\n\nFIXED - Rauora's D.O.M. Panel trigger does not open if the panel is closed on top of a drone.\n\nFIXED - Rauora's D.O.M. Panel won't deploy properly on doorways on a lower level if fired through a hatch.\n\nFIXED - Rauora's D.O.M. Panel won't deploy properly if fired through small hole in a wall.\n\nFIXED - Raurora's D.O.M. Panel crosshair remains visible when using Observation Tools.\n\nFIXED - Maestro's Evil Eye red laser light is improperly positioned, obstructing the player's field of view when using the camera at specific angles.\n\n<br>\n\n### USER EXPERIENCE\n\nFIXED - Incorrect message appears in the \"Ankle Biter\" drone skin description.\n",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6XrFt8UTFXgaeLpfcwTVHq/y10s11-patch-notes",
    "date": "2025-03-24T09:15:00.000Z"
  },
  {
    "id": "5tSruuyHLijziOSKy8Epk8",
    "title": "Access the limited-time R6 Siege X Closed Beta",
    "abstract": "Try out Rainbow Six Siege’s brand-new game mode, Dual Front, from March 13th to March 19th",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/K5EV6DulVy6rFyr2AlnSt/3794d154b0819ac7c51c618cf8860345/R6X_BETA_KEYART_960.jpg",
    "content": "Immediately after the Siege X Showcase on March 13<sup>th</sup>, 2025, players will be able to access and test Dual Front, Rainbow Six Siege's newly revealed 6v6 game mode, in a limited-time Closed Beta.\n\n## WHAT IS DUAL FRONT\n\nThis unique, additional, permanent 6v6 game mode will be set on Siege's biggest map yet. Form up your squad from a curated roster of 35 operators, combining both Attackers and Defenders in ways never before seen, and get ready to secure enemy sectors whilst defending your own.\n\nTune in for the R6 Siege X Showcase to discover everything about Dual Front and get your access to the Closed Beta to try out the game mode.\n\n## EVERYTHING YOU NEED TO KNOW ABOUT THE R6 SIEGE X CLOSED BETA\n\nThe R6 Siege X Closed Beta will run from __March 13<sup>th</sup> @ 12pm PT / 3pm ET/ 8pm CET__, immediately after the conclusion of the R6 Siege X Showcase, to __March 19<sup>th</sup> @ 12pm PT / 3pm ET/ 8pm CET__, and will only be available on PlayStation 5, Xbox Series X|S and PC (Ubisoft Connect).\n\nTo access the R6 Siege X Closed Beta, simply watch the R6 Siege X Showcase on March 13<sup>th</sup>, via the official [Rainbow 6 Twitch channel](https://www.twitch.tv/rainbow6) or via a wide selection of [Content Creators' Twitch livestreams](https://www.twitch.tv/directory/category/tom-clancys-rainbow-six-siege), to earn a Closed Beta Twitch drop.\n\nMake sure to [link your Twitch and Ubisoft accounts](https://www.ubisoft.com/en-us/help/account/article/linking-your-twitch-and-ubisoft-accounts/000079308) in order to claim your drops.\n\nDrops will continue to be available on a selection of participating livestreams during the whole duration of the Closed Beta.\n\nAfter claiming the Closed Beta drop, follow the link sent by email to select your preferred platform to play on. Here are the next steps for each platform:\n\nIf you pick PC\n\n- The Closed Beta will automatically be added to your Ubisoft Connect Library\n- Download the Closed Beta\n\nIf you pick PlayStation 5 or Xbox Series X|S\n\n- You will receive a platform-specific Beta key\n- Redeem the key in the PlayStation Xbox store to unlock the Closed Beta\n- Download the Closed Beta\n\nYou can download and launch the Closed Beta as soon as you complete these steps, however the game servers will go live at the conclusion of the Siege X Showcase.\n\nOwning Rainbow Six Siege is not required to access the Closed Beta.\n\nThe Twitch drop campaign is already live! So join your favorite participating livestream and claim your Closed Beta access!",
    "categories": [
      "rainbow-six-siege",
      "game-updates"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5tSruuyHLijziOSKy8Epk8/access-the-limitedtime-r6-siege-x-closed-beta",
    "date": "2025-03-13T19:30:00.000Z"
  },
  {
    "id": "7gp7yFPZJLTjyJs1pCSVI3",
    "title": "Y10S1 Patch Notes Addendum",
    "abstract": "See the changes made over the course of the Y10S1 Season Test Server.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1VpDvFkcrE9lGt6CaELxb7/422247a2b0945b301509796e1bee4e6e/PATCHNOTES_ADDENDUM_Y10S1_960x540.jpg",
    "content": "You can find here the updates and fixes made over the course of the Y10S1 Season Test Server. Find the full Operation Prep Phase Patch Notes [here](https://rainbow6.com/prepphase).\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Swapping to line of sight has no time limit, causing unintended bot behaviours.\nFIXED - Blackbeard's look/aim direction in from Defender's point of view doesn't match first person view while in free rappel.\nFIXED - The LED is missing when an operator is watching Skopós's idle V10-Pantheon Shell camera.\nFIXED - Blackbeard's fingers look strange when grasping weapons from Defender's point of view.\nFIXED - Starting with the second round on all maps, the Preparation phase red barrier is missing on all doors and windows.\nFIXED - Blackbeard's H.U.L.L. Adaptable Shield remains extended when Blackbeard is knocked back by Oryx's Remah Dash.\nFIXED - Players get minus points as Rook when destroying an empty Armor Pack container.\nFIXED - Animation in first person view is snappy when using Dokkaebi's Logic Bomb.\nFIXED - Broken reload animation on bots in Killcam and End of Round Replay.\nFIXED - Operator's hands are offset for a few frames when reinforcing a wall as a Defender. \n\n<br>\n\n### LEVEL DESIGN\n\nFIXED - Players can peek through a gap between reinforced walls if the soft part is destroyed.\nFIXED - Azami is able to vault on the shelf in 2F garage in Clubhouse by using her Kiba Barrier.\nFIXED - Players can vault on top of the boxes in the middle of the room in 2F Geisha on the Skyscraper map.\nFIXED - Echo's Yokai Drone loses signal on the stairs in 2F South Stairs on the Coastline map.\nFIXED - The drone vent marker disappears even when the player turns on the drone vent option.\nFIXED - A gap is present when a barricade is placed on the door next to B Freezer Stairs on the Oregon map.\nFIXED - Bots can't interact with a briefcase while player is using Melusi in 1F Coat Check on the Kafe Dostoyevsky map.\nFIXED - Floating paper VFX is low resolution regardless of setting in 1F Spiral Stairs of the Consulate map.\n\n<br>\n\n### OPERATORS\n\nFIXED - Rauora's Reaper MK2 emits a reflection when approaching certain areas.\\\nFIXED - Pinging the trigger of the Panel from Rauora's D.O.M. Panel Launcher shows Castle's Icon.\\\nFIXED - Rauora's Reaper MK2 Extended Magazine floats when canceling the reload animation.\\\nFIXED - Rauora's Operator Portrait rarity is missing.\\\nFIXED - When previewing Rauora, the D.O.M. Panel Launcher appears to be floating behind her.\\\nFIXED - Fuze's Ballistic Shield clips into view while deploying a Cluster Charge.\\\nFIXED - Post-shoot animation plays after equipping Rauora's D.O.M. Panel Launcher when it's empty.\\\nFIXED - Weapons are misplaced in Rauora's hands, after switching weapons while aiming down sights of D.O.M Panel Launcher.\\\nFIXED - Closing the Panel from Rauora's D.O.M. Panel Launcher doesn't destroy certain gadgets beneath it.\\\nFIXED - No Charm options available for Blackbeard's H.U.L.L. Adaptable Shield.\\\nFIXED - Operator body snaps for a frame when when they step on their first stair tread while sprinting.\\\nFIXED - Montagne takes bullet damage when a defender shoots precisely at the left side of the Le Roc Shield.\\\nFIXED - Brava's Kludge Drone is invisible in drone view in Match Replay.\\\nFIXED - Thunderbird's Kóna Station camera appears as if it's floating during deployment.\\\nFIXED - Operator's hand clips to their back when picking up the hostage in crouch position.\\\nFIXED - Kapkan's Entry Denial Device laser VFX doesn't show up after installation.\\\nFIXED - Twitch's left hand clips vertically with the observation tools phone when accessing the cameras.\\\nFIXED - Blackbeard's can push through a wall while it's being reinforced.\\\nFIXED - The LEDs on Iana's Gemini Replicator appear misaligned when deploying.\\\nFIXED - Wrong collision material on the glass of Blackbeard's H.U.L.L. Adaptable Shield.\\\nFIXED - Castle's Armor Panel can break if an Operator vaults next to it.\\\nFIXED - Blackbeard's H.U.L.L. Adaptable Shield clips through the floor while in crouch position.\n\n<br>\n\n### USER EXPERIENCE\n\nFIXED - Players get stuck in an empty Siege Cup lobby if they leave the Registration prompt on-screen and confirm after the registration period has ended.\nFIXED - Players receive a D01A error if they reconnect and select 'Keep Playing as a Team' during the After Action Report.\nFIXED - Several UI elements are missing from the player profile side panel when viewed during a local custom game.\nFIXED - Several UI elements are missing from player cards in the local custom game lobby.\nFIXED - Generic description and reward descriptor are both missing from the Reputation Bonus Drops widget.\nFIXED - Players with Disruptive/Dishonorable Reputation Standing are able to register for Siege Cup.\nFIXED - Rick and Morty bundles duplicate after purchase.\nFIXED - Searching for or selecting a weapon skin in Marketplace will give an error message.\nFIXED - Elite animations are not synchronized with the timing of animated props.\nFIXED - The Attackers spawn location is missing on Operator cards when viewed in Spectator mode.\nFIXED - The ban phase always display orange as banning for the spectator client.\nFIXED - Lights on operated observation tools are not visible from a distance of 13m or more.\nFIXED - Camera is blurred when Montagne deflects bullets with Le Roc Extendable Shield.\nFIXED - Previous Seasons section is not showing the ranks of the past seasons.\nFIXED - The Lefty preset assigns both the Aim and Shoot actions to the same input.\nFIXED - Upper and Lower Brackets are not updated after a match is cancelled.\nFIXED - Flawless Round Bonus and Match Victory score points are overlapping at the end of the match.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 5,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/7gp7yFPZJLTjyJs1pCSVI3/y10s1-patch-notes-addendum",
    "date": "2025-03-04T21:15:00.000Z"
  },
  {
    "id": "4Uf2IvRS00iq4XCR2UhkYy",
    "title": "Y10S1 Celebration Pack",
    "abstract": "Celebrate a new era of Siege with a selection of the best cosmetics released in the last 9 years.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2t08tEXWZIsDbLmnDGNASF/d843bc5d88360d7c4b8fb8960f420c72/r6s_celebration_pack.jpg",
    "content": "## BRINGING BACK THE BEST OF SIEGE\n\nWe are celebrating a new era of Rainbow Six Siege with a special limited-time cosmetics pack available only during Y10S1 - the Celebration Pack!\n\nThe Celebration Collection contains the best items released over the last 9 years of Siege, including past limited-time Event Collections, top 20 items from each Battle Pass, and seasonal signature weapon skins as far back as Year 1.\n\nUnopened Celebration Packs will be tradeable on the Marketplace later this year.\n\n### MULTIPLE WAYS TO UNLOCK\n\nCelebration Packs containing duplicates can be unlocked in the free Battle Pass and with Renown:\n\n1 Pack: 15 000 Renown\\\n5 Packs: 75 000 Renown\\\n25 Packs: 337 500 Renown\\\n50 Packs: 600 000 Renown\n\nGet non-duplicate Celebration packs from the Premium Battle Pass and Membership drops.\n\n# CELEBRATION COLLECTION\n\nThe Celebration Collection consists of more than 1400 items made up of 20% legendary, 55% epic, and 25% rare items. Each item has a 0.07% chance of dropping in packs that contain duplicates. Non-duplicate packs have moving odds depending on your inventory.\n\n<center>\n\nSee the complete list [in the PDF file](https://rainbow6.com/celebration_pack_full_list).\n\n![[R6S] Celebration Pack - QR](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6ul9LVVQoPWyGkLD4Ny56I/32933fb9f2ba820bbeec1afd81194cf2/qr-code-celebrationpackfulllist_150.png)\n\n</center>\n",
    "categories": [
      "rainbow-six-siege",
      "shop"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/4Uf2IvRS00iq4XCR2UhkYy/y10s1-celebration-pack",
    "date": "2025-03-03T15:15:00.000Z"
  },
  {
    "id": "DPcG6hMUkSGTeS2vUeEDn",
    "title": "Y10S1 Streamer Charm",
    "abstract": "New Rainbow Six Siege Streamer Charm for Y10S1!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2Ms01xoqBjkZk3Fq8pLk4U/e96c64cf00fd58800abb42cf52563923/-R6S--Y10S1-Streamer-Charm---thumbnail.jpg",
    "content": "# New Rainbow Six Siege Streamer Charms for Y10S1!\n\n## Announcing the next Streamer Charm!\n\nEach season will bring the release one new charm, as well as the return of streamer charms from previous seasons! Check out this season's newest charm recipient below, and read on for further updates on the Streamer Charm program.\n\n## New\n\n![-R6S- Y10S1 Streamer Charm - thumbnail](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2Ms01xoqBjkZk3Fq8pLk4U/5efad3461652cb08fb20f8f84d2db333/-R6S-_Y10S1_Streamer_Charm_-_thumbnail.png)\n\n[KeTo](https://www.twitch.tv/keto)\n\n## Returning\n\n![-R6S- Y10S1 Streamer Charm - 1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/fU9NcqpFICnq55wX2WsZR/d9d71bd40a7bfa58271f37c2fd5c9f9a/-R6S-_Y10S1_Streamer_Charm_-_1.png)\n\n![-R6S- Y10S1 Streamer Charm - 2a](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/15ElhtfGsxmCeONgm0daSN/79693ec8d46858a5a3d1d10da1e9f9f3/2.STREAMER_CHARMS_Y10S1_960x540.jpg)\n\n![-R6S- Y10S1 Streamer Charm - 3](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/28VVxFq0VPtpYN4aTXrQAI/8d18482f3f5cb24efbe3a6cde5feb1e7/-R6S-_Y10S1_Streamer_Charm_-_3.png)\n\n![-R6S- Y10S1 Streamer Charm - 4](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6N6WY8MFvGDtJV4CbSilFz/4dfa79fa0c40c53a4c6d6d07bf7f6a6c/-R6S-_Y10S1_Streamer_Charm_-_4.png)\n\n![-R6S- Y10S1 Streamer Charm - 5](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/40EAzq3FnREufBFPY0OlaF/f9d9db4b3625be2ecbd13e6ae05d6ca2/-R6S-_Y10S1_Streamer_Charm_-_5.png)\n\n![-R6S- Y10S1 Streamer Charm - 6](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3Az2XtRcRHHLQ6cZLvIU2L/21ed24b02146988b8dba630a921cca27/-R6S-_Y10S1_Streamer_Charm_-_6.png)\n\n![-R6S- Y10S1 Streamer Charm - 7](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/FtaqqNx4SnEJqXBZhNIEf/3e4e1f829d842e8363dc766cf0338d1a/-R6S-_Y10S1_Streamer_Charm_-_7.png)\n\n[Alfredoplays](https://www.twitch.tv/alfredoplays)\n[AnneMunition](https://www.twitch.tv/annemunition)\n[Beaulo](https://www.twitch.tv/beaulo)\n[Bighead](https://www.twitch.tv/bighead033)\n[BikiniBodhi](https://www.twitch.tv/bikinibodhi)\n[Bnans](https://www.twitch.tv/bnans)\n[Braction](https://www.twitch.tv/bractionfps)\n[Drid](https://www.twitch.tv/dridgg)\n[FastAnne](https://www.twitch.tv/fastanne)\n[Gabbo](https://www.twitch.tv/JustGabbo)\n[Heideltraut](https://www.twitch.tv/heideltraut)\n[Interro](https://www.twitch.tv/interro)\n[JerichoFive](https://www.twitch.tv/jerichofive)\n[JessGOAT](https://www.twitch.tv/jessgoat)\n[Jynxzi](https://www.twitch.tv/jynxzi)\n[Just9n](https://www.twitch.tv/just9n)\n[KingGeorge](https://www.twitch.tv/KingGeorge)\n[KittyR6](https://www.twitch.tv/kitty_r6)\n[LagonisR6](https://www.twitch.tv/lagonis)\n[Lil_Lexi](https://www.twitch.tv/lil_lexi)\n[Lt Custard](https://www.twitch.tv/lt_custard)\n[Lusorkoeffizient](https://www.twitch.tv/lusorkoeffizient)\n[MacieJay](https://www.twitch.tv/MacieJay)\n[Mag6](https://www.twitch.tv/mag6)\n[M3ry](https://www.twitch.tv/m3ry)\n[Matimi0](https://www.twitch.tv/matimi0)\n[MrBboy45](https://www.twitch.tv/mrbboy45)\n[Narcoleptic Nugget](https://www.twitch.tv/narcolepticnugget)\n[Nesk](https://www.twitch.tv/neskwga)\n[PaladinAmber](https://www.twitch.tv/paladinamber)\n[Patife](https://www.twitch.tv/patife)\n[Pengu](https://www.twitch.tv/pengu)\n[RazaH](https://www.twitch.tv/razah)\n[REMGURI / 렘쨩](https://www.twitch.tv/remguri)\n[Rubsarb](https://www.twitch.tv/Rubsarb/)\n[SexyCake](https://www.twitch.tv/smexycake)\n[Sha77e](https://www.twitch.tv/sha77etv)\n[Shorty](https://www.twitch.tv/shortyyguy)\n[shroud](https://www.twitch.tv/shroud)\n[SilphTV](https://www.twitch.tv/silphtv)\n[Tatted](https://www.twitch.tv/tatted)\n[Tranth](https://www.twitch.tv/tranth)\n[Varsity](https://www.twitch.tv/varsitygaming)\n[WhiteShark67](https://www.twitch.tv/whiteshark67)\n[yo_boy_roy](https://www.twitch.tv/yo_boy_roy)\n[z1ronic](https://www.twitch.tv/zironicdk)\n[Zander](https://www.twitch.tv/zander)\n[ziGueira](https://www.twitch.tv/zigueira)\n[GarfieldIsDoc](https://www.twitch.tv/garfield)\n[Supr](https://www.twitch.tv/supr)\n[RyyFyy](https://www.twitch.tv/ryyfyy)\n[FoxA](https://www.twitch.tv/foxa_r6)\n[Nerdengenheiro](https://www.twitch.tv/nerdengenheiro)\n[Rainbow6itacom](https://www.twitch.tv/rainbow6itacom)\n[Minimichegga](https://www.twitch.tv/minimichegga)\n[JostRekt](https://www.twitch.tv/jost)\n[JustRyuk](https://www.twitch.tv/justryuk)\n[Paluhh](https://www.twitch.tv/paluhh)\n[Poxonlox](https://www.twitch.tv/poxonlox)\n[TheLionerYT](https://www.twitch.tv/thelioneryt)\n[itsSpoit](https://www.twitch.tv/itsspoit)\n[Retalha](https://www.twitch.tv/retalha)\n[FooYa](https://www.twitch.tv/fooya)\n[IceCold](https://www.twitch.tv/icecold)\n[Athieno](https://www.twitch.tv/athieno)\n[Marciu](https://www.twitch.tv/marciu)\n[Rembeey](https://www.twitch.tv/reembey)\n[rasco100](https://www.twitch.tv/rasco100)\n[Vetelcito01](https://www.twitch.tv/vetelcito01)\n[OneShooter](https://www.twitch.tv/oneshooter)\n[Scythe](https://www.twitch.tv/scythe)\n[Jenz](https://www.twitch.tv/jenz)\n[Frankystrings](https://www.twitch.tv/frankystrings)\n[Eternal_regina](https://www.twitch.tv/eternal_regina)\n[Pxppy](https://www.twitch.tv/eternal_regina)\n[Skyte](https://www.twitch.tv/skyte)\n[Ru_rumiiiin](https://www.twitch.tv/ru_rumiiiin)\n[Anifex](https://www.twitch.tv/anifex)\n[Vetelcito](https://www.twitch.tv/vetelcito01)\n[Priest](https://www.twitch.tv/omgitspriest)\n[Nonomiyamika](https://www.twitch.tv/nonomiyamika)\n[alyttleton](https://twitch.tv/alyttleton)\n[MeatyMarley](https://twitch.tv/meatymarley)\n[ThatOneBritt](https://twitch.tv/thatonebritt)\n[TitaniumRolo](https://twitch.tv/titaniumrolo)\n\n## Streamer Charm Program Update\n\nIn Year 10, we are bringing some changes to the Streamer Charm program by moving to __one__ exclusive new creator charm per season.\n\nOur goal with this adjustment is to introduce a brand new seasonal charm later this year that will be available to even more creators.\n\nAs part of this program update, we are also refining our selection criteria; in addition to recognizing established creators, we'll be highlighting up-and-coming talent in the Siege community. These fresh new faces are chosen for their promising future in the Siege space.\n\nStay tuned! We will be revealing more details on this new seasonal charm and associated criteria toward the end of the first season.\n\n## Screening Procedure\n\nWe have implemented additional screening procedures into our selection process for streamer charms.\n\nUpon selection for the program, streamer charm candidates' main and alt accounts are now screened for MouseTrap violations, gameplay violations, and histories of toxicty, in addition to the other screening steps they undergo for eligibility.\n\n## How to acquire charms\n\nThese charms are only available by subscribing to the respective streamer's Twitch channel with a linked Ubisoft account. For more information on how to link your Ubisoft and Twitch account, as well as opt in for Twitch Drops, please refer to [this FAQ](https://support.ubi.com/Faqs/000035432/Get-your-Twitch-Streamer-s-charm).\n\n## How to get involved\n\nWe have updated the Ubisoft Creators Program registration to open the program to TikTok and Instagram, therefore opening new collaboration opportunities for content creators, streamers, fan artists, and cosplayers from our community.\n\nWe are always on the lookout for content creators that inspire and enrich the Siege community. If you would like access to the perks of being a partnered content creator, and your goal is to one day have a charm in the game, we would like to invite you to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/en-us).\n\nFrom there, complete the following steps:\n\n1. Connect your Ubisoft Account. If you do not have one, you can create one [here](https://connect.ubisoft.com/create).\n\n2. Agree upon the eligibility criteria.\n\n3. Connect your primary channel (Twitch, YouTube, TikTok, Instagram) or secondary channels.\n\n4. Indicate your games preferences.\n\n5. Set your location, broadcast language, and communication language.\n\nYour application will then be submitted and must be approved by Ubisoft. An email will be sent to confirm your participation.",
    "categories": [
      "rainbow-six-siege",
      "community"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/DPcG6hMUkSGTeS2vUeEDn/y10s1-streamer-charm",
    "date": "2025-02-28T16:00:00.000Z"
  },
  {
    "id": "25izb8Ha0sFpDLgVuKf6gA",
    "title": "Join the Sixth Guardian Hope Fundraiser for Worldwide Cancer Research!",
    "abstract": "The Siege team is excited to continue the Sixth Guardian Program in Y10S1 with a brand new bundle.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6dpBWGaOFXEEHFvg4z6VWH/2b88cd1af35560890786607f3e0c1d78/WWCR_HOPE_AZAMI.jpg",
    "content": "The Siege team is excited to continue the Sixth Guardian Program in Y10S1 with a brand new bundle chosen by YOU, the Siege community.\n\nThis season, Sixth Guardian is partnering once more with Worldwide Cancer Research, an organization funding visionary, game-changing cancer research around the world to start new cures. The \"__Sixth Guardian Hope__\" bundle will __release on March 6<sup>th</sup>__ and features a full Azami set, as chosen by the Siege community in an online poll. One hundred percent of net proceeds (no less than $6 USD per bundle) will go to [Worldwide Cancer Research](https://www.worldwidecancerresearch.org/) to specifically contribute toward funding for cutting-edge breast cancer research.\n\nStarting on March 8<sup>th</sup>,  we invite all Rainbow Six Siege creators and community members to join the movement by streaming or creating social media content over the weekend. We've put together a Creator Kit package available via the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/) for the occasion which includes stream overlays and assets. You can also download the kit [here](https://ubi.li/SixthGuardian).\n\n## SIXTH GUARDIAN HOPE BUNDLE\n\nThis exclusive bundle includes a cosmetics set for Azami, and features her signature sleek suit accented with pink, the universal color for breast cancer. Specifically, the set includes:\n\n- \"Sixth Guardian Hope\" Uniform\n\n- \"Sixth Guardian Hope\" Headgear\n\n- \"Sixth Guardian Hope\" Background Card\n\n- \"Sixth Guardian Hope\" Charm\n\nThe bundle will be available for a limited time.\n\n![[R6S] Sixth Guardian HOPE Announce - Cancer Research Video](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/tVuyOMShpHo6bSW2KeGlb/83b8305d4a067d92dba340b4eaeea603/R6S_-_Sixth_Guardian_Bundle_x_Worldwide_Cancer_Research_Video_VF.mp4)\n\n## ABOUT WORLDWIDE CANCER RESEARCH\n\nWorldwide Cancer Research focuses on funding discovery research, the critical first stage of the research journey that uncovers knowledge that can lead to new ways to prevent, diagnose, and treat cancer. Bright ideas come from anywhere, which is why they fund projects anywhere in the world. And they fund research into any type of cancer, because there are over 200 types that all need different cures.\n\nSince 1979, Worldwide Cancer Research has invested over £200 million in more than 2,000 research projects in 35 countries worldwide, leading to some remarkable breakthroughs. But with cancer rates increasing, and global discovery research funding decreasing, it is imperative to push forward faster and fund more new projects every year.\n\nThis simply won't be possible without the continued support of incredible community of Curestarters - people who turn their compassion into action by supporting Worldwide Cancer Research's work - for themselves, for their loved ones, and for the millions of people around the world affected by cancer. Becoming a Curestarter is a positive way to be part of something bigger and to contribute to vital research that will save lives.\n\nMany of you have already become Curestarters by supporting the previous \"Sixth Guardian Health\" bundle. We invite you to support \"Sixth Guardian Hope\" and recruit others to become Curestarters to help fund visionary, game-changing research around the world, and take us one step closer to a day when no life is cut short by cancer.\n\nLearn more about Worldwide Cancer Research [here](https://www.worldwidecancerresearch.org/).\n\n## WHAT RESEARCH WILL YOUR DONATIONS SUPPORT?\n\nAll net proceeds from your donations will go to Worldwide Cancer Research, with no less than $6 USD per bundle going to the charity.\n\n### SMART BOMBS: A NEW APPROACH\n\nOnce cancer has spread, or metastasized, it often becomes incurable. A pioneering new team of researchers led by Professor Roberta Tasso at the University of Genoa in Italy have an ambitious plan: to find new ways to deliver drugs directly to hard-to-treat breast cancer tumors. By using nanoparticles that occur naturally in our bodies as 'smart bombs', the team hope to be able to knock out tumors even after cancer has spread.\n\n![[R6S] Sixth Guardian HOPE Announce - smart bomb animation](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3psiRMkDS6JpHFi3pF5lmR/751fd23352294630d6d009595983427a/Smart_bomb_animation.mp4)\n\n### A MESSAGE FROM THE RESEARCHER\n\n\"I am truly delighted and honored that my project has been selected for the fundraising campaign in partnership with Ubisoft and the Rainbow Six Siege community.\n\nThis project, while challenging, offers great potential to advance cancer treatment, and it is thanks to your support that we are able to push boundaries in such a high-impact area of research. We are incredibly grateful for your belief in our work, which we hope will have a tangible impact on cancer therapy in the future.\"\n\n-Professor Roberta Tasso\n\nTogether, the Siege community has already raised nearly $100k USD for Worldwide Cancer Research by supporting the \"Sixth Guardian Health\" bundle for Twitch. Let's continue to push past that and help our partners support ground-breaking efforts in breast cancer research.\n\nIf you'd like to support Worldwide Cancer Research further, you can make direct donations [here](https://www.worldwidecancerresearch.org/donate/).\n\n## A MESSAGE FROM WORLDWIDE CANCER RESEARCH\n\nYears of collaborative and pioneering research have led to incredible breakthroughs in how we prevent, diagnose, and treat cancer. But it is still one of the leading causes of death worldwide, and too many people still have to say goodbye to a loved one too soon. In 2022 there were an estimated 9.7 million deaths worldwide from cancer, and currently, this number is predicted to almost double by 2050.\n\nBut cutting-edge science gives us hope for the future. By funding more discovery research into any type of cancer, anywhere in the world, Worldwide Cancer Research believes that we can be ready to face the cancer challenges of tomorrow.\n\n\"Our vision is to see a day when no life is cut short by cancer. For me, this sums up what most of us fear about cancer. The fear of losing time or a life that we really should have had. This includes the way cancer turns lives completely upside down.\"\n\n- Dr Helen Rippon, Worldwide Cancer Research Chief Executive\n\n## ABOUT THE SIXTH GUARDIAN PROGRAM\n\nSince the program's launch in 2020, together with our community, we have raised over $600,000 USD! We'd like to extend our thanks once again to our past Sixth Guardian Partners: [AbleGamers](https://ablegamers.org), [Stack Up](https://www.stackup.org), [Indspire](https://indspire.ca/), [ILGA World](https://ilga.org), [Ecologi](https://ecologi.com) and [Worldwide Cancer Research](https://www.worldwidecancerresearch.org/).\n\nTogether with our partners, we hope to unite the Rainbow Six Siege community and make positive changes outside of our game.",
    "categories": [
      "rainbow-six-siege",
      "shop",
      "community"
    ],
    "readTime": 6,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/25izb8Ha0sFpDLgVuKf6gA/join-the-sixth-guardian-hope-fundraiser-for-worldwide-cancer-research",
    "date": "2025-02-19T16:00:00.000Z"
  },
  {
    "id": "11OmVXw4ysjxBGg3lY6HtB",
    "title": "Y10S1 Designer’s Notes",
    "abstract": "In this latest edition of Designer’s Notes, we are sharing details on the balancing changes process and why we will not be pushing additional changes this season.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5gqBZqnHXGjO4w1J083rK5/c7758c6efef3020cc6ad2b6b485c441a/DESIGNER_NOTES_Y10S01_960x540.jpg",
    "content": "In this latest edition of Designer's Notes, we are sharing details on the balancing changes process and why we will not be pushing additional changes this season.\n\n# YEAR 10 SEASON 1\n\nWe have decided to let the game stabilize for a bit longer than usual in preparation for everything coming and start the new Siege era with more stable data overall. Every patch we release, even though we are building towards a fixed direction, adds more entropy into the mix, making it harder to evaluate the impact of every change. However, we wanted to take this opportunity to share some insights about our thought processes.\n\n# BALANCING PROCESS INSIGHTS\n\nTo begin with, in the context of strategy and tactics, the defensive team typically holds the advantage. It's like assaulting a fortress; expecting the attacking force to have equal chances of victory as the defending force is unrealistic. Defenders have the privilege of choosing the battlefield; they are essentially playing at home. In a game like Siege, defenders also alter the battlefield every round, while attackers have a mere 180 seconds to analyze and execute a new strategy based on the information gathered, which might only be reliable for a brief period. This is why we aim for a 55% defensive win rate with a 5% tolerance.\n\nThe different matrices represent the big picture of the game and help us interpret its current state. We have plenty of them: different ranks, platforms, playlists, and even specific ones per map. Observing an outlier value triggers a discussion, not an immediate action. During these discussions, we focus on the overall vision of the game more than on the outlier. Siege has many moving parts, and even small changes can have significant consequences, which may not become apparent immediately and can take months or even years to fully manifest. This is why we continuously evaluate both new and old changes, as their effects on the game can vary from patch to patch. It's also important to highlight that buffs and nerfs are often two sides of the same coin. Buffing one operator typically means others are indirectly nerfed. As the buffed operator becomes more appealing, others with similar roles become less interesting, which has a similar effect to nerfing them. In reverse, nerfing an operator means that others are indirectly buffed and more appealing to use.\n\nWhen we see operators with very high presence, we see a reduction on variety. Playing and facing the same operators repeatedly can be boring and feel repetitive. Their ideal presence is around 13%, even though we don't aim strictly for this. If every operator were in their sweet spot data-wise, it would mean that everyone is viable in all situations, making operator selection feel meaningless. This is why we intend to make them situational, so the map, site, intel available, and team composition determine who is the best option. Every operator must be strong in the right situation but with flaws in the wrong one. On the other hand, operators with extremely low presence might be boring, not impactful enough, or simply not fitting into the current meta. And our approach is different depending on the reason.\n\nRegarding win deltas, they mostly represent how the operator is performing in the current meta rather than their inherent strength. We cannot say that Maverick is too weak when he can bypass any wall denial without help, or that Kapkan is too strong when there is always an Ash rushing without droning, leaving attackers one operator down 20 seconds into the round.\n\n# COMMUNITY FEEDBACK\n\nAdditionally to the hard data retrieved from your in-game matches, our teams also analyze your feedback via different means in order to have the best understanding of the current meta and what you, as players, have to say.\n\nThere are two approaches to gather player feedback, one could be considered as indirect and the other as direct. For the former, the feedback is found through the comments you naturally share on social media or other platforms and generally touches broader topics. The latter, on the other hand, requires targeted investigations. The intel is then collected through workshops involving experienced players and community members, topic-specific surveys, and Seasonal surveys. Once gathered, the feedback data is then translated into digestible formats for a better understanding of the community concerns, thoughts and ideas.\n\nWe will never say this enough: your feedback matters and changes the game. Please keep on sharing your thoughts on our different social media platforms and our dedicated Seasonal Surveys.\n\n# Y9S4 RANK DISTRIBUTION\n\n![[R6S] Y10S1 Designer's Notes - rank dist pc](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1LzhpZqQCbj9nhrnOCP3by/8bf57df04734094cd433c84ac9c5d436/Y9S4_Rank_Distribution_PC.jpg)\n\n![[R6S] Y10S1 Designer's Notes - rank dist console](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5PVYgfHbrHy6Q2MDNbXkAf/21ee330a1e364c36a9dd30e57a9d6f9c/Y9S4_Rank_Distribution_Console.jpg)\n\n<hr>\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 5,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/11OmVXw4ysjxBGg3lY6HtB/y10s1-designers-notes",
    "date": "2025-02-18T14:15:00.000Z"
  },
  {
    "id": "1yyppDElemqVlUXSVif55M",
    "title": "Witness the start of Siege’s new era – Don’t miss the R6 Siege X showcase",
    "abstract": "Celebrate the future of Rainbow Six Siege with us in Atlanta on March 13th!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/28DAhnCyWh17Tw23nJ6nnG/f0b0b58885f58679d92e89c2b097ce81/R6SX_SHOWCASE_UK.jpg",
    "content": "A new era is on the horizon for Rainbow Six Siege ---one that sets the stage for the years to come of tactical and unique gameplay--- and we'd like to invite you to be a part of it: welcome to Siege X!\n\n## A NEW ERA IS ABOUT TO START\n\nhttps://youtu.be/KicgXPVOD4s\n\nThe R6 team has been working tirelessly to bring to life the biggest transformation in the game's history and its purpose is to reinforce Rainbow Six Siege's position at the top of tactical first-person shooters by introducing new ways to play, deepened tactical gameplay, refined game feel and major upgrades all around. To celebrate this new age of Siege, we are holding an exclusive event that you're invited to attend; The Rainbow Six Siege X Showcase.\n\n## ALL YOU NEED TO KNOW ABOUT THE SIEGE X SHOWCASE\n\nThe Rainbow Six Siege X Showcase will be taking place in Atlanta, Georgia on __March 13<sup>th</sup>, 2025__ at __5pm GMT / 6pm CET__  and will be broadcasted live.\\\nThis event promises to be an immersive and one-of-a-kind Siege experience, where players, creators and developers come together as we unveil all the evolutions coming with Siege X, and many more surprises!\\\nTune in live with your friends over on our [Twitch Channel](https://www.twitch.tv/rainbow6) and enjoy exclusive Twitch drops!\n\nRainbow Six Siege wouldn't be where it is without the dedicated community that rallies behind it. We can't wait to reveal everything soon and hope that Siege X not only reinforces what you love about it, but gets you as excited for its future as we are.\n\n- Don't forget to __SAVE THE DATE__ and come celebrate Siege!\n  - [Google](https://rainbow6.com/showcase-std-google)\n  - [Apple](https://rainbow6.com/showcase-std-apple)\n  - [Outlook](https://rainbow6.com/showcase-std-outlook)\n  - [Yahoo](https://rainbow6.com/showcase-std-yahoo)\n",
    "categories": [
      "rainbow-six",
      "rainbow-six-siege",
      "game-updates"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1yyppDElemqVlUXSVif55M/witness-the-start-of-sieges-new-era-dont-miss-the-r6-siege-x-showcase",
    "date": "2025-02-16T20:40:00.000Z"
  },
  {
    "id": "23HvPOVDBapE7jokNWIa1E",
    "title": "PLAYER PROTECTION - Y9S4 UPDATE",
    "abstract": "Find our latest Anti-Cheat and Anti-Toxicity updates.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5pltUyyecNmRAPyErQjPj3/f5e2c4992a86e21076fee86f762f766e/-R6S-_PLAYER_PROTECTION_-_Y9S4_UPDATE_-_thumbnail.jpg",
    "content": "Today our Player Protection teams will be sharing updates on some of the developments we're making on our Anti-Cheat and Anti-Toxicity systems.\n\n## IN THIS UPDATE\n\n__ANTI-CHEAT__\n\n- Status Overview\n- MouseTrap - Mouse and Keyboard Detection on Console\n- Rage Cheating & Gameplay Violations\n- Lag Exploits\n- Encryption - Binary Hardening\n- Sanctions\n- Final Thoughts\n\n__ANTI-TOXICITY__\n\n- Reputation System Refresh\n- Automated Text Chat Moderation\n- Privacy Mode - Unacceptable Usernames\n- Our Direction\n\n![-R6S- PLAYER PROTECTION - Y9S4 UPDATE - Anti-Cheat.RED.150x960](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6euDjnqf78QsWAgjXa3V0H/2d56b46a2c0ab13b039a784b04c2c9e0/-R6S-_PLAYER_PROTECTION_-_Y9S4_UPDATE_-_Anti-Cheat.RED.150x960.png)\n\nIn Operation Collision Point, we've brought changes to improve the experience for both PC and console players, with continued binary hardening improvements for PC, the new MouseTrap penalty for consoles, and more. Today, our Anti-Cheat team will cover how we got here and what they've been working on, while sharing new data and analytics.\n\n## STATUS OVERVIEW\n\n### CHEAT VENDOR EXITS\n\nWe've touched on this before, but we'd like to share a little more on this here. Late last year, one of the most prevalent cheat vendors exited the Siege space. Leading up to this, the cheat vendor was either offline or being detected, meaning their cheats would be non-functional or result in a ban. This came from our multi-faceted approach to anti-cheat, combining measures in both detection and hardening. This has been a great success for Siege, and our mission is to continue making Siege less viable for cheat vendors.\n\n### CHEATER REPORTS DECREASING\n\n![-R6S- PLAYER PROTECTION - Y9S4 UPDATE - R6 CheaterReportChart 2024.VF.960x540](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/58eqpKWj8c09NyJRARqByq/ca64da1ab5d9427199a5be8c6f41c0c7/-R6S-_PLAYER_PROTECTION_-_Y9S4_UPDATE_-_R6_CheaterReportChart_2024.VF.960x540.jpg)\n\n__PC CHEATER REPORTS__\nCheater reports have been decreasing, and we've got all-new data to share on this. In the graph above, we can see that cheater reports have been consistently trending downward since the beginning of October, revealing that players are noticing the change in cheater presence. Cheater reports have now decreased by over 40% when compared to our highs of summer 2024, and year on year we've seen a drop upwards of 30%.\n\n__CONSOLE CHEATER REPORTS__\nConsole cheater reports have remained largely stable throughout the year. Reports did see an increase at the start of December, though we believe the majority of these are due to the [crossplay default setting bug](https://x.com/Rainbow6Game/status/1864792815542194684) that players had experienced at the launch of Y9S4. We remain focused on our console Anti-Cheat efforts, with more details on MouseTrap below.\n\n### FUTURE UPDATES - OUR MISSION IS UNCHANGED\n\nThe fight is not over. We know that other cheat makers will attempt to take advantage of the space left behind by a cheat vendor that has pulled out. The removal of this cheat creator changes very little for the Anti-Cheat team roadmap: we will keep investing and innovating in new hardening and detection technologies, to the betterment of Siege.\n\n## MOUSETRAP - MOUSE & KEYBOARD DETECTION ON CONSOLE\n\n- Reminder: MouseTrap is our __console__ __Anti-Cheat__ which works to detect devices that enable the use of mouse and keyboard.\n\n### NEW PENALTY LIVE\n\nY9S4 saw the release of the new MouseTrap penalty system. If detected 3 times, spoofers are forced into the PC matchmaking pool with PC recoil enabled for 90 days. This is a stark change in severity compared to the previous system, which would reduce its effects as soon as the player stopped using a spoofing device. Such a change was made possible by updates to the AI model which reinforced accuracy and further diminished false positives.\n\nLooking at the season launch we know that console players may not have felt the full impact of MouseTrap (as shown in the graph above with a rise in cheater reports at the start of December), with a bug enabling Console to PC crossplay by default, resulting in controller players being unknowingly matched with PC players who were legitimately using keyboard and mouse.\n\nOverall, our data shows that the system is working as expected, detecting and applying penalties to spoofing device users, forcing them into the PC pool. We are confident in our detection, though we know that some players have been able to bypass detection this season. This bypass method is currently being investigated, and we'll be enabling a fix for this soon.\n\nWe are closely monitoring MouseTrap and will continue to do so as we ramp up its AI capabilities. Our team is looking into improvements and new ways to utilize AI, which will help us to bolster our detection of cheating on console.\n\n## RAGE CHEATING & GAMEPLAY VIOLATIONS\n\n- __Reminder__: Gameplay Violations are actions that are technically possible within the game engine but are in effect forbidden and not possible from a gameplay perspective, such as shooting while sprinting.\n\nY9S3 has been our best season yet against rage cheating, thanks to a new system we implemented which detects Gameplay Violations. This new system has rendered the use of rage cheats a guaranteed ban, and at its peak, even outperformed our Data Ban system. With this foundational tech in place, it is now easier for the team to implement new Gameplay Violations as rage cheats arise.\n\n## LAG EXPLOIT SOLUTIONS\n\nWe noticed a rise in new lag-based exploits at the beginning of Y9S4. These exploits, which can happen on console, abuse client-server synchronization using network lag. Our team has recently pushed a fix to address these exploits, with an accompanying ban wave. We'd also like to thank players and creators for their help here, as reports submitted via [R6Fix](https://r6fix.ubi.com/) played a major role in our initial fixes. We'll continue to monitor this space closely.\n\n## ENCRYPTION - BINARY HARDENING\n\n- __Reminder__: Binary hardening is the act of using __encryption and hardening techniques__ to update the game code base and __enhance security__, and we've continued to deploy these updates to the game with each patch.\n\nIn Y9S4, we reinforced our hardening capacity even further, with more experts within the team working on improving game security. We've seen success from these efforts, with each patch this season resulting in a decrease in cheater reports and online mentions of cheats on patch day. As well as this, we can share that we're tracking another major cheat provider which has been offline since updates were deployed earlier this season. While we cannot delve into the details of each of our updates, we can confirm that they're delivering concrete results with increased offline time for cheat providers. We hope that you're feeling these results in-game too and as always, these efforts will continue.\n\n## SANCTIONS\n\n### CHEATER MATCH CANCELLATION\n\nWe had made the decision to hold Cheater Match Cancellation from the Y9S4 launch, so that additional time could be taken to ensure a smooth release. It's now live, having been activated in an update earlier this season. This has enabled cheaters to be kicked from a match as soon as a ban is issued, at which point the Cheater Match Cancellation feature will be triggered, cancelling the ongoing match for everyone. The result here is a reduction of player time being spent in unfair or illegitimate matches.\n\n### BOTTING SANCTIONS\n\n- __Reminder__: Botting refers to the use of automated programs designed to perform in-game actions without the interaction of a player.\n\nOur botting detection has been working well, though as we've heard from our community, the temporary bans which were being applied were not enough. With this in mind, we recently changed bans for botting to a permanent ban on the first offence. This change was made possible thanks to improvements in our detection system, leading to greater accuracy and system confidence.\n\n### BAN NUMBERS - BATTLEYE + R6 BANS\n\nOur ban data for 2024, updated to include October, November, and December.\n\nBelow are some key points we'd like to share:\n\n![-R6S- PLAYER PROTECTION - Y9S4 UPDATE - R6 BanChart Jan-Dec24.960x540](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1iU0rTnKZN1tYFQyDZyFJK/3d7eb01bf44386b1681582e86449655b/-R6S-_PLAYER_PROTECTION_-_Y9S4_UPDATE_-_R6_BanChart_Jan-Dec24.960x540.jpg)\n\n__AUGUST, SEPTEMBER, & OCTOBER - R6 BANS [Data Bans, Gameplay Violation Bans, & more]__\n\n- R6 Bans performed very well during these months. This was due to our implementation of Gameplay Violations detections, resulting in an uplift in bans for this period.\n\n__OCTOBER & NOVEMBER - BATTLEYE BANS__\n\n- BattlEye bans saw an increase in October and a secondary sharper increase in November. This was a direct result of our increased collaboration with BattlEye, and their own efforts to find new ways of detecting cheats.\n\n__DECEMBER__\n\n- December marked our latest season release, and while we see a decline in overall bans here, we also see that players have reported fewer cheaters compared to previous months (see Cheater Reports Trends above).\n\nAs of today, many cheats in the current landscape are either offline, having issues, or being detected by BattlEye.\n\n## FINAL THOUGHTS\n\nAs you can see from what we've shared today, we've got a multi-pronged approach to Siege Anti-Cheat, and we've seen results over Y9S3 and Y9S4. We will keep pushing and bringing information to you as we move forward.\n\n![-R6S- PLAYER PROTECTION - Y9S4 UPDATE - Anti-Toxicity.ORANGE.150x960](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/29wv0cvRlakff16c42Ry9y/0ad4c5b42e5fd2aab4009049728ab12b/-R6S-_PLAYER_PROTECTION_-_Y9S4_UPDATE_-_Anti-Toxicity.ORANGE.150x960.png)\n\nY9S4 saw the release of some of our biggest initiatives in Anti-Toxicity with Automated Text Chat Moderation and the Reputation System Refresh. Let's dig into these with our Anti-Toxicity team and see how they've impacted the game and players so far.\n\n## REPUTATION SYSTEM REFRESH\n\n### INITIAL OVERVIEW\n\nThe Reputation System Refresh is here, and so far this season, its performance and impact has matched our core pillars  (transparency, understandability, and clarity) and expectations. We're finding that players who are regularly or highly toxic are correctly being classified as Dishonorable or Disruptive, while positive players and those who are adapting their behavior are having that reflected with the higher Standings of Respectable, Esteemed, and Exemplary.\n\n![-R6S- PLAYER PROTECTION - Y9S4 UPDATE - StandingsIcons.960x253](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/8iUfNvQUbty5ImfcGFAn4/c87dcaa61345a1702eeb2aa0e01870e5/-R6S-_PLAYER_PROTECTION_-_Y9S4_UPDATE_-_StandingsIcons.960x253.jpg)\n\n### STANDINGS BREAKDOWN\n\nHere we have a visual breakdown of the Standings distribution for Y9S4. Currently 1.21% of players are in the Dishonorable (lowest) bracket, with 2.58% being Disruptive (second lowest), and our points system is ensuring that it takes a number of consistent negative steps to get into these brackets. Avoiding negative behavior will help any player to attain the Respectable Standing, and being positive in our matches without negativity, will help you climb higher.\n\n![-R6S- PLAYER PROTECTION - Y9S4 UPDATE - StandingsBarChart.960X540](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1mEXrSiT43kN0q8Zm1FcCx/7e0a8930b69ea9e549965fd863134339/-R6S-_PLAYER_PROTECTION_-_Y9S4_UPDATE_-_StandingsBarChart.960X540.jpg)\n\nWe've seen feedback that it feels too difficult to attain the Exemplary standing and that only a small number of negative actions are needed before dropping out of it. This is by design, so behaviour in this Standing must be close to perfect.  \n\nOf course, we will continue to monitor player feedback ensuring that the system works as expected. We are confidently moving towards activating the Reputation System Impacts soon (impacts based on your Reputation Standing) and moving out of Beta.\n\n## AUTOMATED TEXT CHAT MODERATION\n\n### LAUNCH\n\nTo start with, we're happy with the introduction of automated text chat moderation in Siege. We know that we got some of the detections wrong, though we've built this system with responsive adaptability in mind, so we have been able to fix issues reported to us within the same day. Below are some examples of messages that were flagged in the early stages of release, that have since been resolved.\n\n- \"very well shot, masterful aim and play\"\n- \"ping4\"\n- \"put a mira\"\n- \"meastro down\"\n- \"toxic\"\n- \"emp\"\n- \"I shot at lion through the hatch\"\n\nWe know that in some cases players may come across examples of messages that should or shouldn't be flagged. We are constantly looking at player feedback to refine the system, and are using your reports to apply prompt fixes, improving the experience for everyone.\n\nWe've also resolved a bug where some normal messages could be removed if they were sent too quickly in a row, such as \"GG\" - this was fixed during the hotfix on December 18th.\n\n### IMPACT ON PLAYERS\n\nSince the launch of our automated moderation, we've seen the probability of seeing a player reported for abusive text chat drop by 33% overall, and alongside this, the amount of highly toxic players in text chat has been reduced by 80%.\n\nThese figures show that the Automated Text Chat Moderation has had an instant effect on how some players choose to communicate in-game, leading to a more positive experience overall. We will maintain our live balancing ensuring that we can continue protecting players from recurrent or high toxicity.\n\n## PRIVACY MODE - UNACCEPTABLE USERNAMES\n\nWe are aware that some toxicity remains in-game through the use of offensive Privacy Mode usernames. We are currently working to improve our Anti-Toxicity username solution, and we can confirm that using such usernames may result in a ban. We're constantly banning players who choose to go over the limit with their chosen Privacy Mode usernames.\n\n## UPCOMING\n\nWe want to keep you up to date with some of the other features and improvements that will be coming in the future. Here's a rundown on some topics we're working on in the background:\n\n- Automated Voice Chat Moderation\n- Improving privacy settings for PC and Consoles\n- Reworking in-game reports: Adding more granularity and improving the feedback loop\n- Improving the abandonment penalty system\n\n## OUR DIRECTION\n\nThe Reputation System Refresh has seen a successful release that has clearly affected the negative communication in-game. The Automated Text Chat Moderation is also working well, and while we're aware that balancing will always be needed, we're ensuring that we can remain reactive to bring change quickly. Our goal now is to work on bringing the Impacts portion of the Reputation System live, so that players can be recognised for their positivity, or helped towards rehabilitation with impacts on their usual in-game rewards.",
    "categories": [
      "rainbow-six-siege",
      "toxicity",
      "anti-cheat"
    ],
    "readTime": 12,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/23HvPOVDBapE7jokNWIa1E/player-protection-y9s4-update",
    "date": "2025-02-05T14:15:00.000Z"
  },
  {
    "id": "51gYeQ7iJLRZgn91y0QCuZ",
    "title": "Y9S4.3 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y9S4.3!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4L06f8aPahD1mVNllT9Haq/22f05d11b40ab05b7113392ba3f562e0/PATCHNOTES_Y9S4.3_960x540.jpg",
    "content": "Here you can find the fixes for the Y9S4.3 patch.\n\n__Improved boot time by reducing unnecessary reboots (PC Only)__\n\n- Removed unnecessary reboots of RainbowSix.exe due to BattlEye relaunches\n- This streamlines the boot flow for users and reduces the time to get into the game by roughly 50%\n\n## Quickmatch & Standard Map Pool Update\n\nHereford __[REDACTED]__ due to __[REDACTED]__. Stay tuned for __[REDACTED]__.\n\n## BUG FIXES\n\n### USER EXPERIENCE\n\nFIXED - Squad Menu matchmaking settings are not saved after rebooting the game.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 1,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/51gYeQ7iJLRZgn91y0QCuZ/y9s43-patch-notes",
    "date": "2025-02-05T10:15:00.000Z"
  },
  {
    "id": "1tsDAx2MeB6SAKYNtoKjrE",
    "title": "Y9S4.2 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y9S4.2!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/34cA7iEbpyUUxHDSRU6Y8r/280b83d8c2549c2791c4c3d68ef867cb/PATCHNOTES_Y9S4.2_960x540.jpg",
    "content": "Here you can find the fixes for the Y9S4.2 patch.\n\n## Y9S4.2 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 1.58 GB\n- Steam: 1.3 GB\n- Xbox One: 1.73 GB\n- Xbox Series X: 1.87 GB\n- PlayStation®4: 2.27 GB\n- PlayStation®5: 1.53 GB\n\n## OPERATOR BALANCING\n\n### ORYX\n\n- Reduced recovery time when dashing to 0.2 seconds (from 0.5).\n\n- Reduced recovery time when dashing against a wall to 0.3 seconds (from 0.5).\n\n- Reduced recovery time when dashing against an enemy to 0.1 seconds (from 0.5).\n\n### KAPKAN\n\n- Removed Nitro Cell.\n\n- Added Barbed Wire.\n\n### LESION\n\n- Mines' refill time increased to 30 seconds (from 25).\n\n- Reduced max. mines to 8 (from 9).\n\n### BUCK\n\n- Removed Hard Breach Charge.\n\n- Added Claymore.\n\n### RAM\n\n- Removed ITA12S.\n\n### SLEDGE\n\n- Reduced Health to 2 (from 3) and increased Speed to 2 (from 1).\n\n## WEAPON BALANCING\n\n### TCSG12\n\n- Damage: 75hp (from 63).\n\n### G36C\n\n- Reduced vertical recoil.\n\n- Reduced lateral recoil.\n\n### WEAPON CALIBERS\n\n- Slug's destruction reduced.\n\n### WEAPON CLASSES\n\n- Slug Shotguns' damage drop off start at 15 meters (from 25).\n\n- Slug Shotguns' damage drop off end at 25 meters (from 35).\n\n- Slug Shotguns' damage drop off minimum to 60% (from 70).\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Match doesn't end when reaching majority of votes to cancel the round.\n\nFIXED - Observation Tools have no signal when deployed on the edge of any surface if the player is moving sideways.\n\n### LEVEL DESIGN\n\nFIXED - Red walls denoting defender area restrictions can be vaulted through during the end of the Preparation Phase.\n\nFIXED - Operators are able to move on top of a shed after standing on a bench and forcing collision with a garden gnome in the EXT APC Area on the House map.\n\nFIXED - Hatch isn't completely destroyed by explosions in 1F Lounge on the Kanal map.\n\nFIXED - Players can move on top of a vending machine using Azami's Kiba Barrier in 2F Break room on the Border map.\n\n### OPERATORS\n\nFIXED - Blackbeard's Breach ability can be used while in guard break in a specific timing.\n\nFIXED - Rappel hook remains in player's hand after using Ash's Breaching Round while rappelling.\n\nFIXED - Blackbeard's primary weapons statistics compare to the H.U.L.L Deployable Shield instead of each other.\n\nFIXED - Blackbeard's MK17 CQB's iron sight clips through the player camera while aiming down sight.\n\nFIXED - \"Additional Magazines\" and \"Magazine Size\" are listed as \"0\" in the Blackbeard's Loadout menu.\n\nFIXED - Bullet damage disappears from Blackbeard's H.U.L.L. Deployable Shield when Blackbeard aims down sights.\n\nFIXED - Blackbeard's H.U.L.L. Deployable Shield breaks guard when Blackbeard dashes and is hit with a melee attack at the same time.\n\nFIXED - Blackbeard's H.U.L.L. Deployable Shield and equipped weapon isn't highlighted when Blackbeard spawns on the map when viewed in caster mode.\n\nFIXED - \"Enter\" prompt allows Osa to breach undamaged barricades while rappelling with the Talon-8 Clear Shield equipped.\n\n### USER EXPERIENCE\n\nFIXED - Tachanka's Elite Slava Korolyu skin isn't available in the Weapon Skins menu for the Bearing 9 Machine Pistol.\n\nFIXED - Breach Charge information hasn't been updated to reflect current season changes in the Battle Pass menu.\n\n### AUDIO\n\nFIXED - Blackbeard's sprint SFX is out of sync with the animation.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1tsDAx2MeB6SAKYNtoKjrE/y9s42-patch-notes",
    "date": "2025-01-21T14:45:00.000Z"
  },
  {
    "id": "7bfYr7UJrJwiEp7zpQa0dd",
    "title": "Y9S4.2 Designer's Notes",
    "abstract": "In this latest edition of Designer's Notes, we'll go into more detail about the balancing changes that'll come with the Y9S4.2 update and give you some insight into the reasons behind them.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/UcR2JfRS8DIV4GHJW5i6O/5d13427551ab1865c57fb4165e72be48/DESIGNER_NOTES_Y9S4.2_960x540.png",
    "content": "In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y9S4.2 update and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n### WIN DELTA VS. PRESENCE\n\n<center>\n\n![[R6S] Y9S4.2 Designer's Notes - BalancingMatrix_Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7wDODsv1sYQYu7P6su3aeo/a795c6eef3743a075b7fd3f922db5094/R6S_DN_Y9S4_BalancingMatrix_Att.mp4)\n\n![[R6S] Y9S4.2 Designer's Notes - BalancingMatrix_Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3u3vPDA9uAIQ7heWnbhzmN/3658d5d39251751303cec2827040e067/R6S_DN_Y9S4_BalancingMatrix_Def.mp4)\n\n</center>\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n### OPERATOR BAN RATE\n\n<center>\n\n![[R6S] Y9S4.2 Designer's Notes - BanMatrix_Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7HRtd43UXyj0QGCACVBo2/997cac3953e152ea03a7b6e32d15ddfd/R6S_DN_Y9S4_BanMatrix_Att.mp4)\n\n![[R6S] Y9S4.2 Designer's Notes - BanMatrix_Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6w6IryvkXyPw1dZmejellW/93af5ee8566d15587ecb56ce3506f5ec/R6S_DN_Y9S4_BanMatrix_Def.mp4)\n\n</center>\n\n# OPERATOR BALANCING\n\n### BUCK\n\nWhile Hard Breach Charges are useful for opening a couple of reinforcements, Buck's primary role is soft breaching with his Skeleton Key. This role is almost always needed, and the Hard Breach Charges gave him too much flexibility, making him a one-man-army in many situations. By removing them, we aim to encourage more cooperation among team members.\n\nAdditionally, equipping Buck with Claymores can enhance his utility. Instead of taking on multiple roles, he can focus on his primary job more safely. Buck can secure key entry points and prevent roamers from sneaking up on him or his team. This allows him to maintain control over the map, ensuring that enemies are either killed, deterred, or forced to reveal their positions if they attempt to flank.\n\n#### LOADOUT\n\n- Gadgets: Removed Hard Breach Charge. Added Claymore.\n\n### KAPKAN\n\nWe have decided to replace Kapkan's Nitro Cell with Barbed Wire to reduce his killing potential., as his EDDs are already enough explosives and are quite effective. \n\nThe Barbed Wire will enhance Kapkan's ability to delay and disturb attackers' progress through the map, emphasizing area denial over lethality. It can be used to block or control key pathways, forcing attackers to take alternative routes where EDDs might be placed. This strategic placement can funnel attackers into more predictable and dangerous areas.\n\n#### LOADOUT\n\n- Gadgets: Removed Nitro Cell. Added Barbed Wire.\n\n### LESION\n\nWe believe that Lesion currently exerts too much map control too quickly due to the number of mines he can deploy per round. The strategic placements of these mines are effectively countering the removal of their cloaking, which means some of the buffs we introduced along that change are no longer necessary. \n\nAt present, Lesion can cover up to 5 entry points within the first minute of Action Phase. By adjusting the refill time, this will be reduced by 1. Fewer mines will force Lesion players to be more strategic about where and when they place their mines. They will need to prioritize high-traffic areas and key objectives, rather than spreading mines more liberally across the map. This adjustment will also make easier for attackers to navigate the map without the constant threat of stepping on a GU Mine, allowing them more freedom to move quickly and aggressively, and making it more challenging for Lesion to control the pace of the game.\n\n#### BASE STATS\n\n- Max. resources: Reduced to 8 mines (from 9).\n\n#### GU MINE\n\n- Refill time: Increased to 30 seconds (from 25).\n\n### ORYX\n\nPreviously, the recovery times after using his dash were long enough for attackers to react and potentially eliminate him. By reducing them, Oryx can capitalize on the element of surprise more consistently and make more effective use of his mobility without being too vulnerable. This change enhances his ability to disrupt enemy plans and maintain pressure on attackers, making him more viable and competitive operator.\n\nThe new timings will also synergy really well with the recently buffed SPAS-12, as it is more comfortable to use and will be very reliable to finish enemies, and be more consistent against Ballistic Shields.\n\n#### REMAH DASH\n\n- Weapon recovery time after dashing: Reduced to 0.2 seconds (from 0.5).\n- Weapon recovery time after dashing against a wall: Reduced to 0.3 seconds (from 0.5).\n- Weapon recovery time after dashing against an enemy: Reduced to 0.1 seconds (from 0.5).\n\n### RAM\n\nThe BU-GI Auto Breacher is one of the most destructive gadgets available, capable of destroying a wide range of objects and surfaces while allowing Ram to remain in a safe position or be ready to act on the destruction created. Her ability to clear entire ceiling in a split second and displace defenders below is unparalleled.\n\nWe believe this should be her main focus, leaving more precise destruction to other soft-breachers. Therefore, we have decided to remove the ITA12S from her loadout.\n\n#### LOADOUT\n\n- Secondary weapons: Removed ITA12S.\n\n### SLEDGE\n\nThe soft-breach ecosystem has evolved significantly since we implemented the armor and speed reshuffle at the end of Year 7. With the introduction of Ram and the Frag Grenade changes at the end of Year 8, it is now time to reassess the entire ecosystem.\n\nGiven the new situation, we believe that enhancing Sledge's speed will be more advantageous than focusing on his survivability. As Sledge is the only operator who needs to be in close proximity to the target surface, increased speed will aid him in rotating quickly when his secondary utility is required elsewhere.\n\nBuck offers the most flexibility, capable of playing from bottom to top. Ram boasts the highest destruction potential with minimal risk. And Sledge stands out for his precision and reliability. We believe that the changes made to them will create a more balanced ecosystem where each of them has its own space in the meta.\n\n#### BASE STATS\n\n- Speed: 2 (from 1)\n- Health: 2 (from 3)\n\n# WEAPON BALANCING\n\n### SLUG SHOTGUNS\n\nBack in Y9S1, when we normalized the damage drop-off of every weapon to match its weapon class, the BOSG.12.2 was one of the exceptions cleared. As a result, its damage drop-off changed from starting at 10 meters to 25 meters and ending at 18 meters to 35 meters.\n\nWith some time now in the live servers, we believe the Slug Shotgun class is not performing as intended. Our initial goal was to create something between a Shotgun and a DMR, but the data shows they are closer to the latter, with the BOSG.12.2 being the most prominent example.\n\nTherefore, we have decided to adjust their damage drop-off again to align more closely with regular Shotguns. This adjustment will maintain their lethality at short-mid range while reducing their effectiveness in long range engagements. However, the Magnified Scopes will remain to facilitate landing more precise shots.\n\n#### BASE STATS\n\n- Damage drop off start: Reduced to 15 meters (from 25).\n- Damage drop off end: Reduced to 25 meters (from 35).\n- Damage at maximum range: Reduced to 60% (from 70).\n- Destruction range: Reduced.\n\n#### WEAPONS AFFECTED\n\n- ACS12\n- BOSG.12.2\n- TCSG12\n- .44 Vendetta*\n\n#### OPERATORS AFFECTED\n\n- Alibi\n- Azami\n- Dokkaebi\n- Goyo\n- Kaid\n- Maestro\n- Vigil\n- Deimos*\n\n\\**Only apply the destruction change because it uses the same caliber, but the damage configuration is unchanged.*\n\n### G36C\n\nDuring Y8S4.2, the G36C became one of the Attacker weapons with a higher K/D ratio. At that time, we increased its recoil, which significantly impacted its popularity. Currently, Iana chooses it in approximately 40% of the rounds, while Ash use it in only 2% of the rounds. We are proposing a new recoil adjustment to make the weapon more appealing while maintaining its killing performance. The new recoil setting will be a middle ground between its states before Y8S4.2 and its pre-patch configuration.\n\n#### RECOIL - PC & CONSOLE\n\n- Vertical: Reduced.\n- Horizontal: Reduced.\n\n#### OPERATORS AFFECTED\n\n- Ash\n- Iana\n\n### TCSG12\n\nThe weapon has been performing very well since the last changes. However, the new tweak to the Slug Shotgun class might cause it underperform. To compensate for this, we are increasing its base damage to ensure it remains as effective as before at long range.\n\n#### BASE STATS\n\n- Damage: Increased to 75hp (from 63).\n\n#### OPERATORS AFFECTED\n\n- Goyo\n- Kaid\n\n##\n\n<hr>\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 8,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/7bfYr7UJrJwiEp7zpQa0dd/y9s42-designers-notes",
    "date": "2025-01-20T14:45:00.000Z"
  },
  {
    "id": "1T6yWQHcJZvPFpO6QaQjAG",
    "title": "Holiday Pack 2024",
    "abstract": "The Free 2024 Holiday Pack is available from December 23 2024 through January 3 2025.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4HCAIKCAUfu7n1BAz3cUgl/3421fc1e591c4af191c50ba71726d116/R6S_Y9S4_HolidayPack_960x540.jpg",
    "content": "Happy Holidays from the Rainbow Six Siege team! We've got a surprise for you!\n\nThe free 2024 Holiday Pack is available from December 23rd, 2024, through January 3rd, 2025.\n\nThe Holiday Pack contains 1 random unowned Operator or a Bravo Pack if all Operators are already owned.\n\nTo get your pack go the shop and claim the \"free gift\" item. The in-game news bulletin should also direct you there.\n\nWe hope you enjoy and have a great time heading into the new year.\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege",
      "store"
    ],
    "readTime": 1,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1T6yWQHcJZvPFpO6QaQjAG/holiday-pack-2024",
    "date": "2024-12-23T11:00:00.000Z"
  },
  {
    "id": "NFdKlD7aNKI9a98ICe8oq",
    "title": "Y9S4.1 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y9S4.1!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7uL0GFPrHHB2n2JVOix4TE/521a8badd25cad5a5d90df8734828bf5/PATCHNOTES_Y9S4.1_960x540.jpg",
    "content": "Here you can find the fixes for the Y9S4.1 patch.\n\n<br>\n\n## Y9S4.1 PATCH SIZE\n\nFind the download sizes for each platform below:\n\n- Ubisoft Connect: 32.8 GB\n- Steam: 5.3 GB\n- Xbox One: 8.09 GB\n- Xbox Series X: 7.9 GB\n- PlayStation®4: 9.8 GB\n- PlayStation®5: 7.4 GB\n\n<br>\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Squad leader is unable to select banned Operators in a Custom Lobby.\n\nFIXED - Timer animation for recharging Gadgets will grey-out when the available Gadgets reaches zero.\n\nFIXED - Context to toggle preview on or off is missing for Brava's Kludge Drone Twitch's Shock Drone guide.\n\nFIXED - Blackbeard's SR-25 clips through the H.U.L.L Adaptable Shield when viewed by an Opponent.\n\nFIXED - Blackbeard's H.U.L.L Adaptable Shield remains unequipped after performing a full reload in rappel.\n\nFIXED - Aim Down Sight desync between first-person and third-person view when Blackbeard is selected as an Attacker.\n\nFIXED - Task system is empty when selected for the first time through \"Wait in Shooting Range\" in Siege Cup or Matchmaking.\n\nFIXED - Weapons appear to float behind the Operators in the Weapon Roulette session.\n\nFIXED - Blackbeard doesn't get pushed back when colliding with Oryx's Remah Dash with his own dash ability.\n\nFIXED - Blackbeard's H.U.L.L Adaptable Shield can't vault through Osa's Talon-8 Clear Shield.\n\nFIXED - Teammate sprint animation isn't visible to the player in support.\n\nFIXED - Hard Breach Charge is floating on Azami's Kiba Barrier while being destroyed.\n\nFIXED - Instead of sprinting, the Operator seems to walk faster in third-person view.\n\nFIXED - Operator guides are accessed only by using D-pad in Match Replay.\n\n<br>\n\n### LEVEL DESIGN\n\nFIXED - Cubicle walls in 1F Open Area disappear when viewed from EXT Back Alley on the Bank map.\n\nFIXED - Skybox is too dark on several maps.\n\n<br>\n\n### OPERATORS\n\nFIXED - Reload animation for Golden Gun is missing for Operators in the Golden Gun Arcade Mode.\n\nFIXED - Skopós's idle V10 Pantheon Shell doesn't deploy its shield when spawned in 2F Penthouse on the Stadium Alpha map.\n\n FIXED - Skopós's Idle V10 Pantheon Shell doesn't deploy its shield when spawned in 1F Piano Room on the Stadium Alpha map.\n\nFIXED - Skopós's Idle V10 Pantheon Shell doesn't spawn properly in 2F Office on the Stadium Alpha map.\n\nFIXED - Skopós's Idle V10 Pantheon Shell spawns too close to the wall in 2F Lockers on the Stadium Alpha map.\n\n<br>\n\n### USER EXPERIENCE\n\nFIXED - Osa's Talon-8 Clear Shield skin thumbnail is too large to be previewed in the Loadout section.\n\nFIXED - Buck's Elite uniform is not visible on screen previews when selected.\n\nFIXED - Battle Pass Points total boost is at 30% on the After Action Report of Events.\n\nFIXED - Status Change notification on Reputation Tile remains visible when leaving and entering Career tab.\n\nFIXED - Ribbon for \"EXPAND YOUR ROSTER\" remains after operators have been purchased.\n\nFIXED - Tile effect is missing for The Old Stock Weapon Skin in the Battle Pass.\n\nFIXED - Buck's Elite device skin is oversized in the details window for the Elite uniform.\n\nFIXED - Blitz's Elite shield skin is shown twice in the details window for the Elite uniform.\n\nFIXED - Montagne's Elite Shield Skin is shown twice in the details window for the Elite uniform.\n\nFIXED - Negative or unusually high numbers appear for Battle Pass points after any PvP match.\n\nFIXED - User is unable to open related bundle sets.\n\nFIXED - Missing text on the \"Custom Game\" button in the main menu.\n\nFIXED - Title and image are missing on Thorn's Punk bundle modal.\n\nFIXED - Title is missing on Sledge's Strength bundle modal.\n\nFIXED - Commendation Streak action isn't given to players with Reputation Penalties.     \n\nFIXED - Players can't see Reverse Friendly Fire icon for other players if they have their own Reverse Friendly Fire active.\n\nFIXED - Disconnected players don't receive abandon sanctions when a match is cancelled due to the missing player.            \n\nFIXED - Placeholders are present in several sections in the How it Works tab of the Reputation menu.    \n\nFIXED - Mouse scroll doesn't work when hovering over item tile.\n\n<br>\n\n### AUDIO\n\nFIXED - Missing SFX for Blackbeard entering a window while H.U.L.L Adaptable Shield is equipped.\n\nFIXED - Operators sprinting SFX and animation are the same when viewed by an opponent.\n\nFIXED - Bomb SFX can be heard on loading screen before the prep phase.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 5,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/NFdKlD7aNKI9a98ICe8oq/y9s41-patch-notes",
    "date": "2024-12-12T12:15:00.000Z"
  },
  {
    "id": "6MQfBtcDbLYv6CbQxZg3pF",
    "title": "Y9S4 PATCH NOTES ADDENDUM",
    "abstract": "See the changes made over the course of the Y9S4 Season Test Server.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/39EacrmxvHewBJgDU6Rhfl/3d972c0d594a8aaa42c601ede224f7c6/PATCHENOTES_ADDENDUM_Y9S4_960x540.jpg",
    "content": "Here you can find the updates and fixes made over the course of the Y9S4 Season Test Server.\n\n## Y9S4 PATCH SIZE\n\nFind the download sizes for each platform below.  \n\n- Ubisoft Connect: 73.99 GB    \n- Steam: 14.8 GB    \n- Xbox One: 34.4 GB    \n- Xbox Series X: 40.7 GB    \n- PlayStation®4: 39.90 GB    \n- PlayStation®5: 36.74 GB    \n\n## Y9S4.0 PATCH\n\n- Shotguns ecosystem tweaks for PC and Console:\n- ADS Dispersion Cone Reduction: ITA12L, M590A1, M870, SG-CQB, FO-12, SASG-12.\n- Hip-Fire Dispersion Cone Reduction: ITA12L, M590A1, M870, SG-CQB, Supernova.\n- First Shot Reduced: M1014, SPAS12, Super 90, SASG-12.\n- Increased Vertical Recoil after first shot: M1014, SPAS12, Super 90.\n\n## WINDOW BLOCKER\n\n- To reduce toxicity and spawn peeking, players will no longer be allowed to navigate onto window ledges.\n- Vaulting and Hot-Breaching through windows will not be affected\n\n## TEXTURE REFORGE\n\n- A texture reforge has been done which means players will be expecting a larger than usual Patch Size (between 30 and 40GB update).\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Shield doesn't lean with the Operator when holding a grenade when viewed as an Opponent.\n\nFIXED - Blackbeard's H.U.L.L. Adaptable Shield occasionally doesn't block damage from throwable devices.\n\nFIXED - Defender Bots leave the building when player picks Montagne.\n\nFIXED - Barricades and objects behind them aren't destroyed by Impact Grenades thrown underneath them in 2F White Stairs on the Kanal map.\n\nFIXED - Defender Operator animation pauses briefly after being affected by Dokkaebi's Logic Bomb.\n\nFIXED - Goyo's Volcán Canister floats in the air after destroying Azami's Kiba Barrier if the canister is placed on the barrier.\n\nFIXED - Operator change stance when existing Observation Tools.\n\nFIXED - Sens' R.O.U. Projector System VFX and SFX remains when destroyed while being held by Wamai's MAG-NET System.\n\nFIXED - Aiming down sights during free-look causes shaking animations.\n\nFIXED - Hibana's X-Kairos pellets stick to the metal frame of hatches and clip through.\n\nFIXED - Dust VFX is missing in Third Person when using Sledge's Breaching Hammer.\n\nFIXED - Goyo loses points when detonating his Volcán Canister.\n\nFIXED - Player can vault through a single barricade window by breaking part of the barricade and using melee on the frame twice in a row.\n\nFIXED - Devices can't be deployed on debris of a destroyed Deployable Shield.\n\nFIXED - Players can clip through barricades by making a hole in the barricade and rappelling into the wall.\n\n### LEVEL DESIGN     \n\nFIXED - Luggage used as drone vent blockers are destructible and allow for line of sight when removed in 2F Master Bedroom on the Villa map.\n\nFIXED - Attackers can shoot through drone vents due to clipping issues with fire extinguishers used as drone vent blockers in 1F Throne Room on the Theme Park map.\n\nFIXED - Ying's Candelas and Fuze's Cluster Charges can be deployed through metal sheets in 2F Bedroom on the Oregon map.\n\nFIXED - Skopós's idle V10-Pantheon Shell spawns misaligned in 2F Cafeteria on the Yacht map\n\nFIXED - Operators can navigate on top of the fence by vaulting on the white van at EXT Parking on the Clubhouse map.\n\nFIXED - Thermite's Exothermic Charge can't destroy walls at EXT Gardens or EXT Front Balcony on the Emerald Plains map.\n\nFIXED - Players can deploy drones to look through wall in 2F Yellow Stairs on the Consulate Map.\n\nFIXED - Interaction lost for Valkyrie's Black Eye when deployed on a printer that is destroyed on the Bank map.\n\nFIXED - Skopós's idle V10- Pantheon Shell spawns without a shield in 1F Meeting Hall on the Oregon map on Hostage game mode.\n\nFIXED - Operators are able to navigate on top of a container by using Osa's Talon-8 Shield at EXT Generator on the Nighthaven map.\n\nFIXED -Rock texture isn't applied properly in Escape Tunnel B on the Clubhouse map.\n\nFIXED - Skopós's idle V10-Pantheon Shell spawns without its shield in 2F Engine Control on the Yacht map.\n\nFIXED - Skopós's idle V10-Pantheon Shell spawns too close to the wall in 1F Lounge on the Emerald Plains map.\n\nFIXED - Skopós's idle V10-Pantheon Shell is misaligned and clipping with the shield and objective when spawning in B Garage on the Consulate map.\n\nFIXED - Skopós's idle V10-Pantheon Shell spawns without its shield in the 2F Kitchen on the Yacht map.\n\n FIXED - Skopós's idle V10-Pantheon Shell spawns without its shield in the 4F Cockpit and 4F Maps Room on the Yacht map.\n\n### OPERATORS\n\nFIXED - Deimos's arm animation is delayed when aiming down sight of the .44 Vendetta.\n\nFIXED - Blackbeard's H.U.L.L Adaptable Shield doesn't lean with him after breaching a wall.\n\nFIXED - Blackbeard's MK17 reload cancel animation is not working properly.\n\nFIXED - Blackbeard's feet are twisted when breaching from rappel with H.U.L.L Adaptable Shield equipped.\n\nFIXED - Hibana's X-Kairos spins in her hand while she remains idle in the Operator section.\n\nFIXED - Blackbeard's H.U.L.L Adaptable Shield is present in his Guerilla Victory Celebration.\n\nFIXED - Smoke VFX incorrectly displays when using Blackbeard's H.U.L.L. Adaptable Shield breach.\n\nFIXED - Frost VFX from Tubarão's Zoto Canister applies to the scope twice when aiming the CSRX3000 inside the Zoto Canister area of effect.\n\nFIXED - Skopós's idle V10-Pantheon Shell spawns in T-Pose occasionally.\n\nFIXED - Vertical Grip triggers standard magazine reload animation for Nomad's Airjab Launcher.\n\nFIXED - Unable to scan Operators for 3 to 4 seconds after Capitão's Tactical Crossbow Smoke Dart dissipates.\n\nFIXED - Nøkk's HEL Presence Reduction VFX persist occasionally if she is eliminated while the effect is active.\n\nFIXED - Operators can get stuck between a security cart and gun cabinet in the Aiming Lane on the Shooting Range map.\n\nFIXED - Skopós's V10-Pantheon Shell LED lights clip into the shoulder.\n\nFIXED - Oryx can clip through walls to climb a hatch in another room.\n\nFIXED - The LED indicators on Skopós's active V10-Pantheon Shell aren't affected by changes to team color settings.\n\nFIXED - Text prompt is misaligned with the center of the screen when activating Deimos' DeathMARK.\n\nFIXED - Kapkan's arm clips through barricades when deploying Entry Denial Device.\n\nFIXED - Hibana's X-Kairos pellets are red instead of white when equipped with the elite skin.\n\nFIXED - Full reload animation plays instead of the gadget reload for Nomad's Airjab on an ARX200 when the iron sight is equipped with any grip attached.\n\nFIXED - Missing VFX for Sens's R.O.U. Projector System if the projector is destroyed while deploying.\n\nFIXED - Players can clip through the shield of Skopós's idle V10- Pantheon Shell and take damage.\n\n### USER EXPERIENCE\n\nFIXED - The status change notification is missing from the Reputation tile.\n\nFIXED - Attackers enter into a T-pose when equipping Smoke Grenades.\n\nFIXED - Skopós's idle V10-Pantheon Shell blocks players from reinforcing walls from the same side.\n\nFIXED - Skopós's Idle V10-Pantheon Shell blocks players from barricading doorways from the same side.\n\nFIXED - Ping input disappears from the HUD after exiting a damaged Bulletproof Camera.\n\nFIXED - Mute's Signal Disruptor reappears when viewed in Match Replay after being destroyed.\n\nFIXED - Frost's Welcome Mat body reappears when viewed in Match Replay after being destroyed.\n\nFIXED - Thunderbird's Kona Station reappears when viewed in Match Replay after being destroyed.\n\nFIXED - The Hard Breach Charge reappears when viewed in Match Replay after being destroyed.\n\nFIXED - Valkyrie's Black Eye reappears when viewed in Match Replay after being destroyed.\n\nFIXED - Claymore reappears when viewed in Match Replay after being destroyed.\n\nFIXED - Thermite's Exothermic Charge reappears when viewed in Match Replay after being destroyed.\n\nFIXED - Smoke's Remote Gas Grenade reappears when viewed in Match Replay after being destroyed.\n\nFIXED - Several deployable devices reappear when viewed in Match Replay after being destroyed.\n\nFIXED - Defenders see a drop in FPS when Attackers switch Operators.\n\nFIXED - Retro Steel weapon skin appears on the equipped sight in the thumbnail for the .44 Mag Semi-Auto handgun.\n\nFIXED - Blackbeard's H.U.L.L. Adaptable Shield charm is positioned incorrectly in some situations.\n\nFIXED - Operators leave a floating device on the map when viewed in Match Replay if they equip their device then swap back to their primary weapon.\n\nFIXED - Operators have the outline of the opposing team in Spectator mode.\n\nFIXED - Melee weapon clips into the Operator's hand when viewed in Match Replay if they melee and then swap to their Unique Ability.\n\nFIXED - Dropped defuser icon is missing in Spectator mode.\n\nFIXED - Defuser icon in the overhead camera of Spectator mode is different than in the first-person point of view.\n\nFIXED - Equipped weapon skin doesn't update to default if the current equipped weapon skin is sold on the Marketplace.\n\nFIXED - Dust particles floating in the air appear larger than intended.\n\nFIXED - Reconnect button and banner appear while waiting for a match to begin in Siege Cup.\n\n### AUDIO\n\nFIXED - Blackbeard's sprint animation and corresponding SFX aren't in sync when equipped with the MK17.\n\nFIXED - Shooting SFX present when using Maverick's Breaching Torch.\n\nFIXED - Drone landing SFX triggers when previsualizing the jump trajectory.\n\n### KNOWN ISSUES\n\nPC players can tell who is a Console player in their lobby. This and other areas where they can be identified are being addressed in Y9S4.1 patch.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 9,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6MQfBtcDbLYv6CbQxZg3pF/y9s4-patch-notes-addendum",
    "date": "2024-12-03T10:15:00.000Z"
  },
  {
    "id": "5mPizyvgMnc7itNGlIIJPN",
    "title": "Y9S4 Streamer Charms",
    "abstract": "New Rainbow Six Siege Streamer Charms for Y9S4!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2ze0ay3Fj2esnZ8s2K7xiY/25d8ea8ddf3d981559cd577614c94475/-R6S-_Y9S4_Streamer_Charms_-_thumbnail.jpg",
    "content": "# New Rainbow Six Siege Streamer Charms for Y9S4!\n\n## Announcing the next Streamer Charms!\n\nEach season will bring the release of new charms, as well as the return of streamer charms from previous seasons!\n\n## New\n\n![-R6S- Y9S4 Streamer Charms - thumbnail](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2ze0ay3Fj2esnZ8s2K7xiY/25d8ea8ddf3d981559cd577614c94475/-R6S-_Y9S4_Streamer_Charms_-_thumbnail.jpg)\n\n[MeatyMarley](https://www.twitch.tv/meatymarley)\n[ThatOneBritt](https://www.twitch.tv/thatonebritt)\n[TitaniumRolo](https://www.twitch.tv/titaniumrolo)\n\n## Returning\n\n![-R6S- Y9S4 Streamer Charms - 1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/76EkMXQ5RTaBe93r6d5mrp/a924ce84ab89b01d1ac5945da5a55f40/-R6S-_Y9S4_Streamer_Charms_-_1.jpg)\n\n![-R6S- Y9S4 Streamer Charms - 2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4Dnb4zGc5Ujx6FVapBE2Hj/05ab27124b3cf248e2351a0b8c4d8019/-R6S-_Y9S4_Streamer_Charms_-_2.jpg)\n\n![-R6S- Y9S4 Streamer Charms - 3](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4jYtJABNA4BUrHiDwjNhRg/221823f17d94f2db72d2722388734607/-R6S-_Y9S4_Streamer_Charms_-_3.jpg)\n\n![-R6S- Y9S4 Streamer Charms - 4](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6sWyW29OEv727wXqE0EWG3/a30a5992fe53eaf645f1ea06a6c1dbeb/-R6S-_Y9S4_Streamer_Charms_-_4.jpg)\n\n![-R6S- Y9S4 Streamer Charms - 5](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/I96CNcBmHHswQdhQKXUJ7/1e70bb0f5d6a6f0f38705ba9f83048d1/-R6S-_Y9S4_Streamer_Charms_-_5.jpg)\n\n![-R6S- Y9S4 Streamer Charms - 6](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1a0iSeIYB0QWNed9Xxyyl5/d9810159997f6cd24722bf954a28cf96/-R6S-_Y9S4_Streamer_Charms_-_6.jpg)\n\n[Alfredoplays](https://www.twitch.tv/alfredoplays)\n[AnneMunition](https://www.twitch.tv/annemunition)\n[Beaulo](https://www.twitch.tv/beaulo)\n[Bighead](https://www.twitch.tv/bighead033)\n[BikiniBodhi](https://www.twitch.tv/bikinibodhi)\n[Bnans](https://www.twitch.tv/bnans)\n[Braction](https://www.twitch.tv/bractionfps)\n[Drid](https://www.twitch.tv/dridgg)\n[FastAnne](https://www.twitch.tv/fastanne)\n[Gabbo](https://www.twitch.tv/JustGabbo)\n[Heideltraut](https://www.twitch.tv/heideltraut)\n[Interro](https://www.twitch.tv/interro)\n[JerichoFive](https://www.twitch.tv/jerichofive)\n[JessGOAT](https://www.twitch.tv/jessgoat)\n[Jynxzi](https://www.twitch.tv/jynxzi)\n[Just9n](https://www.twitch.tv/just9n)\n[KingGeorge](https://www.twitch.tv/KingGeorge)\n[KittyR6](https://www.twitch.tv/kitty_r6)\n[LagonisR6](https://www.twitch.tv/lagonis)\n[Lil_Lexi](https://www.twitch.tv/lil_lexi)\n[Lt Custard](https://www.twitch.tv/lt_custard)\n[Lusorkoeffizient](https://www.twitch.tv/lusorkoeffizient)\n[MacieJay](https://www.twitch.tv/MacieJay)\n[Mag6](https://www.twitch.tv/mag6)\n[M3ry](https://www.twitch.tv/m3ry)\n[Matimi0](https://www.twitch.tv/matimi0)\n[MrBboy45](https://www.twitch.tv/mrbboy45)\n[Narcoleptic Nugget](https://www.twitch.tv/narcolepticnugget)\n[Nesk](https://www.twitch.tv/neskwga)\n[PaladinAmber](https://www.twitch.tv/paladinamber)\n[Patife](https://www.twitch.tv/patife)\n[Pengu](https://www.twitch.tv/pengu)\n[RazaH](https://www.twitch.tv/razah)\n[REMGURI / 렘쨩](https://www.twitch.tv/remguri)\n[Rubsarb](https://www.twitch.tv/Rubsarb/)\n[SexyCake](https://www.twitch.tv/smexycake)\n[Sha77e](https://www.twitch.tv/sha77etv)\n[Shorty](https://www.twitch.tv/shortyyguy)\n[shroud](https://www.twitch.tv/shroud)\n[SilphTV](https://www.twitch.tv/silphtv)\n[Tatted](https://www.twitch.tv/tatted)\n[Tranth](https://www.twitch.tv/tranth)\n[Varsity](https://www.twitch.tv/varsitygaming)\n[WhiteShark67](https://www.twitch.tv/whiteshark67)\n[yo_boy_roy](https://www.twitch.tv/yo_boy_roy)\n[z1ronic](https://www.twitch.tv/zironicdk)\n[Zander](https://www.twitch.tv/zander)\n[ziGueira](https://www.twitch.tv/zigueira)\n[GarfieldIsDoc](https://www.twitch.tv/garfield)\n[Supr](https://www.twitch.tv/supr)\n[RyyFyy](https://www.twitch.tv/ryyfyy)\n[FoxA](https://www.twitch.tv/foxa_r6)\n[Nerdengenheiro](https://www.twitch.tv/nerdengenheiro)\n[Rainbow6itacom](https://www.twitch.tv/rainbow6itacom)\n[Minimichegga](https://www.twitch.tv/minimichegga)\n[JostRekt](https://www.twitch.tv/jost)\n[JustRyuk](https://www.twitch.tv/justryuk)\n[Paluhh](https://www.twitch.tv/paluhh)\n[Poxonlox](https://www.twitch.tv/poxonlox)\n[TheLionerYT](https://www.twitch.tv/thelioneryt)\n[itsSpoit](https://www.twitch.tv/itsspoit)\n[Retalha](https://www.twitch.tv/retalha)\n[FooYa](https://www.twitch.tv/fooya)\n[IceCold](https://www.twitch.tv/icecold)\n[Athieno](https://www.twitch.tv/athieno)\n[Marciu](https://www.twitch.tv/marciu)\n[Rembeey](https://www.twitch.tv/reembey)\n[rasco100](https://www.twitch.tv/rasco100)\n[Vetelcito01](https://www.twitch.tv/vetelcito01)\n[OneShooter](https://www.twitch.tv/oneshooter)\n[Scythe](https://www.twitch.tv/scythe)\n[Jenz](https://www.twitch.tv/jenz)\n[Frankystrings](https://www.twitch.tv/frankystrings)\n[Eternal_regina](https://www.twitch.tv/eternal_regina)\n[Pxppy](https://www.twitch.tv/eternal_regina)\n[Skyte](https://www.twitch.tv/skyte)\n[Ru_rumiiiin](https://www.twitch.tv/ru_rumiiiin)\n[Anifex](https://www.twitch.tv/anifex)\n[Vetelcito](https://www.twitch.tv/vetelcito01)\n[Priest](https://www.twitch.tv/omgitspriest)\n[Nonomiyamika](https://www.twitch.tv/nonomiyamika)\n[alyttleton](https://twitch.tv/alyttleton)\n\n## Program Update\n\nWe have implemented additional screening procedures into our selection process for streamer charms.\n\nUpon selection for the program, streamer charm candidates' main and alt accounts are now screened for MouseTrap violations, in addition to the other screening steps they undergo for eligibility.\n\n## How to acquire charms\n\nThese charms are only available by subscribing to the respective streamer's Twitch channel with a linked Ubisoft account. For more information on how to link your Ubisoft and Twitch account, as well as opt in for Twitch Drops, please refer to [this FAQ](https://support.ubi.com/Faqs/000035432/Get-your-Twitch-Streamer-s-charm).\n\n## How to get involved\n\nWe have updated the Ubisoft Creators Program registration to open the program to TikTok and Instagram, therefore opening new collaboration opportunities for content creators, streamers, fan artists, and cosplayers from our community.\n\nWe are always on the lookout for content creators that inspire and enrich the Siege community. If you would like access to the perks of being a partnered content creator, and your goal is to one day have a charm in the game, we would like to invite you to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/en-us).\n\nFrom there, complete the following steps:\n\n1. Connect your Ubisoft Account. If you do not have one, you can create one [here](https://connect.ubisoft.com/create).\n\n2. Agree upon the eligibility criteria.\n\n3. Connect your primary channel (Twitch, YouTube, TikTok, Instagram) or secondary channels.\n\n4. Indicate your games preferences.\n\n5. Set your location, broadcast language, and communication language.\n\nYour application will then be submitted and must be approved by Ubisoft. An email will be sent to confirm your participation.",
    "categories": [
      "rainbow-six-siege",
      "community"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5mPizyvgMnc7itNGlIIJPN/y9s4-streamer-charms",
    "date": "2024-11-29T16:30:00.000Z"
  }
]