[{"id":"6Yveu38toC0MdnhkcXOgGl","title":"Rainbow Six Siege Names Tennis Star Daniil Medvedev as Game Ambassador","abstract":"With almost 3000 hours played, Medvedev will have his own themed cosmetic items added to the game, provide feedback on upcoming features, and promote the game.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7m346aFStR9MZzNEIrGVLa/d5bbcf40e123a3cde09cf8cd5571314c/Dani-1.jpg","content":"As [Operation Heavy Mettle](http://rainbow6.com/heavymettle) kicks off, Rainbow Six Siege has announced that tennis star Daniil Medvedev will serve as a Game Ambassador. With almost 3,000 hours logged in Siege so far, Medvedev is an avid competitive player who is currently ranked Diamond, earning his spot among one of the highest tiers of Siege players. As a Game Ambassador, he will partner with the development team to provide feedback on early content and upcoming features. There will also be a Medvedev-themed cosmetic bundle coming in 2024, including a weapon skin, gear, and charm.\n\n\"We're proud and excited to work with Daniil. His creativity and strategically minded play are what make him so exciting both in tennis and in top-ranked matches of Rainbow Six Siege,\" said Director of Business Strategy Mohammed Benhenneda. \"He's the perfect ambassador, representing what makes Siege different from any other game out there.\"\n\n![Daniil Medvedev Ambassador announcement - Dani](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1Ckvz9W0sWvXhF4qgBb3EC/41214e4af8d5085ddb274927cc4778a9/Dani-2.jpg)\n\nTo learn a little bit more about Medvedev's history with Siege and his passion for the game, Ubisoft News interviewed the tennis pro about how much he plays, what he likes about the game, and which map you definitely don't want to see him on.\n\n__When did you start getting into Rainbow Six Siege?__\n\n__Daniil Medvedev:__ I got really into it in 2016; that was the year I really starting putting hours in. All of my friends were playing it, so that attracted me to the game, and as I played it more and more, I fell in love with it.\n\n__When you sit down to play a session, what are you hoping to get out of it? What kind of competitive spirit do you bring to Siege?__\n\n__DM:__ I want to have fun and be competitive. It's in my nature that I want to win at everything, and this game allows both - to have fun combined with the will to win.   \n\n__With all your travel and competition commitments, where and when do you usually find time to play Siege?__\n\n__DM:__  To be honest, I do not play when I travel for tournaments; I would be in trouble, as I would not go to sleep on time, so I only play when I am at home. I wish I could play more, but I also have to practice some tennis.\n\n__Rainbow Six Siege is a game that rewards strategizing in advance and adapting your tactics in the moment. How do you think your tennis career has influenced how you play Siege?__\n\n__DM:__  Timing is very important; like in tennis, you need to find a good moment to attack. And, just as in tennis, you need to make a plan. But if the plan is not working, finding the right time to switch to a new plan is key. I guess my experience as a pro tennis player helps me with this.\n\n__Have you ever tried to recruit any of your coaches or fellow players to join a 5-stack?__\n\n__DM:__  No, they would not be good enough, so I have not asked them to join. I started playing this game with my friends, and we have made some great memories. Spending all this time playing together, you really build a bond.\n\n__What's one piece of advice you'd give players looking to get into Siege or to elevate their game?__\n\n__DM:__  Two things: First, play to win, be competitive. And second, practice your aim.\n\n<b>Fill in the blanks: If you are matched against Daniil Medvedev in Ranked play, you should always ban the  <u>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</u> map because  <u>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</u>.</b>\n\n__DM:__  You should ban Kanal because it's my best map. But don't tell anyone.\n\n*Rainbow Six Siege just launched its latest season,* [*Operation Heavy Mettle*](https://news.ubisoft.com/en-us/article/52yt8qOctpaeT42YMmQ4je/rainbow-six-siege-operation-heavy-mettle-operator-and-gadget-guide). *The game is available now on Xbox Series X|S, PS4, PS5, PC through Ubisoft Connect, Steam, and Amazon Luna, and is included in a* [*Ubisoft+*](https://ubisoftplus.com/) *subscription.*\n","categories":["rainbow-six-siege"],"readTime":4,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6Yveu38toC0MdnhkcXOgGl/rainbow-six-siege-names-tennis-star-daniil-medvedev-as-game-ambassador","date":"2023-09-08T16:00:00.000Z"},{"id":"5GbImX9Jvvoa37Bln41aAa","title":"Y8S3 Patch Notes Addendum","abstract":"See the upcoming changes to Rainbow Six Siege with the release of Y8S2.3","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1Xd1rsLOZpsIHu2ml6dOHO/030a08f464d680a9374348e0d9f62347/thumbnail.jpg","content":"You can find here the updates and fixes made over the course of the Y8S3 Season Test Server.\n\n## Y8S3 Patch Size\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 6.11 GB\n\n- Steam: 5.5 GB\n\n- Xbox One: 5.85 GB\n\n- Xbox Series X: 6.76 GB\n\n- PlayStation 4: 5.45 GB\n\n- PlayStation 5: 5.85 GB\n\n# BALANCING\n\n## SHOTGUN\n\n- *Further tweaks on the ITA12L, Buck's Skeleton key, SG-CQB and the M870 to bring them in line with the rest of the rework.*\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Adaptive Trigger effect for PS5 controllers is missing after changing Operators in Team Deathmatch or Free For All.\n\nFIXED - Players can't finish the Attack tutorial if they eliminate a dummy before the \"Eliminate Opponents\" objective is active.\n\nFIXED - Players can glitch through walls by exploiting an interaction with Exit Rappel and Breach Charges.\n\nFIXED - Zero's Argus cameras hacked by Defenders retain a viewable camera feed when they lose their signal outdoors.\n\nFIXED - Starting the Basics tutorial for the first time will show an ammo counter instead of the infinity symbol.\n\nFIXED - Player's drone can pass through assets and block the completion of the Basics tutorial.\n\nFIXED - The being shot VFX in 1st person last longer while aiming down sight.\n\nFIXED - Bullet spread randomization is missing when hip firing the weapon.\n\nFIXED - The defusing location for the Attack tutorial is too small and close to the bomb.\n\nFIXED - FPS drops when players spin around quickly in B Laundry Room of the Oregon map.\n\nFIXED - The wall button on the interactive panel isn't highlighted when the destructible wall is active in the Shooting Range.\n\nFIXED - Brava doesn't get scoring points when using Jager's Active Defense System or Wamai's MAG-NET System that's been hacked by a Kludge Drone.\n\nFIXED - Scoring doesn't count the 4th device deployed by Amaru, Gridlock or Castle.\n\nFIXED - Weapon SFX loops when players shoot and fast exit rappel at the same time.\n\nFIXED - Players skip reload animation during pick up or weapon swap animation.\n\n### LEVEL DESIGN\n\nFIXED - A stud is visible in 2F Attic of the Oregon map.\n\nFIXED - A stud is visible in 1F Security Corridor of the Oregon map.\n\nFIXED - LOD issue is present in the hallway between 1F Hatch Room and 1F Melee Training of the Basics tutorial.\n\nFIXED - Cliffside spawn point is missing from the Chalet map.\n\nFIXED - A stud is visible in 2F Back Stairs of the Villa map.\n\nFIXED - The Operator gets stuck after navigating across the crates in the Basics tutorial.\n\nFIXED - Defenders are detected as outside at multiple locations on various maps.\n\nFIXED -  Texture flickers on carpet in 1F Open Area of the Consulate map.\n\nFIXED - Laser attachment is visible through the wall  when the Operator is facing it while prone.\n\nFIXED - Metals crates are see-through to Operators in the 2F Server Room of the the Kanal map.\n\nFIXED - Operator gets stuck when jumping onto a balcony at EXT Back Alley on Favela map.\n\nFIXED - Operators can't retrieve the defuser if it's dropped while entering or exiting rappel in specific spots on various maps.\n\nFIXED - Various defuser planting and pickup issues.\n\nFIXED - Various collision, asset, and texture issues on maps.\n\n### OPERATORS\n\nFIXED - Placing Ram's BU-GI below a window can allow players to instantly exit rappel.\n\nFIXED - Ram's BU-GI slides through the air when thrown against uneven surfaces.\n\nFIXED - Solis can't detect Ram's BU-GI when it is held in her hands.\n\nFIXED - Ram's BU-GI loses functionality after being dropped while Ram is holding it.\n\nFIXED -  Ram's BU-GI gets stuck in multiple walls and assets on various map.\n\nFIXED - Ram's BU-GI is unable to completely destroy the walls located in 1F Joint Corridor of the Theme Park map.\n\nFIXED - When Ram holds the first BU-GI and attempts to change its trajectory, the HUD trajectory icon doesn't update.\n\nFIXED - Ram's BU-GI is unable to completely destroy the wall located in between 1F Lounge and 1F Garage of Clubhouse map.\n\nFIXED - Ram's BU-GI is unable to break the wooden walls located in 2F Ceramic Gallery of the Country Club map.\n\nFIXED - Ram's BU-GI gets stuck in the wall located in 2F Day Care of the Theme Park map.\n\nFIXED - Castle's Armor Panels aren't destroyed by Ram's BU-GI.\n\nFIXED - When Ram eliminates a player with the BU-GI, the kill cam zooms on the BU-GI at random intervals.\n\nFIXED - Scoring points aren't awarded when Operators destroy Goyo's Volcan Canister by destroying a barricade it's placed on.\n\nFIXED - Fenrir's F-NATT Dread Mine clips through the floor, making it harder to spot.\n\nFIXED - Grim's Kawan Hive Launcher doesn't ping opponents inside the swarm until affected by the decay debuff.\n\nFIXED -  Hibana's X-Kairos pellets go through the cubicles in the 2F Admin Office of the Consulate map.\n\nFIXED - Frost's Welcome Mat doesn't deploy properly when dropped on top of the defuser.\n\nFIXED -  A Bulletproof Camera affected by a hacked Signal Disruptor shows glitched VFX even after the Signal Disruptor is destroyed.\n\nFIXED - Brava's Kludge Drone looks higher and lower than intended.\n\nFIXED - Ping doesn't display the right color when used on Goyo's Vulcan Canister.\n\nFIXED - Echo's Yokai Drone doesn't move properly when exiting the Observation Tools mid-jump and then re-entering.\n\nFIXED - Brava's Kludge Drone loses signal when moved outside after re-hacking it from Mozzie's Pest.\n\nFIXED - Missing VFX feedback when spectating Nokk when HEL Presence Reduction is active.\n\nFIXED - Fenrir's F-NATT Dread Mine location displays as a placeholder when deployed outside of EXT Terrace of the Kafe Dostoyevsky map.\n\nFIXED - Drones don't recover from a lost signal status when reclaimed from Mozzie's Pest using Brava's Kludge Drone.\n\nFIXED - Sledge's Breaching Hammer can't destroy Iana's Gemini Replicator.\n\nFIXED - Valkyrie's Black Eyes are turned off when hacked outside by Brava's Kludge Drone.\n\nFIXED - Osa's Talon-8 shield can't be guard broken if Opponent is prone or crouched while Osa is standing while holding the Talon-8 Shield.\n\nFIXED - Grim's Kawan Hive Launcher ammo counter always shows 0 during replay.\n\nFIXED - Grim's Kawan Hive Launcher doesn't accurately ping the opponent's location if they're scanned by a drone.\n\nFIXED - Grim's Kawan Hive Launcher still pings Opponents if Grim is eliminated while deploying a canister.\n\nFIXED - Brava's Kludge Drone doesn't display HUD feedback when aiming at devices through certain assets.\n\nFIXED - Sen's R.O.U. Projector System doesn't destroy projectors if deployed more than once.\n\nFIXED - Operator video missing for Smoke.\n\nFIXED - Various animation issues.\n\n### USER EXPERIENCE\n\nFIXED - Can't navigate to the main menu sections by pressing the up arrow or up on the D-pad of a controller while viewing an item in full screen.\n\nFIXED - EXT Construction Site name is missing from the tile when selecting the spawn location on the Oregon map.\n\nFIXED - Ram's default uniform has some visual issues.\n\nFIXED - The main room of the elimination trial for the Basics tutorial displays the wrong compass location.\n\nFIXED - The area before entering 1F Hatch Room in the Basics tutorial displays the wrong compass location.\n\nFIXED - The compass location is missing when the Compass Appearance option is set to Simplified.\n\nFIXED - Chat input functionality is lost and the cursor disappears if the user types in chat or has the player side-panel open when the Planning Phase transitions to the Preparation Phase.\n\nFIXED - Pronounced shadows are present on Operators when viewed from the Operators section.\n\nFIXED - Dread Factor is displayed as the season name on Ram's showcase in the Operator section.\n\nFIXED - The animation in the Home section flickers before resetting.\n\nFIXED -  Players under level 5 can't reconnect to a custom online match.\n\nFIXED - Player commendations appear unresponsive when attempting to commend a player a second time.\n\nFIXED - Multiple actions can't be bound to the same button in Customize Controls menu.\n\nFIXED - Crosshair disappears when trying to aim down sight multiple times after getting eliminated.\n\nFIXED - Custom games can't be created using non-Latin characters in the playlist name.\n\nFIXED - The unread notification from Challenges doesn't refresh after exiting and re-entering the Challenges section.\n\nFIXED - Various spectator mode issues.\n\nFIXED - Various UI issues.\n\nFIXED - Various customization issues.\n\n__AUDIO__\n\nFIXED - SFX loop when players are eliminated while downed.\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game), [Reddit](https://www.reddit.com/r/Rainbow6/), [Facebook](https://www.facebook.com/Rainbow6/) and on our[forums](https://discussions.ubisoft.com/category/609/rainbow-six-siege?lang=en-US).).","categories":["rainbow-six-siege"],"readTime":8,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5GbImX9Jvvoa37Bln41aAa/y8s3-patch-notes-addendum","date":"2023-08-29T15:45:00.000Z"},{"id":"1QKBL9wr6IRWbCg5tGHM4P","title":"New Rainbow Six Siege Streamer Charms for Y8S3!","abstract":"Announcing the next Y8S3 Streamer Charms!","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7wLp1GWoC6bmNiELqAES7f/4fb8f894895f10264197ff52e546a92a/Y8S3.StreamerCharms.Header.png","content":"\n## Announcing the next Streamer Charms!\n\nEach season will bring the release of new charms, as well as a return of the streamer’s charms from previous seasons!\n\n# New\n\n![[R6S] News Article - Y8S3 Streamer Charms - updated header - img](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6AMVz56TI4Oac4Wtb70bGg/c2901a60e1b43cfaf000dbac877f26ad/Y8S3.StreamerCharms.Header.png)\n\n[Rembeey](https://www.twitch.tv/reembey)\n\n[rasco100](https://www.twitch.tv/rasco100)\n\n[Vetelcito01](https://www.twitch.tv/vetelcito01)\n\n[OneShooter](https://www.twitch.tv/oneshooter)\n\n## Returning\n\n![[R6S] News Article - Y8S3 Streamer Charms - updated 1 - img](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7ayZM7UMPNMCGSNB3WIYM9/db2f4d980a62f6043bcba9d6e4016b97/Y8S3_Streamercharms_Updated1.png)\n![[R6S] News Article - Y8S3 Streamer Charms - updated 2 - img](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7LlW0JZ0YLDAbfopRpNqYA/9c462bd6414e1e7ff65fda690a808b41/Y8S3_Streamercharms_Updated2.png)\n![[R6S] News Article - Y8S3 Streamer Charms - updated 3 - img](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7wzL1p0aa8Tjc1BomMxZfu/5804b5c6011ac8d92cfb314a11660e07/Y8S3_Streamercharms_Updated3.png)\n![[R6S] News Article - Y8S3 Streamer Charms - updated 4 - img ](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7jxpackRUCsPIk02iZPexI/4f4a0f5f0111615afa9c39264b089780/Y8S3_Streamercharms_Updated4.png)\n\n[Ad9m](https://www.twitch.tv/ad9m)\n[Alfredoplays](https://www.twitch.tv/alfredoplays)\n[AnneMunition](https://www.twitch.tv/annemunition)\n[Beaulo](https://www.twitch.tv/beaulo)\n[Bighead](https://www.twitch.tv/bighead033)\n[BikiniBodhi](https://www.twitch.tv/bikinibodhi)\n[Bnans](https://www.twitch.tv/bnans)\n[Braction](https://www.twitch.tv/bractionfps)\n[CCSesports](https://www.twitch.tv/ccsesports)\n[Drid](https://www.twitch.tv/dridgg) \n[FastAnne](https://www.twitch.tv/fastanne)\n[Gabbo](https://www.twitch.tv/JustGabbo)\n[Heideltraut](https://www.twitch.tv/heideltraut)\n[Interro](https://www.twitch.tv/interro)\n[JerichoFive](https://www.twitch.tv/jerichofive)\n[JessGOAT](https://www.twitch.tv/jessgoat)\n[Jynxzi](https://www.twitch.tv/jynxzi)\n[Just9n](https://www.twitch.tv/just9n)\n[Kalera](https://www.twitch.tv/Kalera)\n[KingGeorge](https://www.twitch.tv/KingGeorge)\n[KittyR6](https://www.twitch.tv/kitty_r6)\n[LagonisR6](https://www.twitch.tv/lagonis)\n[Lil_Lexi](https://www.twitch.tv/lil_lexi)\n[Lt Custard](https://www.twitch.tv/lt_custard)\n[Lusorkoeffizient](https://www.twitch.tv/lusorkoeffizient)\n[MacieJay](https://www.twitch.tv/MacieJay)\n[Mag6](https://www.twitch.tv/mag6)\n[M3RYLAND](https://www.twitch.tv/M3RYLAND)\n[Matimi0](https://www.twitch.tv/matimi0)\n[MrBboy45](https://www.twitch.tv/mrbboy45)\n[Narcoleptic Nugget](https://www.twitch.tv/narcolepticnugget)\n[Nesk](https://www.twitch.tv/neskwga)\n[PaladinAmber](https://www.twitch.tv/paladinamber)\n[Patife](https://www.twitch.tv/patife)\n[Pengu](https://www.twitch.tv/pengu)\n[RazaH](https://www.twitch.tv/razah)\n[REMGURI / 렘쨩](https://www.twitch.tv/remguri)\n[Rubsarb](https://www.twitch.tv/Rubsarb/)\n[SexyCake](https://www.twitch.tv/smexycake)\n[Sha77e](https://www.twitch.tv/sha77etv)\n[Shorty](https://www.twitch.tv/shortyyguy)\n[shroud](https://www.twitch.tv/shroud)\n[SilphTV](https://www.twitch.tv/silphtv)\n[Tatted](https://www.twitch.tv/tatted)\n[Tranth](https://www.twitch.tv/tranth)\n[Varsity](https://www.twitch.tv/varsitygaming)\n[WhiteShark67](https://www.twitch.tv/whiteshark67)\n[yo_boy_roy](https://www.twitch.tv/yo_boy_roy)\n[z1ronic](https://www.twitch.tv/zironicdk)\n[Zander](https://www.twitch.tv/zander)\n[ziGueira](https://www.twitch.tv/zigueira)\n[GarfieldIsDoc](https://www.twitch.tv/garfield)\n[Supr](https://www.twitch.tv/supr)\n[RyyFyy](https://www.twitch.tv/ryyfyy)\n[FoxA](https://www.twitch.tv/foxa_r6)\n[Nerdengenheiro](https://www.twitch.tv/nerdengenheiro)\n[Rainbow6itacom](https://www.twitch.tv/rainbow6itacom)\n[Minimichegga](https://www.twitch.tv/minimichegga)\n[JostRekt](https://www.twitch.tv/jostrekt)\n[JustRyuk](https://www.twitch.tv/justryuk)\n[Paluhh](https://www.twitch.tv/paluhh)\n[Poxonlox](https://www.twitch.tv/poxonlox)\n[TheLionerYT](https://www.twitch.tv/thelioneryt)\n[itsSpoit](https://www.twitch.tv/itsspoit)\n[Retalha](https://www.twitch.tv/retalha)\n[FooYa](https://www.twitch.tv/fooya)\n[IceCold](https://www.twitch.tv/icecold)\n[Athieno](https://www.twitch.tv/athieno)\n[Marciu](https://www.twitch.tv/marciu)\n\n## How to acquire charms\n\nThese charms are only available by subscribing to the respective streamer’s Twitch channel with a linked Ubisoft account. For more information on how to link your Ubisoft and Twitch account, as well as opt in for Twitch Drops, please refer to [this FAQ](https://support.ubi.com/Faqs/000035432/Get-your-Twitch-Streamer-s-charm).\n\n## How to get involved\n\nWe are always on the lookout for additional content creators to add to the program. If your goal is to see your charm in game, we use the following criteria to begin the selection process for potential candidates:\n\nThis is an evolving program so to reflect this, the following requirements have been adjusted.\n\n__Requirements to be considered__\n-\tApproximately 150+ concurrent viewers.\n-\tAverage of 10 Rainbow Six streams per month.\n-\tAverage of 20 hours of Rainbow Six streamed per month.\n-\tPositive standing with Ubisoft/Rainbow Six Siege.\n-\tHigh quality level of content.\n-\tTwitch Partnered.\n-\tRainbow Six Siege reserves the right for final decision.\n\n__Consideration for Removal__\n-\tLess than 10 Rainbow Six Siege main streams over 3 months.\n-\tLevel of quality dropping below an acceptable level.\n- \tStanding with Rainbow Six Siege/Ubisoft compromised.\n-\tAny actions that may negatively affect the R6S/Ubisoft brand.\n-\tLoss of Twitch Partnership.\n-\tRainbow Six Siege reserves the right for removal of any charms.","categories":["rainbow-six-siege","community"],"readTime":3,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1QKBL9wr6IRWbCg5tGHM4P/new-rainbow-six-siege-streamer-charms-for-y8s3","date":"2023-08-25T14:45:00.000Z"},{"id":"dnwatjKhLBCgGuHopFmls","title":"Classified: Balancing Team - Year 8 and Beyond","abstract":"Setting out the philosophy and vision of the Balancing team.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/sjFBWBDhqbhfqDsI03qfZ/36ed48541ff7c6620141d42956a3e8f9/Classified_Balance_header_960x540.v2.png","content":"## BALANCING PHILOSOPHY & OBJECTIVES\n\nIn Rainbow Six Siege, every operator is an expert, with a focused proficiency that gives them strength: very strong in the right situations but with flaws in the wrong ones. Our balancing philosophy is all about providing you with the right set of tools to confront very specific situations: for any situation you encounter in the game, there should be wide (but also limited) solutions.\n\nThis year, we aim to __reduce the strong jack-of-all-trades operators__ to ensure every decision you make has a thoughtful process behind it. We also want to continue to __enhance the game's tactical playstyle by__ __working towards balancing solutions which emphasize the importance of our operator's gadgets__.\n\nYou will find more details on our vision and plans below, as well as a rundown of our priorities for the rest of Year 8.\n\n## YEAR 8 AND BEYOND\n\n### ATTACHMENTS, ADS & FRAGS\n\nWe are aware of current community concerns surrounding the 1.5x sight. While your attachment choices should be meaningful, it shouldn't drive your operator pick. To this end, the Balancing team has been working over the past few months on new vectors to balance our operators and their loadouts.\n\nRight now, both Frag Grenades and the 1.5x sight are highly utilized and can have a large effect on the success and presence of an operator. Swapping these between loadouts is a short-term solution, and we are currently taking the time needed to polish a larger set of changes that will bring more sustainable balancing levers, allowing us to make less \"binary\" changes in the future. The team is actively working on a solution for this complex and entrenched issue in the game's meta.\n\n### OPERATOR BALANCING & TACTICAL GAMEPLAY\n\nWe recognize that a number of operators such as Iana, Azami, Warden, Solis and Blackbeard, don't feel right at the moment, and of course Recruit shares a similar position. We are in the process of prototyping effective solutions to make these feel balanced and worthy.\n\nIn an upcoming mid-season update, we'll be making a number of short-term adjustments to help boost operator presence and variety, or to reign it in where needed.  In parallel to this, we have longer-term plans in the pipeline for our weaker and more powerful operators. These plans will help to reinforce the tactical gameplay that Siege is known for, bringing the focus back to gadgets and utilities. With this, running and gunning will come with increased risk and difficulty.\n\nThere is a considerable amount of work to be done until we can bring all those solutions to the live server due to the nature of some of these changes. In the meantime, we continue to bring you balancing updates by selecting topics which, on one hand, allow us to make the necessary adjustments to the meta and work towards this goal, and on the other hand, aren't taking too much time or resources away from these longer-term plans and priorities.\n\n## COMING UP IN YEAR 8 AND MORE\n\n### Y8S3 - GRIM BUFF (PART 2) - KAWAN HIVE LAUNCHER\n\nWith part one of Grim's buff released in Y8S2, it's now time to look at what's next. In Y8S3, we will enable Grim to switch the firing mode on the Kawan Hive Launcher, with the alternative mode making Kawan Hives bounce off of surfaces rather than sticking to them. The update will increase Grim's versatility, giving players the ability to bounce Kawan Hives around corners and removing the line of sight requirement. This change completes our current vision for Grim and we're looking forward to seeing how players make use of this evolution.\n\n### Y8S3.3 - FROST'S WELCOME MAT REWORK\n\nAfter internal play sessions and a release on the Test Server, we felt like there was still work to be done on the Frost rework, and so we have made meaningful adjustments for the final release.\n\n__WHAT HAS CHANGED?__\n\n- Increased self-revive time\n\n- Extended and made the debuff more severe after self-reviving\n\n- Allowing teammate revive, cancelling the debuff activation\n\nThese changes make self-reviving from a Welcome Mat a much more dangerous and rewarding feat. It will allow Frost players more time to react, and this coupled with the increased debuff, will make sure that players don't want to fall victim to the traps. At the same time, with a teammate revive being an enticing option, Frost players are still going to find those \"double kill\" opportunities.\n\nWe'll be releasing this rework during Y8S3 and carefully evaluating Frost's performance throughout the season.\n\n__WHY DOES THE WELCOME MAT NEED A CHANGE?__\n\nCurrently, if an attacker falls victim to a Welcome Mat, a player is left trapped, out of options, and effectively removed from the action. We don't want players to feel helpless in any situation; an operator should always have options, even if they are limited. With this being the case, we feel that a change to the way that Welcome Mats work is needed, in order to improve the experience for stricken players. With this change we're enabling players to take action, giving them the ability to remove themselves from the Welcome Mat, however, during and after their attempted escape, players are going to feel vulnerable. Critically though, with the usual sound cues and the addition of blood trails, the huntress can still be ready to take care of her foes.\n\n### Y8S3 - FUZE'S CLUSTER CHARGE\n\nFuze packs high fire power but can still feel limited in many circumstances. To improve Fuse's usability, Cluster Charges will be able to be deployed on Deployable Shields and Osa's Talon-8 Shields, providing new strategic possibilities for players to find and utilize.\n\n### Y8S3 - SHOTGUNS\n\nWe'll also be reworking all shotguns in Y8S3 (excluding the BOSG 12, TCSG12, and ACS12) with the goal of bringing more consistency to the weapon type. This change will make aiming down sights more rewarding, while decreasing the effectiveness of hip-fire. You can find more in-depth information on this change [here](https://rainbow6.com/designersnotes/y8s3).\n\n### Y8S4 - SHIELD REWORK\n\nWe want shield operators to feel strong, while taking away the feeling of powerlessness when facing off against them; In a one-on-one situation, a player should feel that they have a chance against a shield operator, and on the other side, a shield operator should not be bullied without consequence or risk. Changes such as removing hip-fire while the shield is out will help to remove frustrations on both sides of the battle, and reinforce the idea that with a team around them, a shield operator can be a true force to be reckoned with.\n\n### YEAR 9 - AZAMI'S KIBA BARRIER\n\nKiba Barriers have allowed Azami to become one of the strongest operators in the defender lineup, giving her the ability to control areas and create angles which are difficult for opponents to deal with and see. We'll be making changes to decrease the robustness of her gadget and to give attackers the option to play more aggressively against her. Once these changes are ready, we'll be testing and evaluating them with community feedback, ensuring that they are effective and balanced.\n\n## CONCLUSION\n\nCommunity concerns are our concerns: we are refactoring and making proactive changes behind the scenes to answer the feedback you are sharing with us to make siege this unique tactical shooter experience we all enjoy.","categories":["rainbow-six-siege"],"readTime":7,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/dnwatjKhLBCgGuHopFmls/classified-balancing-team-year-8-and-beyond","date":"2023-08-22T16:00:00.000Z"},{"id":"1589JIZN3Llr2uizo0hs9N","title":"“I may not have a family, but I have Redhammer.” – Ram","abstract":"Break through to the other side in Operation HEAVY METTLE, where nothing can stand against the unstoppable force that is our newest attack Operator: Bo-Ram Choi.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3ToiYMR4ivAYRQnXybI3ZW/b38d1236f752046c01f28fc0ccff3369/Y8S3_HeavyMettle_OperatorKeyart.jpg","content":"Break through to the other side in Operation HEAVY METTLE, where nothing can stand against the unstoppable force that is our newest attack Operator: Bo-Ram Choi. \n\nJoining the REDHAMMER team, Ram is just as relentless as she is protective of her team, and nothing speaks to these qualities more than the newest device she brings to the field The BU-GI AUTO BREACHER. Once deployed, the BU-GI destroys all devices and breakable objects in the way, making Ram a terrifying destruction Operator. With 3 HEALTH, 1 SPEED and the option to bring the STUN GRENADE Ram moves with intent and deadly precision, and whatever the BU-GI can't destroy, she has the answer with the HARD BREACH CHARGE as another option for her loadout. The R4C and MK1 9mm are safe choices for her, but when she wants to get loud in a way only REDHAMMER can, she has the LMG-E and ITA 12s as options for her loadout. \n\nThe BU-GI AUTO-BREACHER is a miniature tank that can be deployed anywhere, and will destroy any breakable objects in the way, including floors. Ram can deploy the BU-GI from a safe position and then set the trajectory, letting destruction run Rampant without her need to be there. Defense Operators are going to want to rely on SOLIS' SPEC-IO ELECTRO-SENSOR to spot the device before it's activated and destroy it with IMPACT GRENADES or can rely on GOYO'S VOLCAN CANISTER to stop the push that follows the BU-GI. \n\nFrom Busan, South Korea, she grew up in orphanages and served in the Republic of Korea Armed Forces the moment she came of age. Raising quickly through the ranks, she was recruited in to an all-female CTU unit known as Tarantula. Ram has now found her new family in REDHAMMER, a family that appreciate her destructive force and fierce focus.\n\nCheck out the destructive power of Ram on Test Servers starting August 14<sup>th</sup>.","categories":["rainbow-six-siege"],"readTime":2,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1589JIZN3Llr2uizo0hs9N/i-may-not-have-a-family-but-i-have-redhammer-ram","date":"2023-08-14T16:00:00.000Z"},{"id":"2Btj0mP7e7gVKIODGSLuiX","title":"Y8S3 Designer’s Notes","abstract":"In this latest edition of Designer’s Notes, we'll go into detail about the balancing changes that’ll come with the Y8S3 patch and give you some insight into the reasons behind them","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/sde2TZ01fJMeuROBfY7Qi/5c6336fedab1e597d9f349ead0922080/image-2023-08-09-11-14-14-463.png","content":"In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y8S3 Update and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n### WIN DELTA VS. PRESENCE\n\n![[R6S] News - Y8S3 Designer’s Notes - BalancingMatrix_Att - Video](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/30OCLazuhixNzrWmArWgzL/2b88ece25ac60854d0c6d7019fa7fe17/R6S_DN_Y8S3_BalancingMatrix_Att.mp4)\n\n![[R6S] News - Y8S3 Designer’s Notes - BalancingMatrix_Def - Video](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3UYi1wvbmr3Kfbi8SuzReZ/acd6297fb0b248d464782438645817b5/R6S_DN_Y8S3_BalancingMatrix_Def.mp4)\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n# OPERATOR BAN RATE\n\n![[R6S] News - Y8S3 Designer’s Notes - BanMatrix_Att - Video](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6zwpkY1GTGqomS0xdzgqc/e1619fbbcd0ccb7fc14b9a021e06cc66/R6S_DN_Y8S3_BanMatrix_Att.mp4)\n\n![[R6S] News - Y8S3 Designer’s Notes - BanMatrix_Def - Video](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6ogtBXvIknNcbj8mTmXW1P/8868121e1dd1e55615b04c29cfc628dc/R6S_DN_Y8S3_BanMatrix_Def.mp4)\n\n## MESSAGE FROM THE TEAM\n\n* * * * *\n\nWe've been observing both Iana and Warden's continuous ascent to the top tiers of presence in matches. We are aware of the situation and the issues behind it.\\\nIana's high presence is mainly driven by her access to Frag Grenades, while Warden's high presence relates to the strength of 1.5x sights on Defender loadouts. The Community's sentiments over this topic are in alignment with ours. These operators need changes, and we will take action in an upcoming mid-season patch to make sure they feel less like \"must picks\" and more like weighted choices within a squad's lineup.\n\nThis mid-season patch adjustment is aimed at allowing more operator diversity in matches in the short term, but we are working in parallel on a bigger solution that will attend the balance situation of Frag Grenades and the 1.5x sight within Siege. Both elements are widespread through our lineup of operators, and we know that shuffling them around is not a sustainable solution, that is why we are taking the time to polish a more substantial set of changes that should open up more balancing options allowing us to make less \"binary\" changes in the future.\n\n## OPERATOR BALANCING\n\n### FUZE\n\n#### CLUSTER CHARGE\n\n-   Can be deployed on Deployable Shields and Talon Shields\n\nNow that Fuze can deploy the Cluster Charge on reinforcements, we will also allow him to do it on Deployable shields and Talon Shields. It is a small change but will create a new synergy between Fuze and Osa, allowing the use of his charges in places that weren't possible before. Though there is a cost. As with any other bulletproof glass, the Cluster Charge will shatter the shields when the drilling is successful.\n\n### ZERO\n\n#### ARGUS CAMERA\n\n-   Can pierce through Deployable Shields and Talon Shields.\n\nThis change won't have a huge impact on matches, but it will bring consistency to the rules of piercing, if the gadget can get through reinforcements, it should also be capable of piercing Deployable and Talon Shields. Since the piercing action of the Argus Camera cannot shatter Mira's Black Mirror, then the same rule applies to shields, so they won't shatter either.\n\n### GRIM\n\n#### KAWAN HIVE LAUNCHER\n\n-   Switch Ability Mode to Sticky (default) or Bouncy\n\nOne of the main weaknesses of Grim is the need to have line of sight with the location you want to activate the Hive in. With this update, we are introducing a new firing mode to address this. From now on, Grim can select if the projectile will stick or bounce after touching a surface. This adds to all the changes done in the previous season and will help you to apply the effect on your target.\n\n### LESION\n\n#### BASE STATS\n\n-   Gadget refill timer Reduced to 20 seconds (from 30)\n-   Max resources Increased to 9 mines (from 8)\n\n#### GU MINE\n\n-   Gadget type is now Mechanical (unaffected by EMPs)\n-   Initial damage Increased to 5hp (from 0)\n-   Poison damage Increased to 12hp (from 8)\n-   Poison timer Reduced to 2 seconds (from 2.5)\n-   Cloaking removed\n-   HUD Icon removed\n-   Stepping on a GU Mine while being affected by another will reset the Poison timer and deal the Poison damage instantly.\n-   Added Area of Effect feedback\n\n#### LOADOUT\n\n-   Added Super Shorty as a secondary weapon option\n\nDying because of something invisible is a source of frustration and is why we removed the initial damage from the GU mine at the beginning of Year 5. But this change also removed a situation we've been trying to recover for some time: the fear of stepping on multiple mines in a row.\n\nWe have reintroduced the initial damage and made stepping on multiple mines a bit spicier. If you are already poisoned by a GU mine and trigger another, you will receive the initial damage and an instant tick of poison damage from the one already on your foot, so you will need to be more careful. These 2 changes turn the mines into a threat again. We are also tweaking some extra values, like the poison damage and the timer, to make removing the nail more urgent.\n\nBecause of these changes we have decided to remove the cloaking completely, making GU mines always visible. This should eliminate the frustration and increase the skill ceiling, as you will need to look for good locations to place your mines. This also removes the only electronic part of the device, so IQ won't be able to detect them, and Brava won't be able to hack them.\n\n## GADGET BALANCING\n\n### DEPLOYABLE SHIELD\n\n#### BASE STATS\n\n-   Bulletproof Glass: Hitting the shield with a melee will shatter the glass windows.\n\nWe have taken the opportunity to update the Shattered Glass System for Deployable Shields along with the changes to Fuze. If the shield receives a melee hit, the glass of the windows will be shattered.\n\n## WEAPON BALANCING\n\n### SHOTGUNS\n\n#### BASE STATS\n\n-   Every shotgun excluding the BOSG 12, TCSG12 and ACS12 have had the following changes.\n-   Ranges are normalized into 3 stages.\n\n-   0-5 meters, each pellet deals 100% of the base damage\n-   6-10 meters , each pellet deals 75% of the base damage\n-   13 meters and above, each pellet deals 45% of the base damage\n\n-   Headshot modifier: A pellet getting the headshot modifier deals 1.5x the damage after its range modifier.\n-   Hip fire spread has been revisited and redistributed across the board.\n-   Shooting while aiming down sight results in a tighter spread across the board. Note that this effect is not new, just being increased to reward players when aiming down sights.\n-   Moving increases the spread.\n\nThis is a big pass on every classical shotgun in the game. With these changes we are adding consistency and something you can learn. Ranges are normalized and based on the average kill distance in the game as well as the m590A1, which we know is a favorite at this time. The goal here is to reward good practices such as aiming for the head or holding angles. These changes are aimed at making shotguns less spray and pray, and more worthy as an option without removing what is currently working.\n\n## PLAYLIST ECOSYSTEM UPDATE\n\n### QUICK MATCH\n\nAs announced during the year 8 reveal, we started to look at how we could change Quick Match to make it much more... well \"Quick.\" We realized that we needed to make tweaks to other playlists for this new Quick Match to fit.\n\n#### BASE CHANGES\n\n-   Action phase reduced to 165s (from 180).\n-   Operator pick phase duration reduced to 20s (from 30). Additionally, if the round did not involve a role swap, the operator pick phase is reduced to 15s.\n-   Preparation phase reduced to 30s (from 45).\n-   Objective locations are automatically revealed for attackers at the start of the round.\n-   Clearance Level availability increased to CL 10\n-   We have made some tweaks to the matchmaking algorithm for Quick Match to find matches quicker.\n-   We will be applying a soft reset to the casual skill level algorithm to bring everyone closer together, which should result in finding matches even faster.\n\nWe are also taking this chance to implement 2 new concepts to the Quick Match playlist: __Pre-Setups__ and the __Attacker Safeguard__\n\n__PRE-SETUPS__\n\nFor every map in the map pool, we have designed 2 sets of pre-setups for every bombsite (this new feature is bomb exclusive) which include a number of pre-deployed reinforcements on the map as well as pre-placed rotations and holes.\\\nThese new pre-setups will allow defenders to jump into the action right away without having to worry about reinforcing the entire site.\n\n__ATTACKER SAFEGUARD__\n\nAttackers in Quick Match will no longer have to worry about possible spawn peaks or runouts at the beginning of the round as we are implementing 10 seconds of invulnerability at the start of the Action Phase (for attackers only). An attacker will become vulnerable again after those 10 seconds __or if that attacker enters the building__. This way, attackers will be able to approach the building without having to check every window.\n\nWe are also extending the already known \"Red Walls\" for 10 additional seconds to keep defenders from exiting the building while the attackers are making their approach.\n\nThese changes are aimed at making Quick Match a place in Rainbow Six: Siege that allows you to jump straight into the action and jump out to another match. We want players to feel that they can have their R6 fix easier, without having to worry about the basic and repetitive actions of a normal Siege match.\n\nAdditionally, we wanted to address the fact that some of the more classic maps in the casual map pool will not be included in the new Quick Match. We know that losing access to these maps can be frustrating and we will actively work towards adding them back to the map pool as soon as they are ready with their own new pre-setups.\n\n### STANDARD (PREVIOUSLY UNRANKED)\n\nPart of this update includes changing what was previously Unranked and giving it a new identity inside Rainbow Six: Siege. With the Quick Match updates, we were losing a place in the game to experience a core Siege match outside of the Ranked environment, that's why we decided to shift Unranked into what we now call the \"Standard\" playlist.\n\nStandard will now also be the recommended playlist for new players coming into the game.\n\n#### BASE CHANGES\n\n-   Removal of Operator and Map ban phases.\n-   Overtime rounds changed to 1 (from 3).\n-   Clearance Level availability changed to CL 0.\n-   We are renaming the competitive cluster to \"Tactical\" in order to better inform players about the type of playlists that can be found inside.\n\n* * * * *\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).","categories":null,"readTime":10,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2Btj0mP7e7gVKIODGSLuiX/y8s3-designers-notes","date":"2023-08-13T22:00:00.000Z"},{"id":"hmLtXQucpD05WszOadhAO","title":"Y8S2 Mid-Season Roadmap Update","abstract":"Check out what's coming to Rainbow Six Siege in the Y8S2 Mid-Season Roadmap Update.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/17BpR9amZDVbV8xlGp7Mhb/c5587b8f52be4cfc4afa0944bf1eedd2/Y8S2_Midseason_Roadmap_Update.png","content":"Each season, as we introduce new content, we are also providing an updated Roadmap to ensure transparency on upcoming features. When making those adjustments, we are considering multiple factors, including your feedback.\n\nToday's update is mainly to confirm that everything announced for Season 3 will be released as planned. We also wanted to provide additional insights on what to expect from the upcoming Operation. Please keep in mind that we also have a few surprises coming shortly, which are not displayed in the Roadmap below, so stay tuned for more!\n\nLet's now dive into this mid-season Roadmap update.\n\n![[R6S] Y8S2 Mid-Season Roadmap Update Midseason Roadmap](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1jHAvFCGJvytt58qF9StwK/ae582db73a4329771ad25233b14aed47/Y8S2_Midseason_Roadmap_Asset__1_.png)\n\n## ROADMAP UPDATES\n\n### [MAIN FEATURE] QUICK MATCH 2.0\n\n- Status: confirmed for Y8S3\n\nQuick Match 2.0 is ready for a release in Season 3. As announced back at the SI, it is a package of improvements which aim to speed up the playlist, making it more agile without affecting the Siege experience. We also have more game modes updates coming in Season 3, so get ready for some surprises!\n\n### [PLAYER PROTECTION] PLAYER COMMENDATION SYSTEM\n\n- Status: confirmed for Y8S3\n\nIf you follow us on social media, you might have seen some exciting news regarding the future of the Reputation System, in which we are including the new Player Commendation System. This new feature coming in season 3 will promote community recognition and encourage pro-social behavior, reinforcing that Rainbow Six Siege is a cooperative game. A full overview of the feature will be shared during the upcoming reveal panel.\n\n### [PLAYER PROTECTION] REPUTATION SYSTEM IMPROVEMENTS\n\n- Status: confirmed for Y8S3\n\nAlongside the system-wide rebalance update, the Reputation System, which is currently in Beta phase, will be getting some improvements for a more accurate calculation of a player's Standing. \n\n### [BALANCING] GRIM BUFF PART II\n\n- New earlier target delivery: Y8S3\n\nDuring our last Roadmap update, we announced that a new buff for Grim would be coming in two parts. Part I successfully released during Y8S2 and while Part II was set to release in Y8S4, it will be coming earlier than anticipated, in Y8S3. More details will be given soon, but be prepared to evade those bees!\n\n### [BALANCING] REWORK OF OPERATOR FROST\n\n- Status: confirmed during Y8S3\n\nAfter the feedback received from the Lab TS, we've decided to make some changes and rebalanced Operator Frost in Season 3. This new rework will be released during Season 3. It won't be exactly what some of you have tested on the Lab TS, so stay tuned for more info on what changes we will be bringing to those Welcome Mats.\n\n### [PLAYER COMFORT] FREE CAMERA UPDATE\n\n- Status: confirmed for Y8S3\n\nAs announced during the Y8S2 Reveal Panel, a new feature will allow players to hide the HUD when using the Match Replay feature and will provide the ability to run a free camera. We know that many of you cannot wait to test it out and create content with this new feature, which is why we are bringing it to you in Season 3!\n\nWe have even more content planned for Season 3 and 4, make sure to watch the Year 8 Season 3 Reveal on August 13 and join the discussion on [Twitter](https://twitter.com/Rainbow6Game/), [Threads](https://www.threads.net/@rainbow6game), [Instagram](https://www.instagram.com/rainbow6game_us/), [Reddit](https://www.reddit.com/r/Rainbow6/), [Discord](https://discord.gg/rainbow6) and [Facebook](https://www.facebook.com/Rainbow6/).\n\nFor a recap of all the changes coming your way, check out the [public Roadmap](http://rainbow6.com/roadmap).","categories":null,"readTime":3,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/hmLtXQucpD05WszOadhAO/y8s2-midseason-roadmap-update","date":"2023-08-03T13:50:00.000Z"},{"id":"1MwSYw0xxnbncvKzgdhJZS","title":"Reputation System Beta: System Balancing","abstract":"Details on our system balancing and how it affects players.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3Aew8jqPMbQu36rVqdl7U2/c4d7366860a671ee189c24225252c93a/Reputation.System.Balancing.960x540.png","content":"# SYSTEMWIDE REBALANCING\n\nToday, the Reputation System Formula will be updated to pave the way for new changes and initiatives that will be coming in future seasons. Multiple changes will be coming into effect, leading to exciting new improvements and more accurate Reputation Standings for players. \n\n### WHAT WE'RE CHANGING\n\nWe have rebalanced the way we account for various actions in the system, ultimately affecting how easy it is to attain the highest Standings of Esteemed and Exemplary. \n\nWe have also made changes to certain measures that affect when penalties will be triggered. With the new updates, the point at which a player triggers a penalty will be more consistent.\n\n### HOW WILL THIS AFFECT PLAYERS\n\n- After this update, players' Reputation Standings may have changed. Playing fairly and respecting others is key to helping raise a player's Standing.\n\n- Repeat offenders may rapidly trigger a penalty. Avoiding further disruptive actions will be vital to maintaining a good Standing.\n\n## TO SUMMARIZE\n\nWith this major rebalancing, many players will be seeing a change in their Reputation Standing, with some disruptive players also accelerating the triggering of penalties. This is a deliberate result of our latest Reputation System update. We're working to ensure that this system works well for all players, and we know that with the efforts of our community, together, we can build a great experience for everyone . \n\nThe Reputation System remains in its Beta phase and will keep on evolving as we move forward. In the future, we will be bringing greater visibility and control to players and additional ways for you to interact with one another in prosocial ways. \n\nWe remain committed to ensuring a safe environment for all players.","categories":["rainbow-six-siege","toxicity","dev-blogs"],"readTime":2,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1MwSYw0xxnbncvKzgdhJZS/reputation-system-beta-system-balancing","date":"2023-07-26T21:00:00.000Z"},{"id":"2HyWwS7OTwTKx3q8CZ7auZ","title":"Y8S2.3 Patch Notes","abstract":"See the upcoming changes to Rainbow Six Siege with the release of Y8S2.3","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7EB8njQeeD4HxP0H99NTZj/7e5b96fb4089439e51e5901c2584c1cd/Y8S2.3_PatchNotes.960x540.png","content":"See the upcoming changes to Rainbow Six Siege with the release of Y8S2.3.\n\n## Y8S2.3 Patch Size\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 1.12GB\n- Steam: 1.5 GB\n- Xbox One: 1.36 GB\n- Xbox Series X: 1.64 GB\n- PS4: 1.65 GB\n- PS5: 1.57 GB\n\n## OPERATOR BALANCING \n\n### VIGIL\n\n-   Vigil will share the same glitching behavior as Nøkk.\n-   The ERC-7 Video Disruptor will not be deactivated when performing certain actions, such as shooting, and instead will trigger the glitch effect on cameras.\n-   Vigil won't be immune to Lion's EE-ONE-D and Grim's Kawan Hive. Both gadgets will detect him, but he can prevent being pinged by activating the ERC-7.\n\n### NØKK\n\n-   The HEL gadget ability no longer reduces movement sounds.\n-   Maximum duration increased to 20 seconds (from 12).\n-   Added new glitching sources, such as being flashed or pushed.\n-   Nøkk is no longer immune to Alibi's Prisma. It will detect her, but she can prevent being pinged by activating her the HEL gadget.\n\n### THORN\n\n-   Added 1.5x sight to the UZK50GI.\n\n### ORYX\n\n-   Increased hatch climb speed by 30%.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Missing unlimited ammo in the Snipers Arcade after joining a match in progress.\n\nFIXED - Devices are detected outside when placed on the back wall of 2F Main Stairs in the Skyscraper map.\n\n### USER EXPERIENCE\n\nFIXED - The Battle Pass map flashes on screen when going to the Progress section.\n\nFIXED - Error received when accepting a Squad invite from a player that was part of the same Squad in a previous match.\n\nFIXED - Various Shop and Customization issues.\n\n---\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game), [Reddit](https://www.reddit.com/r/Rainbow6/), [Facebook](https://www.facebook.com/Rainbow6/) and on our[forums](https://discussions.ubisoft.com/category/609/rainbow-six-siege?lang=en-US).).","categories":["rainbow-six-siege","patch-notes"],"readTime":2,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2HyWwS7OTwTKx3q8CZ7auZ/y8s23-patch-notes","date":"2023-07-11T10:45:00.000Z"},{"id":"35sHyBXl9SbG9hiIL6cnQZ","title":"Y8S2.3 Designer’s Notes","abstract":"In this latest edition of Designer’s Notes, we'll go into detail about the balancing changes that’ll come with the Y8S2.3 patch and give you some insight into the reasons behind them","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1JYGe6HEzihl4dmMlIj6OL/681f095d24218da67de680b7277ae2ac/R6_DesignersNotes_Y8S2.3_Header_1920X1080.jpg","content":"In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y8S2.3 Update and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n## WIN DELTA VS. PRESENCE\n\n![[R6S] Y8S2.3 Designer's Notes - BalancingMatrix Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7Au3Sm38gfTTyfUPiHNsJn/18cde1d5293597b410e2b5531ce50e38/R6S_DN_Y8S2.3_BalancingMatrix_Att.mp4)\n\n![[R6S] Y8S2.3 Designer's Notes - BalancingMatrix Def v2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4LPDaTIZ44cvn8WfSrtlw2/6be069a0e9f1c85833d1b946885b1b99/R6S_DN_Y8S2.3_BalancingMatrix_Def_v2.mp4)\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n# OPERATOR BAN RATE\n\n![[R6S] Y8S2.3 Designer's Notes - BanMatrix Att v2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3tcBlaabwfYKSQaLXYuTNz/650adce6d4501c9b9a0e417c2319bc69/R6S_DN_Y8S2.3_BanMatrix_Att_v2.mp4)\n\n![[R6S] Y8S2.3 Designer's Notes - BanMatrix Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1NRxVU0VVHJHU4GNNQHDqT/c4d3292cc2f012cc538d71af41e81397/R6S_DN_Y8S2.3_BanMatrix_Def.mp4)\n\n## OPERATOR BALANCING\n\n### THORN\n\n__UZK50GI__\n\n-   Sights: Added 1.5x.\n\nThorn is currently one of the least picked trappers on defender lineups, we've decided to boost her loadout by adding a 1.5x sight to the UZK50GI, this should increase her popularity within the trapper ecosystem.\n\n### NØKK\n\n__HEL Presence Reduction__\n\n-   Remove silent steps while the ability is active.\n-   Increase duration of the ability to 20s (from 12)\n-   Update glitching reasons\n\nDeception is always a controversial topic and Nøkk's ability is conceived around it. She can become invisible to observation tools and at the same time mute her footsteps. She is leading some of the main frustration for defenders and we would like to tackle this. In a quiet environment everyone should be able to hear someone else approaching, and Nøkk's ability to move silently breaks this rule. We've decided to remove the silent facet of the ability in exchange for increased ability duration.\"\n\n### VIGIL\n\n__ERC-7__\n\n-   On observation tools Vigil will share the same glitching effect as Nøkk.\n-   The ability won't deactivate while performing certain actions, like shooting, and will instead trigger the glitch effect on observation tools.\n-   Vigil won't be immune to Lion's EE-ONE-D or Grim's Kawan Hive. Both gadgets will detect him, but he can prevent being pinged down by activating the ERC-7.\n\nNøkk and Vigil share a similar ability, and in the pursuit of consistency, we've decided to extend Nøkk's cloaking rules to Vigil. With this change Vigil will glitch on observation tools while performing actions like shooting, deploying a gadget or sprinting. These new interactions will reward players that proceed more carefully while using the ERC-7 and will punish those who act more careless.\n\n### ORYX\n\n__Hatch Climb__\n\n-   Reduced hatch climb interaction time by 30%.\n\nOur game data shows that Oryx does not profit much from his ability to climb hatches. We would like to make this interaction smoother by reducing its recovery time, now it should feel less dangerous to perform.\n\n---\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).","categories":["community"],"readTime":3,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/35sHyBXl9SbG9hiIL6cnQZ/y8s23-designers-notes","date":"2023-07-06T13:45:00.000Z"},{"id":"5PnOXwp69RWHaeN0EoDmZF","title":"Reputation System Beta: Status Update – July 2023","abstract":"What we’ve done and will be doing with the Reputation System Beta.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6yeNSdaqJdAkWmR18lGy2s/21a89891025bf931733e6a3033437aa0/Reputation.System.Update.960x540.png","content":"## DURING Y8S1\n\n### PLAYER STANDING STABILITY\n\nSince the release of the Reputation System Beta, we've made several shadow updates to not only improve the foundations of the Reputation System, but also the stability of player Standings and this has continued throughout Y8S1.  During Y8S1, we made further changes to ensure that the occurrence and severity of a player's negative actions align with an equally severe impact on a player's Standing. We want players to have confidence in the system, so while adjusting the effects that certain actions have on a player's Reputation Standing, our goal is to make sure that Standings don't change match to match, time after time. As well as this, it's crucial that Standing changes are still happening when warranted and that the presence of the system is felt by abusers.\n\n### ADDITIONAL DETECTIONS\n\nWe are now tracking additional conditions to help increase our knowledge of players' disruptive actions. One such high-impact example of this is a player instigated crashes that are indicative of DDOS attacks. Being able to track a wider range of actions completed by a player such as DDOS, text abuse, leaving matches, and more, has allowed us to build a more robust overview of a player, enabling us to take more appropriate actions to mitigate abuse, and to help foster a more positive experience for all.\n\n### ACTION HISTORY\n\nIn the early days of the Reputation System, we were looking at a limited time period when deciding whether to give a penalty. This was due both to a limitation of the system and a desire to ensure that only the worst of the worst offenders would be receiving penalties. In the time since, the Reputation System has become more robust, and we have seen a great response to reputation penalties. Because of this, we have updated the ranges over which the system checks for negativity. The result of this longer and more dynamic 'memory' of the Reputation System is that the system will be more accurate in delivering penalties to a larger group of offending players and will make bypassing the system more difficult.\n\n## Y8S2 AND ONWARD\n\n### IN-MATCH PENALTY VISUALS\n\nIn Operation Dread Factor, we've made numerous quality of life changes to help players more clearly understand when and what penalties are active and more.\n\n__Y8S2 Updates__\n\n- Activation banner appears on the first round rather than every round\n\n- Active Penalty Banner renamed to Penalties from Warnings\n\n- Active Penalty banner disappears shortly after a round begins\n\n- Active Penalty icons remain for match duration.\n\n- Penalty pop-ups will appear when returning to the main menu. If a pop-up was missed, it will appear after launching the game.\n\n### Looking Forward\n\nAs we move forward with the Reputation System, we will continue to release updates in multiple areas. The Y8S2 update has already brought UI improvements for the reputation penalties and as we progress, we will continue to perform systemwide rebalancing as needed. In Y8S3 we will be introducing several new features that aim to improve players' insight into their Reputation Standing and create new opportunities to interact. We continue to be focused on delivering on our core goal of improving player experience in Rainbow Six Siege.","categories":["rainbow-six-siege","anti-cheat"],"readTime":3,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5PnOXwp69RWHaeN0EoDmZF/reputation-system-beta-status-update-july-2023","date":"2023-07-05T16:00:00.000Z"},{"id":"3OjUdY5s7KG9atPnXYucXK","title":"Classified: Player Protection Updates - Year 8 and beyond","abstract":"What we're doing to protect players in Year 8 and beyond.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/79kqLiDw3o93uO1X0mia2w/076923d937fb38a67db863b66572fa66/Classified_header_960x540.v2.png","content":"## A YEAR IN REVIEW \n\nOne of the top complaints of PvP shooter players across the entire genre is cheating and toxic behavior. In the space of a single session, one cheater can ruin the experience for hundreds if not thousands of players. Over the last 12 months, Rainbow Six Siege and its Player Protection team have reoriented the way we think and develop features to address this challenge. This has led to the development of two industry-first systems, which we call MouseTrap and QB. These two systems have already had an enormous positive impact on the health of our game. Research and development undertaken has resulted in a suite of current and planned initiatives that are bringing creative and sometimes counter-intuitive solutions to problems that have plagued PvP shooter fans for years. \n\nThis isn't the end of the journey, but the start. Player protection is a never-ending battle and arms race, but our belief on the Siege development team is that this is one of the most important places to innovate --- both as a game, and as an industry. \n\nBelow we will share some of our learnings from these two systems, as well as updates in our Reputation System, and give some insight into how our players are driving our choices and about some of the new initiatives we are working on for the coming year.  \n\nThe Player Protection team on Rainbow Six Siege has worked diligently to address the feedback from our community and ensure transparency along the way. \n\n## RECENT RELEASES \n\n### MouseTrap\n\nMouseTrap has been live for close to 3 months now. This feature launched mid-season with Operation Commanding Force (Y8S1.2 update) on April 11, 2023. We wanted to give you a brief update on how it's going and what we have learned. \n\nMouseTrap is a new detection system which penalizes the use of Mouse and Keyboard on console by adding extra input latency (or lag) to players detected, encouraging them to switch back to using their controller. Our objective is to restore a true balance between competition and skill to improve fair play in Rainbow Six Siege. \n\nWe are very satisfied with MouseTrap's detection capabilities so far. We expected to see a moderate reduction in the number of spoofers at launch with preliminary results estimated at 30% to 50%. However, the data we've gathered has surpassed these expectations and has shown a major reduction in the amount of Mouse and Keyboard users on consoles.  \n\nThere has been a __78% reduction in the total spoofers (Mouse and Keyboard users) detected__ __in Rainbow Six Siege__. If we look at __Ranked on its own, the reduction is similar; 73% fewer spoofers than before__.  \n\n![[R6S] Classified: Player Protection July 2023 - MnKUsageChart](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3gxRRG3kb75iYn7Iqp9vUI/71896ec060ec619b388539672c3c3d60/MnKUsageChart.960x540.png)\n\nWhen first we announced this feature, many were wondering why we chose to penalize Mouse and Keyboard users instead of banning them. We wanted to give these players the chance to change their behavior and play fairly. Today, we are able to confirm that this approach and new system has indeed contributed to a behavioral change: once detected by MouseTrap, many users are returning to their controllers or switching to PC. Our data shows that after a first penalty, 43% of penalized players will continue to play the game without ever getting any further penalties.  \n\nIf you've been hesitant to play Ranked on console before or if you're thinking of returning to the game after some time away, now is the perfect time to give it a try as this means there are fewer Mouse and Keyboard players on console now than at any time in the last few years.  \n\nWe are dedicated to ensuring fairness in Rainbow Six Siege and are aware of current community concerns with MouseTrap. We are currently working to deploy a fix for the reported issue as soon as possible.\n\n### QB\n\nReleased on November 8, 2022, QB is one of our latest PC anti-cheat features which aims to make cheat development more tedious. We've seen great results from this system which has already contributed to the ban of over 10 000 cheaters, and we are only getting started! We've also been made aware that several cheat vendors have stopped creating cheats for Siege following this update and have been getting a lot of positive feedback from our community regarding their in-game experience since the deployment of this feature. We are, however, continuously monitoring this system to identify opportunities for improvement.  \n\n### Reputation Penalties\n\nReducing in-game toxicity has been a major focus for our Player Protection team this year, both in terms of abuse around friendly fire and unwanted communications. Since March 8, 2023, players who engage in voice chat abuse after two warnings receive a penalty and have their voice chat muted to others by default for the next 30 matches. This penalty is complementary to the written chat penalty introduced in the game in Year 7 on October 2022.   \n\nBoth penalties aim to reduce unwanted communication and the impact of offenders by informing these players, via a set of in-game warnings and feedback, of how they are perceived by others for them to change and adapt their behavior before they get sanctioned by the game. The data gathered so far on this feature indicate that the addition of those penalties has indeed contributed to reducing toxicity in Rainbow Six Siege: __half of the players who received a first warning for Voice or Written chat abuse have been dissuaded from continuing to abusing it__.   \n\nThis is also reflected in our first Reputation Penalty around reverse friendly fire, which aims to reduce cases associated with recidivists who injure too many teammates by abusing certain mechanism across several matches. \n\nLooking to Year 9, the Reputation System will continue to evolve. We'll be working to add further sources that we can use to help increase the coverage of the system and ultimately safeguard player safety and enjoyment. \n\n![[R6S] Classified: Player Protection July 2023 - WarningsBarChart.v2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4rTSWrp07KjMSj0mfzJZLL/ac12e01aa3cf9b0894dfcb1d5e439c19/WarningsBarChart.v2.960x540.png)\n\n## COMING UP IN YEAR 8 \n\nWe are committed to ensuring a safe environment and fair experience for all players, many features are currently being developed to reinforce players' protection and will be released throughout Year 8.  \n\n__[New] Player Commendation System -__ The Player Commendation System is a new appreciative system that will be made available in Y8S3 (Autumn 2023). With this feature, we want to reinforce and encourage positivity in our community by allowing players to recognize others at the end of a match based on their experience. \n\n__[Update] Reputation System -__ The Reputation System will get several updates this year. Y8S2 has already brought Reputation Penalty UI improvements and we will continue to support the system with ongoing rebalancing. In both Y8S3 & Y8S4, we will be introducing new features which will help players to better understand their Reputation Standing and while also bringing additional opportunities to interact with this system. \n\n__[New] Privacy Mode on Console -__ Privacy Mode, a feature to help protect streamers and players who are looking for additional privacy in-game was made available on PC last year with Y7S2 Operation Vector Glare and will be coming to console before the end of Year 8.  \n\n__[Update] Ranked Requirements -__ Phone number validation has seen a successful implementation, though our work protecting Ranked continues. During Year 8 & 9, we will be taking the first steps to start a new foundation in safeguarding the competitive integrity of the game. As part of this, we will be bringing multiple new measures which will also aim to address smurfing. Crucially, we'll be reinforcing these foundations with new initiatives throughout Year 9. Not only will this support our current Anti-Cheat efforts, but it will also encourage returning players to rediscover Siege before jumping into competition, therefore improving the ranked experience for all players. More information about this update will be revealed later this year. \n\nStay tuned during the rest of Year 8 and beyond to discover more updates to make Rainbow Six Siege fair and safe for everyone. Follow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) or [Instagram!](https://www.instagram.com/rainbow6game)","categories":["community","anti-cheat","toxicity"],"readTime":8,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3OjUdY5s7KG9atPnXYucXK/classified-player-protection-updates-year-8-and-beyond","date":"2023-07-05T15:50:00.000Z"},{"id":"686r3S9cT83J0K8SUdE0PX","title":"Y8S2.2 Patch Notes","abstract":"See the upcoming changes to Rainbow Six Siege with the release of Y8S2.2.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/19gbzG4CGEoGej7pKQ8nxi/18331aa2ff56cf03b8f867a1583127ad/Y8S2.2_PatchNotes.1920x1080.jpg","content":"## Y8S2.2 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 1.32 GB\n- Steam: 0.97 GB\n- Xbox One: 1.19 GB\n- Xbox Series X: 1.53 GB\n- PS4: 1.93 GB\n- PS5: 1.45 GB\n\n## FEATURES\n\n__Defuser Pickup option__\n\nThis new option lets players decide the defuser pickup behavior from these choices:\n\n-   Automatic\n-   Manual\n-   Both (Default setting)\n\n## TWEAKS AND UPDATES\n\n__Playlists__\n\nModified the calculation of Squad matchmaking ratings to ensure fairer matches.\n\n__Player Protection__\n\nSanction messaging in the match feed will no longer mention BattlEye™ and instead use more generic messaging while still listing the sanction reason.\n\n## BUG FIXES\n\n### OPERATORS\n\nFIXED - Small gap on the left side of Mira's Black Mirror when deployed in the center of the reinforced walls.\n\nFIXED - Kali's CSRX 300 has excessive lateral recoil on consoles.\n\nFIXED - Lesion can reinforce walls and put up barricades in the team deathmatch game mode.\n\nFIXED - Fenrir receives additional scoring points each time he redeploys the F-NATT Dread Mine.\n\n### GAMEPLAY\n\nFIXED - In Article 5, matchmaking between Sony and Xbox is possible when players have crossplay matchmaking turned off.\n\nFIXED - Gap can be created after destroying the soft part underneath a reinforcement.\n\nFIXED - Stacking 10 Observation Blocker will block bullets. \n\n### LEVEL DESIGN\n\nFIXED - Exploitable line of sight on stacked supply crates at EXT Garage in Consulate map.\n\nFIXED - Unfair line of sight when using Azami's Kiba Barrier on the door frame in 2F Solarium on Chalet map.\n\nFIXED - Unfair line of sight when using Azami's Kiba Barrier on the door frame in 1F Bar stock on Chalet map.\n\nFIXED - Players can destroy devices on the other side of a reinforced wall by destroying the breakable floor underneath it.\n\n### AUDIO\n\nFIXED - Wrong footsteps SFX if another player is on a different floor.\n\nFIXED - No SFX play when Attacker uses a melee attack on Castle's Armor Panel.\n\nFIXED - Various Audio issues. \n\n### USER EXPERIENCE\n\nFIXED - Toggle for match replay missing from custom games.\n\nFIXED - The Tactical Timeout scoreboard is empty in custom games.\n\nFIXED - Various UI Issues.\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).\n","categories":["rainbow-six-siege"],"readTime":3,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/686r3S9cT83J0K8SUdE0PX/y8s22-patch-notes","date":"2023-06-26T23:00:00.000Z"},{"id":"5wcmbNXPSZwYWBYRrrFz48","title":"Y8S2.1 Patch Notes","abstract":"See the upcoming changes to Rainbow Six Siege with the release of Y8S2.1.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/013g3MqAH5sdAGRoqlI8SP/e5ed0a221136b1072583e2923ca5b30f/Y8S2.1_PatchNotes.jpg","content":"## Y8S2.1 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 0.92 GB\n- Steam: 0.69 GB\n- Xbox One: 1.00 GB\n- Xbox Series X: 1.23 GB\n- PS4: 1.13 GB\n- PS5: 1.10 GB\n\n## FEATURE\n\n__Custom game team mixer__\n\n- New button added to allow hosts in custom online games to randomize teams.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Grim is missing from the Operators roster in the Golden Gun game mode.             \n\nFIXED - Dummy Health option doesn't affect newly spawned dummies. \n\nFIXED - Terrain destruction is not reproduced when players join a match in progress.       \n\nFIXED - Players get trapped when spawning at 1F Vending Stair of the Nighthaven map.  \n\nFIXED - FPS drops when Solis' SPEC-IO Electro Sensor scans Sens' R.O.U. Projector System.            \n\nFIXED - Opponents can activate devices that stick to walls from behind barricades.            \n\nFIXED - Barricades are destroyed after shooting 20 bullets into a specific spot to avoid the \"vault\" prompt.\n\nFIXED - Loadout is randomized when eliminated for the first time in an arcade match in progress and spawning as a random Operator.\n\nFIXED - Various Team Deathmatch issues.\n\n### LEVEL DESIGN\n\nFIXED - Defenders are detected outside when navigating in B Old Office of the Villa map.\n\nFIXED - Unfair line of sight can be gained using Azami's Kiba Barrier to vault on to a table at 2F Yellow Stairs of the Consulate map.\n\nFIXED - Record player can't be broken at 1F Lounge of the Emerald Plains map.\n\nFIXED - Unintended line of sight towards 1F Visa Office through the drone vent on the eastern wall at EXT Parking of the Consulate map.\n\nFIXED - Exploitable line of sight from a table at 1F West Corridor of the Consulate map.\n\nFIXED - Exploitable line of sight on stacked supply crates at 1F Piano Room of the Consulate map.\n\nFIXED - Players get stuck in the generator after rappelling at EXT Garage Way of the Consulate map.\n\nFIXED - Players can spawn kill from 2F catering on players exiting Police Line spawn of the Consulate map.\n\nFIXED - Collison, asset, and texture issues on various maps.\n\n### AUDIO\n\nFIXED - SFX missing when hitting Azami's Kiba Barrier with a shield.\n\nFIXED - Multiples voice lines plays when Fenrir's F-NATT Dread Mine is thrown.\n\nFIXED - Voice chat audio comes from Windows default devices instead of selected options in-game.\n\nFIXED - Incorrect SFX play when Brava's Kludge Drone hacks Fenrir's F-NATT Dread Mine.\n\nFIXED - Various audio issues.\n\n### OPERATORS\n\nFIXED - Ace's S.E.L.M.A. Aqua Breacher can't break wooden floors with carpet over it.\n\nFIXED - Bailiff 410 reloads faster when activating Fenrir's F-NATT Dread Mine.\n\nFIXED - FPS drop occurs when Clash's CCE Electro-Shield ability is spammed.\n\nFIXED - Fenrir's F-NATT Dread Mine location appears as placeholder when placed in EXT Coast Guard Roof of the Kanal map.\n\n### USER EXPERIENCE\n\nFIXED - Multiple strings of text are missing from the Battle Pass progression tab.\n\nFIXED - stick input when rotating camera in match replay doesn't reflect the input by user.\n\nFIXED - Players get an error after accepting an invite from a player that was previously in their Squad.\n\nFIXED - Various Shop and Customization issues.\n\nFIXED - Various UI issues.\n\n<br>\n\n---\n\n<br>\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) or [Reddit](https://www.reddit.com/r/Rainbow6/).","categories":null,"readTime":4,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5wcmbNXPSZwYWBYRrrFz48/y8s21-patch-notes","date":"2023-06-13T10:50:00.000Z"},{"id":"2a3lU8IsZwX1zEHj1Mg6h7","title":"COMMUNITY ARTIST BUNDLE PROGRAM Y8S2: NOTAMUTEMAIN","abstract":"Learn more about the Y8S2 Community Artist Bundle - designed by Notamutemain for the operator Mute.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/696tONK2F4gK9qkf9WLafU/5b50d91b2cde77e0c3330d219b13387c/R6S_Y8S2_CommunityArtistBundle_ArticleHeader.jpg","content":"The Community Artist Bundle Program continues in Year 8 and is bringing yet another amazing operator bundle made in collaboration with Notamutemain! Starting June 12th, his Mute bundle will be available to redeem for a limited time on the dedicated Rainbow Six Siege [Prime gaming page](https://gaming.amazon.com/rainbowsixsiege).\n\nWith this program, we want to celebrate our amazingly creative and dedicated community artists and give them the chance to have their art styles represented in-game. Each chosen artist will have the opportunity to design a full set for an operator of their choice and the resulting bundles will become available during Year 8.\n\nDon't forget to have a look at our previous bundles if you haven't yet: [SAU_SIEGE](https://rainbow6.com/artistbundle_y6s1), [Sunstark](https://rainbow6.com/artistbundle_y6s2), [FrAgMenT](https://rainbow6.com/artistbundle_y6s3), [Pericote](https://rainbow6.com/artistbundle_y6s4), [Shinosaaaaaaang](https://rainbow6.com/artistbundle_y7s1), [Siege Tales](https://rainbow6.com/artistbundle_y7s3), [Retrodisaster](https://rainbow6.com/artistbundle_y7s4) and [LevaSoj](https://rainbow6.com/artistbundle_y8s1).\n\n![[R6S] - Y8S2 Artist Bundle - Notamutemain Bundle](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2F7Ovl5qhLvD4LZoqFIvWZ/d9ba7964adc7d635620ffbe70153bc22/R6S_CommunityArtist_notamutemain_Marketing-Visuals-v4.jpg)\n\nNotamutemain's Mute operator bundle includes:\n\n- Uniform\n- Headgear\n- M590A1 weapon skin\n- Charm\n\n### HOW TO REDEEM THE BUNDLE\n\n__HOW TO REDEEM THE BUNDLE__\n\nThe Notamutemain operator bundle will be available via Prime Gaming for a __limited time__, starting __from June 12th__. \n\nPrime Gaming members will be able to claim this exclusive set for free. If you're not a Prime member yet, you can sign up for a free trial. \n\nA Renown Booster is currently available from Prime Gaming until __June 12th__ so don't forget to claim this too! \n\nHere's how you can get these Prime Gaming offers:\n\n- Link your Ubisoft and Amazon accounts [here](https://gaming.amazon.com/rainbowsixsiege).\n- Redeem the respective offer through Prime Gaming [here](https://ubi.li/1sIMQ).\n- Receive the content automatically in-game within 48 hours.\n\n### ABOUT THE ARTIST\n\nShaun E, known in the Siege community as Notamutemain despite Mute being his top played operator, found art as a great creative outlet since he was young. Inspired by community artists such as Sunstark, he began posting Siege-related fanart in July of 2018. From this date, Shaun rapidly honed his artistic skills, leading to many opportunities. He collaborated on multiple occasions with Ubisoft, from having an early look at Flores to create a promotional fanart, to being a part of the Siege Champions program, and finally working on a bundle for Mute!\n\nShaun uses thick outlines and line art to create his bold, colorful artwork. He gets his inspirations from comic books and expressive artwork with movement and weight.\n\nAs a queer individual, Shaun wanted to represent the LGBTQ+ community in his bundle. He pulled inspiration from the artist Tom of Finland, who had a large influence on the late 20th century gay culture. Many symbols of the queer community have been included in this bundle, from the leather biker cap to the transgender symbol. Shaun was also influenced by the punk movement and used some of its distinctive symbols - spikes and chains, slogans of resistance, graffiti and spray paint motifs - to represent the LGBTQ+ community's resistance to oppression and persecution.\n\nThere's also a distinct clash of art styles reflecting his identity as a Chinese-American artist. We can note the Chinese expression present on the weapon skin that can be translated to \"Paint the dragon, dot the eyes\"; it is taken from a story which meaning refers to the lack of one small element from the creation that would make it perfect. Shaun is a very driven artist, but he likes this story to remind himself: even when the perfect detail seems to evade him, he can still look back and be proud of what he accomplished.\n\nToday, Shaun is leaving his mark on Rainbow Six Siege with this bundle and the symbols incorporated in it, making it a very meaningful and personal representation of who he is.\n\nDon't forget to have a look at Shaun's [Twitter](https://twitter.com/notamutemain) and [Instagram](https://www.instagram.com/notamutemain/) accounts to see more of his incredible art!\n\n![[R6S] - Y8S2 Artist Bundle - Prime Gaming Asset](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4oLdtHome6InTnlJdCNgtm/d332f18748ea446579faedfe7c58793b/Y8S2_ArtistBundle_Primegaming_Asset.jpg)\n\n### FAQ\n\n__What is the Community Artist Bundle Program?__\n\nThe Community Artist Bundle Program launched in Y6S1 and it brings operator bundles created by some of our most talented and dedicated Siege fan artists into the game.\n\n__I'm a Siege fan artist too - what can I do to get selected as well?__\n\nGiven the length of our production cycle for in-game content, the fan artists for Year 8 have already been determined. However, we are always on the lookout for future participants. If your goal is to see your bundle in-game, continue showing us your passion and strive to be an outstanding member of the Siege community. We have multiple ways for our dedicated community artists to get more involved with the game, such as the Ubisoft Star Player Program.\n\n__How can I get the Y8S2 Notamutemain operator bundle?__\n\nLink your Ubisoft account with your Amazon account [here](https://primegaming.ubisoft.com/) and claim the operator set through [Prime Gaming](https://ubi.li/1sIMQ) starting from June 12th. After successfully redeeming the content, it will be available in your in-game inventory within 48 hours. Players must have Mute available as an operator.\n\n__Can I buy the Notamutemain operator bundle with Renown or R6 Credits as well?__\n\nThe Notamutemain operator bundle is exclusive to Prime Gaming for a limited time only and can be obtained via the Prime Gaming offer as described above. Prime Gaming is included for free with Amazon Prime, and free trials are available for new users.\n\n__Will this offer be available on all platforms?__\n\nYes, it can be redeemed on PC, Xbox One, Xbox Series S|X, PlayStation 4, PlayStation 5, Amazon Luna, and Google Stadia.\n\n__How long will this offer be available?__\n\nFollowing its release on June 12th, you have __one month__ to claim this offer via Prime Gaming.\n\n__I don't see my rewards.__\n\nIf you're having trouble redeeming your Notamutemain operator bundle, please contact our [support](https://support.ubisoft.com/).\n\nFor more information about Prime Gaming, visit the [Prime Gaming FAQ](https://www.amazongames.com/support/prime-gaming).","categories":["community"],"readTime":5,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2a3lU8IsZwX1zEHj1Mg6h7/community-artist-bundle-program-y8s2-notamutemain","date":"2023-06-12T15:45:00.000Z"},{"id":"6a5uYfFF2CsJh1fjXSWrzK","title":"Y8S2 Operation Dread Factor Patch Notes Addendum","abstract":"Updates and fixes made over the course of the Y8S2 Season Test Server.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1qPPXR4madG3L0SoOc1OpI/bec75e7ff4a49f50179008e4dcc9aff9/Y8S2_Operation_Dread.jpg","content":"You can find here the updates and fixes made over the course of the Y8S2 Season Test Server. For the full Operation Dread Factor Patch Notes, follow the link below.\n\nOperation Dread Factor Season Patch Notes: [https://rainbow6.com/dreadfactor](https://rainbow6.com/dreadfactor)\n\n## Y8S2 Patch Size\n\nFind the download sizes for each platform below.\n\n-  Ubisoft Connect : 8.58 GB\n-  Steam: 5.4 GB GB\n-  Xbox One: 6.26 GB\n-  Xbox Series X: 5.28 GB\n-  PlayStation 4:  6.44 GB\n-  PlayStation 5: 5.71 GB \n\n## OPERATOR BALANCING\n\n### FENRIR\n\n-   Adding the 5.7 USG to Fenrir's loadout;\n\nFollowing the feedback received, we are adding the 5.7 USG as a secondary option Fenrir. This new option will provide a better secondary weapon when using the SASG-12 as a primary weapon. This is an addition to the current loadout. \n\n## FEATURE\n\n### Custom game team mixer\n\n-   New button added to allow hosts in custom local games to randomize teams.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Gadgets are not destroyed if deployed on a hatch that is destroyed.\n\nFIXED - Automatic weapons fire when slightly holding down shoot trigger on controller.\n\nFIXED - Players get a black screen when joining a match while Oryx is hanging from a hatch.\n\nFIXED - Player can lean while immobilized when remapping the lean input to a controller stick.\n\nFIXED - Players join a random team instead of their original team when disconnecting and reconnecting to a custom game.\n\nFIXED - Defusing animation will continue to play occasionally after releasing the defuse button.\n\nFIXED - Ammo boxes are missing from multiple maps in Training Grounds.\n\nFIXED - Friendly Fire penalties are given to players during Free For All game mode.\n\nFIXED - Various VFX issues.\n\n### LEVEL DESIGN\n\nFIXED - Valkyrie's Black Eye can be hidden in the plans in the Green Stairs of Emerald Plains map.\n\nFIXED - Devices can be placed on top of the vending machine at 1F Motel Reception of the Outback map.\n\nFIXED - Defenders are detected outside when standing next to a wall in 1F Living Room of the Villa map.\n\nFIXED - Players get stuck in West Stairs wall after rappelling in EXT East Courtyard on Hereford Base map.\n\nFIXED - Devices that stick to walls can be hidden behind a bookshelf in 1F Visa Office of the Consulate map, giving an unfair advantage.\n\nFIXED - Hibana's X-Kairos can be shot through the desks present throughout Consulate map.\n\nFIXED - Players can navigate onto the scaffolding section at EXT Scaffold of the Consulate map.\n\nFIXED - Exploitable lines of sight towards 2F Yellow Stairs and 2F Bathroom from the red railing located at the EXT Courtyard of the Consulate map.\n\nFIXED - Players can clip through the metal sheet located at EXT Shooting Range of the Hereford Base map.\n\nFIXED - Inside windows can't be barricaded in 2F Master Bedroom of the Villa map.\n\nFIXED - Aruni's Surya Gate cannot be deployed on the eastern side of the hatch from below between B Garage and 1F Exposition room on the Consulate map.\n\nFIXED - Skylight at EXT Building roof of the Consulate map isn't centered with the rooftop opening.\n\nFIXED - Players get stuck in falling animation if they navigate between a chair and wall located in 2F Manager's Office of the Consulate map.\n\nFIXED - Players get stuck behind the sofas in 2F Consul Office of the Consulate map.\n\nFIXED - Placeholder texture is present on the door frame that connects 2F Meeting Room to 2F Hallway of the Consulate map.\n\nFIXED - Throwable sticky devices can't be retrieved when thrown at the corner of the vending machine and the wall in 1F Service Stairs of the Consulate map.\n\nFIXED - Devices that stick to the wall cannot be deployed on the statue located in 1F Spiral Stairs of the Consulate map.\n\nFIXED - Players get an unintended line of sight when using a deployable shield to vault onto a countertop in 2F Copy Room of the Consulate map.\n\nFIXED - Players can get on to a window frame in 2F Bathroom of the Consulate map.\n\nFIXED - Defuser can be planted in the northwest corner of 2F Consul Office of the Consulate map.\n\nFIXED - Players can climb onto the showcase in 2F Consul Office of the Consulate map.\n\nFIXED - Players get stuck behind the sofas in 2F Consul Office of the Consulate map.\n\nFIXED - Players get stuck in falling animation if they navigate between a chair and wall located in 2F Manager's Office of the Consulate map.\n\nFIXED - Skylight at EXT Building roof of the Consulate map isn't centered with the rooftop opening.\n\nFIXED - Collison, asset, and texture issues on various maps.\n\nFIXED - Various planting and pick-up defuser issues.\n\nFIXED - Various LOD issues.\n\n### OPERATORS\n\nFIXED - Wrong animation plays when throwing a device and moving or leaning while prone.\n\nFIXED - Icons for destroyed security cameras remain on screen when viewed through Brava's Kludge Drone.\n\nFIXED - Aruni's Surya Gate converted by Brava's Kludge Drone has no effect on Iana's Gemini Replicator.\n\nFIXED - Iana's Gemini Replicator shows a second defuser icon when Iana is holding the defuser.\n\nFIXED - Gauge for Iana's Gemini Replicator remains red if destroyed or dismissed early.\n\nFIXED - Finka's Adrenal Surge will eliminate her if used while downed.\n\nFIXED - Finka's Adrenal Surge keeps Finka from being eliminated if used before stepping on Frost's Welcome Mat and she's the last attacker standing.\n\nFIXED - Mira's Black Mirror protects Operators from flash effects if used on the other side of the Black Mirror.\n\nFIXED - Valkyrie's Black Eye look sensitivity is too high compared to other Observation Tools.\n\nFIXED - Solis' SPEC-IO Electro Sensor can't use Mega Scan at the minimum ability charge.\n\nFIXED - Zero's Argus Launcher doesn't reload if the animation is canceled near the end.\n\nFIXED - Fenrir's F-NATT Dread Mine VFX disappear when affected by a flash.\n\nFIXED - Fenrir's F-NATT Dread Mine reappears on screen when a player enters and exits Observation Tools that were deactivated.\n\nFIXED - Wrong VFX plays when Fenrir is prone while holding the F-NATT Dread Mine.\n\nFIXED - Doc cannot use devices after using his Stim Pistol to revive himself.\n\nFIXED - Wrong VFX plays when players are affected by Fenrir's F-NATT Dread Mine in third person.\n\nFIXED - Missing VFX for fade in and fade out effects for Fenrir's F-NATT Dread Mine.\n\nFIXED - Activation codes for Fenrir's F-NATT Dread Mine are not retrieved when picking up mines deactivated by an EMP.\n\nFIXED - VFX for Fenrir's F-NATT Dread Mine are canceled and replay when entering the area of effect. \n\nFIXED - VFX loop for Fenrir's F-NATT Dread Mine when player stand at the edge of the detection radius.\n\nFIXED - Footprints are not pointing to Defenders when using Jackal's Eyenox Model III.\n\nFIXED - Various animation issues.\n\nFIXED - Various Operator VFX issues.\n\n### USER EXPERIENCE\n\nFIXED - Fenrir's HUD is not present in first person when viewed through Match Replay.\n\nFIXED - 1F Fireplace spawning point is missing from Chalet map.\n\nFIXED - Post-Action Report is missing after Lone Wolf Training Grounds matches.\n\nFIXED - Thunderbird's Kona Station loadout icon is a placeholder.\n\nFIXED - Local custom game lobbies can't be made while not connected to the internet.\n\nFIXED - Infinite Ammo Symbol is misaligned in the Golden Gun game mode.\n\nFIXED - Players aren't returned to the initial view when leaving free camera mode after selecting another player in Match Replay.\n\nFIXED - In-game HUD doesn't immediately appear when spawning or closing the Options menu during any session.\n\nFIXED - Text is missing from Fenrir's ability icon for the inventory module of the HUD during gameplay.\n\nFIXED - Damage value is incorrect for the D-50 in Golden Gun game mode.\n\nFIXED - Overlapping text for objectives at the start of the \"No Intel\" situation.\n\nFIXED - Various UI issues.\n\nFIXED - Various Localization issues.\n\nFIXED - Various spectator mode issues.\n\nFIXED - Various Match Replay issues\n\nFIXED - Various support mode issues\n\nFIXED - LOD issues on various maps.\n\nFIXED - Various Shop and Customization issues.\n\n### AUDIO\n\nFIXED - Fuse timer SFX doesn't play for Hibana's X-Kairos or Thermite's Exothermic Charge if they were deactivated by Mute's Signal Disruptor and re-activated using an EMP Grenade.\n\nFIXED - Incorrect SFX plays when Fenrir is prone holding the F-NATT Dread Mine.\n\nFIXED - Game audio does not transfer to active device when disconnecting from a previous device.\n\nFIXED - \"Taking the Lead\" lines are playing when the score is equal in Free For All matches.\n\nFIXED - \"Enemy is Taking the Lead Now\" line is playing for all players in Free for All matches.\n\nFIXED - Incorrect SFX play when Fenrir's F-NATT Dread Mine is converted by Brava's Kludge Drone and an EMP deactivation ends.\n\nFIXED - SFX continue to play after Fenrir picks up his F-NATT Dread Mine after an Attacker walks in to the area of effect.\n\nFIXED - SFX play for the whole match around where Fenrir's F-NATT Dread Mine was placed if the mine is triggered at the end of a round.\n\nFIXED - Various audio issues.","categories":["rainbow-six-siege"],"readTime":9,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6a5uYfFF2CsJh1fjXSWrzK/y8s2-operation-dread-factor-patch-notes-addendum","date":"2023-05-30T14:00:00.000Z"},{"id":"2sjhqfhPtIXahpoC0H6F5y","title":"R6Fix Rewards Update","abstract":"For Year 8, we are giving even more rewards to players using R6Fix!","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5bzHBFcYhGZwUNfFLz4aht/1245c2ffe43bcadfd90551fb001cb508/Y7S4.R6Fix.Update.960x540.png","content":"We first want to thank everyone who used R6Fix last year!\n\nIn Year 8, you can now earn even more rewards and you know what is at stake: Alpha Packs!\n\n![[R6S] News - R6Fix Incentives Update - R6 REVEAL Y8S2 R6Fix REWARD](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7hSIIv9zOHnia0jMks3Tuw/22c7872cc438451b668e13807543426d/R6_REVEAL_Y8S2_R6FixREWARD_20230427.jpg)\n\nWhat if we told you there are even __more ways to earn Alpha Packs with R6Fix__?\n\nIn addition to the existing criteria, here are the new ways you can receive additional codes for 3 Alpha Packs (1 rare, 1 epic, 1 legendary):\n\n-   You submit __2__ issues that __reach the__ __Under Investigation status__. You will receive the usual codes depending on the highest severity issue and an additional code for the second issue. (Strength in numbers!)\n\n-   Your issue is a MUST FIX and __reaches the__ __Promoted status__, GG, you will earn a code!\n\n-   You will receive one extra code for any OUTSTANDING contribution. For example, you posted video evidence (not videos of your cat*) __that helped our team fix the issue__.\n\n-   Last but not least, you found an exploit. Don't exploit it, __report it__ instead! If valid (we repeat, if __VALID__), you will earn an extra code.\n\nFor each of these 4 criteria, you can earn 1 code maximum per season.\n\nSo, are you ready, Operator? Head over to [R6Fix](https://r6fix.ubi.com/), grab your shield and help us defend Siege from bugs.\n\nDon't forget to take a look at our [FAQ](https://rainbow6.com/r6fix_faq), if you need a mission brief, you can also check out our previous article available [here](https://www.ubisoft.com/en-ca/game/rainbow-six/siege/news-updates/33c5jfNfDIvcNm5q4NjkWv/r6fix-rewards) for more information about the R6Fix program.\n\nThanks again for your contribution and see you soon!\n\n\\**Seriously, if you post cat videos, you may be banned from the platform indefinitely, so as much as we love cat videos - please don't.*","categories":["rainbow-six-siege","community"],"readTime":2,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2sjhqfhPtIXahpoC0H6F5y/r6fix-rewards-update","date":"2023-05-15T16:00:00.000Z"},{"id":"42o6BhsFgmPla9wmiJ5GnJ","title":"Y8S2 Designer's Notes","abstract":"In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y8S2 Season Test Server and give you some insight into the reasons behind them.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/490i2P9sr2fF1ZciSoO5wb/b180a88c3c4e545b2ef2e2b8d1ee96cf/R6_DesignersNotes_Y8S2.jpg","content":"In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y8S2 Season Test Server and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n__WIN DELTA VS. PRESENCE__\n\n<video width=\"100% !important;\" muted autoplay loop controls>\n<source src=\"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5dI39ZjbL1HqPA6q01K6Gr/42aca1e938366762134e9a1226d0cb64/R6S_DN_Y8S2_BalancingMatrix_Att.mp4\">\n</video>\n\n<video width=\"100% !important;\" muted autoplay loop controls>\n<source src=\"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1w50ak4idpcXyqNYSpKmUZ/2b3db3fdca38a909158a2f1ec5fb004b/R6S_DN_Y8S2_BalancingMatrix_Def.mp4\">\n</video>\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n<br>\n\n# OPERATOR BAN RATE\n\n<video width=\"100% !important;\" muted autoplay loop controls>\n<source src=\"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3AnKoBtCopMEMDBc2b7RlH/060aceabcd6e8f89ed7677544b82246c/R6S_DN_Y8S2_BanMatrix_Att.mp4\">\n</video>\n\n<video width=\"100% !important;\" muted autoplay loop controls>\n<source src=\"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2G4ElVRwtWf3ZFtnuPn911/361afb5eed63038deadc54a2d1ecfdda/R6S_DN_Y8S2_BanMatrix_Def.mp4\">\n</video>\n\n# GADGET BALANCING\n\n__OBSERVATION BLOCKER__\n\n__BASE STATS__\n\n-   Amount: 3 per operator\n-   Barrier maximum width: 5 meters\n-   Barrier height: 2.2 meters\n-   Type: Electronic\n-   Health: 1hp\n-   Vulnerabilities: Bullets, laser, melee, explosives\n\nThe Observation Blocker is the new Secondary Gadget available for Defenders. Once deployed, it creates a digital barrier that blocks vision from any Observation Tool, such as drones, Iana's Gemini Replicator, or Brava's Kludge Drone, so operators or gadgets cannot be spotted through it. This barrier is only visible from Observation Tools, so it won't affect operators in any way. The arms of the device will adapt to the space available, so the projection won't go through walls.\n\nCurrently, the only way to deny Attacker droning is by playing Mute, Mozzie, or Solis. The Observation Blocker will now also fulfill this role to a lesser degree, as drones can travel through the barrier with zero penalty. This gadget won't replace those operators, but it will reinforce the gameplay around denying information and allow for more flexibility when a dedicated operator is not required.\n\nDuring the Preparation Phase, the device can be used to hide information regarding the operators selected or the actual defensive setup. Attackers will need to take more risks with drones to use Attacker Repick at its full potential as they won't know if a Defender is watching from behind the wall. It can also be used to force Attackers to be more accurate when gathering information, as any corner covered by an Observation Blocker can hide a threat.\n\n__OPERATORS__\n\nThe Observation Blocker is added as a 3rd secondary gadget option unless it is specified in the Operator Balancing section below.\n\n-   Ela\n-   Rook\n-   Warden\n-   Caveira\n-   Kaid\n-   Maestro\n-   Pulse\n-   Alibi\n-   Jäger\n\n# OPERATOR BALANCING\n\n## ALIBI\n\n__LOADOUT__\n\n-   Removed Deployable Shield\n-   Removed Impact Grenades.\n-   Added Observation Blocker\n-   Added Proximity Alarm.\n\nAlibi's Prisma blocks line of sight, gathers intel, and tricks attackers. We want to double down on this fantasy by changing all her secondary gadgets to focus on those aspects.\n\nThe Observation Blocker will contribute to the mind games around the Prismas allowing you to hide them from drones to be more effective against Attackers. Proximity Alarms as an alternative, will gather intel and contribute to map control.\n\nThe removal of Impact Grenades will also help slow her down, as she will have to rely on the Baliff 410 to make all rotations.\n\n## CLASH\n\n__LOADOUT__\n\n-   Added Deployable Shield.\n\nTo compensate for her limited fire power Clash will now be able to contribute more to the site setup. Similarly, to what was done with the Super Shorty, we wanted to give her more options.\n\n## GOYO\n\n__LOADOUT__\n\n-   Removed Nitro Cell.\n-   Added Bulletproof Camera.\n-   Added Impact Grenades.\n\nGoyo already has a lot of area denial with the Volcan Canisters, having access to the Nitro Cell fulfills a similar the similar gameplay intention of plant denial. We will replace it with a Bulletproof Camera, so he has an alternative to gather intel and protect his gadgets from being spotted or destroyed by various drones.\n\nWe will also give him Impact Grenades as a 3rd option to again encourage flexibility, so you can trigger a couple of Volcan Canisters without needing to have direct line of sight with them.\n\n## GRIM\n\n__KAWAN HIVE LAUNCHER__\n\n-   Equip time: Reduced to 1 second (from 1.1).\n-   Rate of fire: Increased to 70 rpm (from 40). \n\n__KAWAN HIVE__\n\n-   Activation: Time reduced to 0.4 seconds (from 1).\n-   Vulnerabilities: It is also vulnerable to bullets, laser, and melee damage.\n\n__HIVE__\n\n-   Duration: Increased to 16 seconds (from 8).\n-   Size: Radius increased to 4.6 meters (from 3.6).\n-   Detection system: Now detects any part of the body, not only the head.\n-   Decay: Duration reduced to 4 seconds (from 9). The time between pings is normalized to 1 second (from 1/3/9).\n\n__LOADOUT__\n\n-   Added Baliff 410 as a secondary weapon option.\n-   Added Hard Breach Charge as a secondary gadget option.\n\nTo make Grim's gadget more impactful, we will tweak some values with the objective of increasing the chances of applying the effect to a Defender.\n\nFirst, we are making the Kawan Hive Launcher more responsive by reducing the equipping time and increasing the rate of fire, so you can fill up an area much faster. Secondly, the Kawan Hive will release its charge faster, so a well-placed projectile will easily catch defenders nearby. But take note a quick enough defender can still destroy it before this happens as the Kawan Hive is now vulnerable to more damage types. Finally, we are increasing the Hive's radius and duration, so it can better limit the Defender's movements, as a result the effect's decay will be reduced to make it less punishing to touch the area by accident.\n\nWe will also improve his loadout to increase its flexibility and allow for more creative ways to use the launcher.\n\nWe believe these changes will help him, but other options are being explored as these changes may not be enough to put him in line with other attackers, so more adjustments will come.\n\n## JÄGER\n\n__LOADOUT__\n\n-   Removed Barbed Wire.\n-   Added Observation Blocker.\n\nThe Observation Blocker has great synergy with operators like Jäger that need to hide their utility from unwanted eyes.\n\n## PULSE\n\n__LOADOUT__\n\n-   Removed Barbed Wire.\n-   Added Deployable Shield\n-   Added Observation Blocker.\n\nIt's difficult to compete with the Nitro Cell paired with Pulse's ability, but the Deployable Shield and Observation Blocker can be interesting if you want to play more passively, as they can provide you with some protection while feeding information to your teammates.\n\n## SMOKE\n\n__LOADOUT__\n\n-   Removed Deployable Shield.\n-   Added Proximity Alarm.\n\nSmoke is the one to go to when somebody asks for area denial. Even if he's not the optimal option in every situation, his loadout makes him consistently viable and useful. Without the deployable shield, we expect the decision won't be as easy and will leave some space for other area denial defenders.\n\n## TACHANKA\n\n__LOADOUT__\n\n-   Added Proximity Alarm.\n\nThe Proximity Alarms will give Tachanka precise information about where to shoot his Incendiary Grenades and help him use resources more effectively.\n\n## THUNDERBIRD\n\n__LOADOUT__\n\n-   Removed Impact Grenades\n-   Removed Nitro Cell\n-   Added Barbed Wire\n-   Added Bulletproof Camera\n\n__KONA STATION__\n\n-   Cooldown: Reduced to 15 seconds (from 35).\n-   Healing: Reduced to 20 hp (from 30).\n\nWe want to make playing on top of a Kona Station fairer. On Consoles, where headshots are less likely, you may end up fighting against a defender that has +30hp because the automatic heal will trigger on the first tick of damage received. However, we are reducing the cooldown to get heals, so the Kona Station will be available more often when a Defender needs it and will reward staying there to fully heal, as the healing potential over time is higher than before.\n\nAdditionally, Thunderbird was released with a very strong loadout that encourages very aggressive play. We want to reduce her killing potential by removing the Nitro Cell and make the shotgun a meaningful option by removing her Impact Grenades. We will replace them with support focused gadgets that we believe fit her role better.\n\n<br>\n\n---\n\n<br>\n\nTry out the latest Siege updates on the Test Server and don't hesitate to report any bugs or issues you encounter on the [new and improved R6Fix](https://r6fix.ubi.com/projects/RAINBOW6-SIEGE-TS).\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) or [Reddit](https://www.reddit.com/r/Rainbow6/).","categories":["patch-notes"],"readTime":8,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/42o6BhsFgmPla9wmiJ5GnJ/y8s2-designers-notes","date":"2023-05-15T13:50:00.000Z"},{"id":"4m8fjcmROM4IJSNi58ZEM7","title":"“Fear is a teacher. There’s always a lesson to be learned.” - Fenrir","abstract":"Do you feel your hair standing on end? FENRIR, our newest Defender, brings his valuable expertise in Operation DREAD FACTOR.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/sOA8oYLtJ4mU6T1Nr8bWe/b71227a01801fcffd643f4cb420ba4ae/R6S_Live_Y8S2_DreadFactor_OperatorKeyart_1920x1080_Textless.jpg","content":"Do you feel your hair standing on end? FENRIR, our newest Defender, brings his valuable expertise in Operation DREAD FACTOR. Hailing from Uppsala in Sweden, Fenrir joins the REDHAMMER squad. Being first through the door teaches a valuable lesson in fight or flight.\n\nFENRIR brings the F-NATT DREAD MINE as part of his arsenal. Releasing a fear-inducing gas, FENRIR brings a good area of denial ability when focused on gameplay planning. With 2 HEALTH, 2 SPEED, and the MP7 and SASG-12 as primary weapon choices, FENRIR leaves his opponents feeling like deer caught in headlights. With BARBED WIRE and BULLETPROOF CAMERAS as gadget options, you'll never be sure if you're being watched.\n\nThe F-NATT DREAD MINE is a throwable device that sticks to walls, so it can be hidden in places where fear can fester. FENRIR comes equipped with 5 mines and can activate 3 at a time anywhere on the map, so you'll never know when your resolve will leave you. When a mine goes off it limits the target's field of vision, giving FENRIR and his teammates an advantage over their fear-stricken opponents. Attack Operators can rely on ZERO'S ARGUS CAMERA LAUNCHER to find the mines safely, or BRAVA'S KLUDGE DRONE to turn the fear back on the enemy.\n\nStudying Neurochemistry, FENRIR was discharged from the Swedish Armed forces when he proposed a project to create formulas that alter a soldiers' emotional state, so DEIMOS approached him to fund his research. When he learned his work was being turned into a dangerous weapon, FENRIR escaped and sought out Rainbow.\n\nFear is his greatest tool, and his first lesson will be terrifying.\n\nCheck him out on the Test Servers starting May 15th. Operation DREAD FACTOR will launch on all platforms on May 30<sup>th</sup>.","categories":["rainbow-six-siege"],"readTime":2,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/4m8fjcmROM4IJSNi58ZEM7/fear-is-a-teacher-theres-always-a-lesson-to-be-learned-fenrir","date":"2023-05-15T08:00:00.000Z"},{"id":"5q8GzILAUgryR22kCQRJVA","title":"Anti-Cheat Status Update - May 2023","abstract":"Our latest Anti-Cheat Status Update for May 2023 is here, bringing the latest updates on anti-cheat.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3ZPmAO7CCSb9jVCSAmkYPO/c4a5f4cf8a5353b21ba9e1d789602b2a/Anti-cheat_header_960x540.png","content":"Our latest Anti-Cheat Status Update for May 2023 is here.\n\n## BATTLEYE & DATA BANS\n\nFor an overview on bans, we bring our latest BattlEye and Data Ban numbers, including data for 2023.\n\n![[R6S] Anti-Cheat Status Update May 2023 - Battleye and Data Bans graph v2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6E2yeDLfHhnBwB21YCFJ9B/ea484ee89534c362899646bea31e3ee1/R6_BanChart2023_MAY.Rescaled.png)\n\n__\\**Total bans from previous months have been corrected following a database update.*__\n\n## CHEATS ADDRESSED\n\nSince our last update we have worked to fortify our security behind the scenes, making cheat development more tedious. We have also fixed a number of cheats that were not player facing but affecting game balance.\n\n## MMR ROLLBACK\n\nMMR Rollback was temporarily disabled following the release of Y8S1 to avoid bugs in rollbacks. We have since resolved the related issues and the MMR Rollback system is now active.\n\n## MOUSETRAP - Input Spoofing Detection on Console\n\nY8S1.2 saw the successful release of Mousetrap on consoles. While we're extremely proud of this milestone, we know that closely and continuously monitoring this new system remains crucial.\n\nAs we move forward, we are prepared to make any necessary adjustments to ensure that we maintain a robust, reliable, and fair detection and sanctioning system - this is a front we are committed to. \n\n## HOW YOU CAN HELP\n\nIn-game reporting continues to be the best way to get your reports to us. If you are reporting a cheater on social media, the following can help us to identify and sanction them.\n\n- Clear video or photo proof of the incident\n- The offending player's Username, UserID, or Privacy Mode Nickname\n- Match ID for any relevant matches\n- Date and time of the incident","categories":["anti-cheat"],"readTime":2,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5q8GzILAUgryR22kCQRJVA/anticheat-status-update-may-2023","date":"2023-05-11T13:00:00.000Z"},{"id":"FJ5c2siBMvOhDxSEtfrMM","title":"SIEGE ENTERS THE REDBUBBLE FAN ART PROGRAM","abstract":"Learn more about our partnership with Redbubble and their Fan Art Program.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/658ht46PwwbVPpVso2BsXd/0ce1f4e7c66160a285fe315976ae9343/Prosterguy_Artwork_16x9.jpg","content":"We're happy to announce our partnership with Redbubble and our entrance in their [Fan Art Program](https://help.redbubble.com/hc/articles/360000938143-Fan-Art-Program)!\n\nThe Redbubble Fan Art Program allows fan artists worldwide to create and sell officially licensed merch, using their original approved design based on their favorite brands and games. Community artists are now invited to submit their Rainbow Six Siege designs for a potential inclusion in this program using these  [brand guidelines](https://help.redbubble.com/hc/en-us/articles/13449614902420-Guidelines-Six-Siege).\n\nIf you have any questions regarding this program, you can find more information about it in [Redbubbles's FAQ Section](https://help.redbubble.com/hc/en-us/articles/360001035186-Fan-Art-FAQs). Before you start uploading your original creations don't forget to read through our [Terms and Conditions](https://help.redbubble.com/hc/en-us/articles/13272705937428-Ubisoft-Terms-Conditions) as each submitted piece of art will be reviewed to make sure that it follows [our guidelines](https://ubi.li/RedbubbleGuidelines) before being available for sale on Red Bubble.\n\nWe also encourage you to check out the current [Six Siege designs](https://www.redbubble.com/shop/six+siege) on the site for inspiration and to see some examples of designs that have already been approved.\n\nIf you post your creations on social media, don't forget to tag us with @Rainbow6Game or use [#RainbowSixSiege](https://twitter.com/hashtag/RainbowSixSiege?src=hashtag_click) for a chance to be featured. We're looking forward to seeing your creations!","categories":null,"readTime":1,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/FJ5c2siBMvOhDxSEtfrMM/siege-enters-the-redbubble-fan-art-program","date":"2023-05-09T13:50:00.000Z"},{"id":"2g4xCvC8cWbIcddcgp8WJO","title":"Y8S1 Mid-Season Roadmap Update","abstract":"Check out what's coming to Rainbow Six Siege in the Y8S1 Mid-Season Roadmap Update.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/Oxr8eElg7jNHVWZNAxHJ5/be3e342b9e6e1a01684a0128f2905bc6/Y8S1.RoadmapUpdate.960x540.png","content":"# Y8S1 MID-SEASON ROADMAP UPDATE\n\n__20/04/2023__\n\nEach season, as we introduce new content, we are also providing an updated Roadmap to ensure transparency on upcoming features. When making those adjustments, we are considering multiple factors including the community feedback.\n\nToday's update reflects some of the feedback you've shared with us following the Year 8 Reveal Panel back at the Six Invitational 2023 last February.\n\nYear 8 is bringing a lot of new features, so without further ado, let's dive into the mid-season Roadmap update!\n\n![[R6S] Y8S1 Mid-Season Roadmap Update - Road Map Asset](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4Bc4NJ7UO9iCW3mTuL5DdT/829e47ab17bd122147bb8d44372cae30/Y8S1.RoadMapAsset960x540.png)\n\n## ROADMAP UPDATES\n\n### \\[MAIN FEATURE\\] PERMANENT ARCADE PLAYLIST\n\n- Status: confirmed for Y8S2\n\nPermanent Arcade is one of the most anticipated playlists, and we are happy to announce that thanks to all the hard work put into it, this feature will release in Season 2! You will soon be able to play several new game modes and enjoy the return of out-of-the-ordinary matches!\n\n### \\[MAIN FEATURES\\] MAP REWORK: CONSULATE\n\n- Status: confirmed for Y8S2\n\nYou saw some rooms of the new Consulate map during the Year 8 Reveal Panel, but we can now confirm that the new reworked map will be released in Season 2. As one of Siege's oldest maps, this major rework is not to be taken lightly; it required a complete rebuild from the ground up.\n\n### \\[MAIN FEATURES\\] NEW TARGET MODES IN THE SHOOTING RANGE\n\n- Status: confirmed for Y8S2\n\nAs announced at the Six Invitational 2023, we are bringing even more training features to Siege this year than ever before. We are working on several new features and enhancements of the Shooting Range, and they are now confirmed to release with Season 2. Lock and load Operators, the updated Shooting Range will be one of the best ways to put your skills to the test!\n\n### \\[BALANCING\\] REWORK OF OPERATOR FROST\n\n- New target delivery: Y8S3\n\nWe shifted the target delivery of the rework of Operator Frost following the Community's feedback and comments after the Year 8 Reveal Panel at the Six Invitational. A first test of these balancing changes will be playable on the Y8S2 LAB TS in June. We want to make sure we do not hinder our dear Canadian Operator's effectiveness in the field while we aim to bring more balance and gameplay opportunities with the update to her gadget.\n\n### \\[BALANCING\\] NEW OBSERVATION BLOCKER GADGET\n\n- Earlier target delivery: Y8S2 instead of Y8S3\n\nAs we have shifted the target delivery of the Operator Frost Rework, we are aiming to release the new observation blocker gadget a full season earlier than announced at the Six Invitational. This new Intel Denial gadget will soon be in your hands!\n\n### \\[BALANCING\\] \\[NEW\\] GRIM BUFF\n\n- Target delivery: Y8S2 (Part I) and Y8S4 (Part II)\n\nWe are actively working on Operator Grim to improve his impact. In order for you to get your hands on this rework sooner, we have broken this update into two parts. The first update is set to be released in Season 2, and the next one in Season 4.\n\nStay tuned for the upcoming Year 8 Season 2 reveal and join the discussion on [Twitter](https://twitter.com/Rainbow6Game/), [Instagram](https://www.instagram.com/rainbow6game_us/), [Reddit](https://www.reddit.com/r/Rainbow6/), [Discord](https://discord.gg/rainbow6), [Facebook](https://www.facebook.com/Rainbow6/) and [forums](https://discussions.ubisoft.com/category/609/rainbow-six-siege?lang=en-US).\n\nCheck out the [public Roadmap](http://rainbow6.com/roadmap) for more information on the changes coming your way!","categories":null,"readTime":3,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2g4xCvC8cWbIcddcgp8WJO/y8s1-midseason-roadmap-update","date":"2023-04-20T15:00:00.000Z"},{"id":"HTkVw1mAg7DuA2ZKWCKe0","title":"Y8S1.2 Patch Notes","abstract":"See the upcoming changes to Rainbow Six Siege with the release of Y8S1.2","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/217ALyQlxltdqaKiW7zjts/5b12c8d44b064e07ef0af41d9e0bf31a/Y8S1.2_PatchNotes.960x540.png","content":"See the upcoming changes to Rainbow Six Siege with the release of Y8S1.2.\n\n## Y8S1.2 Patch Size\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect : 1.07 GB\n- Steam : 1.07 GB\n- Xbox One :  997.53 MB\n- Xbox Series X : 1.23 GB\n- Playstation 4 : 1.39 GB\n- Playstation 5 : 1.05 GB\n\n## MOUSETRAP (MOUSE & KEYBOARD ON CONSOLE)\n\nOn consoles, mouse and keyboard players now get a penalty that adds lag to their inputs. Continued use increases the lag over several matches, increasing fairness by removing their unfair advantage by making it harder to aim and shoot. Completing matches with a controller gradually reduces the lag back to normal.\n\nThis feature will be monitored closely.\n\n## OPERATOR BALANCING \n\n### CAPITÃO\n\n-   Tactical Crossbow's Micro Smoke Grenade duration increased to 11s (from 9).\n\n### KAPKAN\n\n-   9x19VSN: Removed 1.5x Sight.\n\n### ORYX\n\n-   T-5: Removed 1.5x Sight.\n\n### WAMAI\n\n-   MP5K: Added 1.5x Sight.\n\n### TACHANKA\n\n-   Shumikha Launcher:\n     -   Ammunition increased to 20 projectiles (from 14).\n     -   Magazine size reduced to 5 (from 7).\n-   9x19VSN: Added 1.5x and 2.0x Sights.\n\n## WEAPON BALANCING\n\n### EXTENDED BARREL\n\n-   Damage bonus reduced to 12% (from 15%).\n\n## TWEAKS AND IMPROVEMENTS\n\n### Brava\n\n-   *Brava's Kludge Drone will  change the team of Aruni's Surya Gate when successfully converted by the Kludge Drone. It will then become an attacker device, so it will open for Attackers and damage Defenders.*\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Solis remains in her scanning animation for too long after performing a scan.\n\nFIXED - Brava's Kludge Drone briefly displays positive feedback for a device that is out of range if it's the first one scanned in the match.\n\nFIXED - Continuously reloading the 6P41 LMG within a few seconds occasionally results in an instant reload.\n\nFIXED - Number of displayed Operator icons is limited in the fullscreen and side panel of the Shop and Battle Pass.\n\nFIXED - Brava cannot shoot with a converted Yokai if Echo is eliminated.\n\nFIXED - Signal Disrupter converted by Brava's Kludge Drone still affects Iana's Gemini Replicator.\n\nFIXED - Drones hacked by Mozzie's Pest during Preparation Phase lose functionality after being converted by Brava's Kludge Drone.\n\nFIXED - Doorways on 1F Service and Toilets of Stadium map can be reinforced twice.\n\nFIXED - Thunderbird's Kona Station has a missing texture.\n\nFIXED - IQ's Electronics Detector detects Solis even while not active.\n\nFIXED - After Brava deploys all Kludge Drones, pressing the unique ability input key produces a \"No Kludge Drone Left\" message instead of entering Observation Tools.\n\nFIXED - Remove prompt displays if barricade is immediately destroyed after placement.\n\nFIXED - Victory Celebrations end or loop too early when previewed in Operator Loadout or Shop.\n\nFIXED - All of Aruni's Surya Gates change to enemy color if one Surya gate is converted by Brava's Kludge Drone.\n\nFIXED - Iana's Gemini Replicator overheat VFX doesn't display.\n\nFIXED - Operators can be shot through glass floor while prone in Close Quarters map.\n\nFIXED - Operators get stuck inside the archway after exiting rappel inside of it at EXT Crash Scene on Border map.\n\nFIXED - Large drones can't fit in vents with vent blockers in House map.\n\nFIXED - Drones lose functionality when deployed through Mute's Signal Disruptor.\n\nFIXED - Azami's Kiba Barrier lets her climb a bookshelf on the first floor of Skyscraper map for an unfair advantage.\n\nFIXED - Counter Defuser's progression bar VFX doesn't display.\n\n### LEVEL DESIGN\n\nFIXED - Valkyrie's Black Eye doesn't have a signal in 2F Geisha room of the Skyscraper map.\n\nFIXED - Ceiling in 2F Kid's Room of Hereford Base map becomes indestructible after some destruction is performed on it.\n\n### OPERATORS\n\nFIXED - Mesh issue is visible on Ash's Sidewinder elite uniform.\n\nFIXED - An unreleased Jäger uniform can be accessed and makes him invisible when equipped.\n\n### USER EXPERIENCE\n\nFIXED - Various Localization issues.\n\nFIXED - Rainbow Is Magic: The Teddy Conflict popup doesn't appear in game.\n\nFIXED - Dark-themed is displayed when accessing Boosters from the Home section.\n\nFIXED - \"Buy Levels\" button remails on screen if the player reaches Battle Pass level 100 by exceeding 105000 battle points.\n\nFIXED - Wrong background displayed in the News section when viewing a bundle.\n\nFIXED - Players can't navigate the details of a bundle using a controller after selecting a switch view icon with mouse.\n\nFIXED - Back button stops working after opening and closing the Battle Pass Map.\n\nFIXED - Lines from background of previous menu are present during map loading screen.\n\nFIXED - Input icon for the \"enter\" key is displayed for multiple Battle Pass buttons.\n\nFIXED - \"Continue\" button has no functionality during the Premium Upgrade screen when it is first accessed from Brava's Operator page.\n\nFIXED - Victory Celebration thumbnail is not displayed in the Details tab of Finka's QCR Exo Prototype NH02 Elite Uniform.\n\nFIXED - Input icon for the \"enter\" key is not displayed for the Watch Video button in the Story Section of the Battle Pass on PC.\n\nFIXED - Input icon for the \"enter\" key is not displayed for the Browse Rewards option in the Intro section of the Battle Pass on PC.\n\nFIXED - Upgrade to Premium button can't be selected with the keyboard or controller input in the Challenges section of the Battle Pass.\n\nFIXED - Upgrade to Premium button is not displayed for free players in the Rules section of the Battle Pass.\n\nFIXED - Controller input prompts for the Premium Pass and Premium Pass Bundle are not displayed in the Commanding Force splash screen.\n\nFIXED - Operator Guide can't be focused on after focusing on an Operator Card in Match Replay.\n\nFIXED - Players are able to report each other in custom games.\n\nFIXED - Scroll bar not displayed on the purchase side panel of all Esports Bundles.\n\nFIXED - Star icon is not displayed in the Unlock with Premium Battle Pass button in the new Operator's page.\n\nFIXED - Card Background and Operator portrait overlap in the Packs Section.\n\nFIXED - Dualsense Edge is not functional on PC.\n\nFIXED - News text breaks when changing from a localized language to English quickly.\n\nFIXED - Zoomed in previews present for some item tiles in the Progression section of the Battle Pass.\n\nFIXED - Players are returned to Home section when using the back button in the Battle Pass Map.\n\n### AUDIO\n\nFIXED - SFX is missing when activating Hibana's X-Kairos.\n\nFIXED - Fences on the ground play the wrong SFX on Theme Park map.\n\n<br>\n\n---\n\n<br>\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game), [Reddit](https://www.reddit.com/r/Rainbow6/), [Facebook](https://www.facebook.com/Rainbow6/) and on our [forums](https://discussions.ubisoft.com/category/609/rainbow-six-siege?lang=en-US).","categories":["patch-notes"],"readTime":7,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/HTkVw1mAg7DuA2ZKWCKe0/y8s12-patch-notes","date":"2023-04-11T10:45:00.000Z"},{"id":"3CaOcX8mO9qYfRGU9AMN0a","title":"Y8S1.2 Designer's Notes","abstract":"In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y8S1.2 Balancing Test Server and give you some insight into the reasons behind them.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/lavYXYhZldEv3mJL7RfaZ/580ca8d141269cdaa977bcfea698ba5b/image-2023-03-24-11-21-06-185.jpg","content":"In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y8S1.2 Balancing Test Server and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n### WIN DELTA VS. PRESENCE\n\n<video width=\"100% !important;\" muted autoplay loop controls> \n\n<source src=\"https://staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/45n3CMbBKkg88Z2fpr5Jty/1b466744ea35a8f2abc94710f5622531/R6S_DN_Y8S1.2_BalancingMatrix_Att.mp4\"> \n\n</video> \n\n<video width=\"100% !important;\" muted autoplay loop controls> \n\n<source src=\"https://staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2MdUhA8L3XdLnKK1yk9yil/075bd91c4ddff3d6b6f06ccbf877dba9/R6S_DN_Y8S1.2_BalancingMatrix_Def.mp4\"> \n\n</video> \n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n<br>\n\n# OPERATOR BAN RATE\n\n<video width=\"100% !important;\" muted autoplay loop controls> \n\n<source src=\"https://staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/65V0p5QXbvLUuYvu4PXfrq/5362bff9125937d675614eb958d40607/R6S_DN_Y8S1.2_BanMatrix_Att.mp4\"> \n\n</video> \n\n<video width=\"100% !important;\" muted autoplay loop controls> \n\n<source src=\"https://staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4KE1OpvC5BSRkEzscDJidX/2403f0e630af84e914cf66d24ab5b034/R6S_DN_Y8S1.2_BanMatrix_Def.mp4\"> \n\n</video> \n\n<br>\n\n# OPERATOR BALANCE\n\n## CAPITÃO\n\n### SMOKE DART\n\n-   Duration: Increased to 11s (from 9).\n\nThe Smoke Dart and Smoke Grenade both share the same visuals and utility therefore it's only natural to normalize the duration across the board.\n\n## KAPKAN\n\n### 9x19VSN\n\n-   Sights: Removed 1.5x.\n\nKapkan has a highly lethal kit. It gives him a variety of different ways to kill his enemies. By removing the 1.5x sight from his weapon, he will need to be more careful with direct engagements and rely a bit more on his utility.\n\n## ORYX\n\n### T-5\n\n-   Sights: Removed 1.5x.\n\nOryx's popularity has increased season over season. Players are enjoying his ability to rotate faster than any other defender and surprise attackers. Since the change of his primary weapon, his presence has increased more than 25% and his KD is one of the highest at the moment.\n\nThe addition of the 1.5x sight to Oryx's kit brought attention to him. The T-5 with this sight is an extremely powerful combination (which is why we took it away from Lesion back in Y5S4). So now that players have realized the potential of Oryx's abilities, we'll be removing the sight.\n\n## WAMAI\n\n### MP5K\n\n-   Sights: Add 1.5x.\n\nLast year, Wamai was hit twice in a row. First by removing the 1.5x from the MP5K and then by increasing the recoil of the AUG. The combination of these two changes have caused his win delta to suffer more than we anticipated, so he will recover the sight.\n\n## TACHANKA\n\n### SHUMIKHA LAUNCHER\n\n-   Ammunition: Increased to 20 projectiles (from 14).\n-   Magazine size: Reduced to 5 (from 7).\n\n### 9x19VSN\n\n-   Sights: Added 1.5x and 2.0x.\n\nHaving a launcher equipped as a defender is dangerous, as it can leave you exposed to a rushing attacker. but we still believe that launchers can be viable on defense, so we will continue exploring ways to find their fit in the game.\n\nWe've previously improved Tachanka's Shumikha Launcher, to make it more reliable at ranges other operators can't match, but with this update we want to focus on improving how long he can deny an area. Tachanka was already one of the best in this category but because of his smaller area of denial it left players feeling they needed to use more projectiles to compensate. By increasing the number of projectiles, Tachanka can clearly be seen as the best option to deny a narrow area. However, as the game's fire system can be quite taxing, we will reduce the magazine size to prevent the stacking of too many areas in a short period of time.\n\n![[R6S] Y8S1.2 Designer's Notes - AOE Table](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/46YX9hk2f8iPMeMwSQiuhX/2aef9892a56f6aafe43b1b41b203c3d8/Y8S1.2_Tachanka_AOE_Table.png)\n\n# WEAPON BALANCE\n\n## EXTENDED BARREL\n\n### BASE STATS\n\n-   Damage bonus: Reduced to 12% (from 15%).\n\nThe initial reaction to the Extended Barrel rework was like that of the Silencer, in that it was the potential dawn of a new meta. It is easier to see the benefit of a flat damage increase with the Extended Barrel versus gaining a perk while leaving damage untouched as with the Silencer.\n\nNormally the pick rate of a new change goes up drastically because of the novelty and starts to fall after time is spent playing to evaluate the pros and cons. While this evolution stays mostly true in high ranks, it hasn't been the case in lower ranks where we have seen the presence of the attachment go up slowly.\n\nWhile veteran players tend to evaluate the usefulness of the new attachment depending on how they will play, the rest of the population is seeing the damage buff as something good to always have. We, instead want the selection of an attachment to be a thoughtful decision.\n\nWe've been happy with the effect the Extended Barrel's adjustments have had on the game, but we will reduce the damage bonus to make the decision to use it a bit tougher.\n\n<br>\n\n---\n\n<br>\n\nTry out the latest Siege updates on the Test Server and don't hesitate to report any bugs or issues you encounter on the [new and improved R6Fix](https://r6fix.ubi.com/projects/RAINBOW6-SIEGE-TS).\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game), [Reddit](https://www.reddit.com/r/Rainbow6/).","categories":["rainbow-six-siege","rainbow-six"],"readTime":5,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3CaOcX8mO9qYfRGU9AMN0a/y8s12-designers-notes","date":"2023-03-28T15:00:00.000Z"},{"id":"2g7hT2NNuOqrj35RfgsFxN","title":"Anti-Cheat Status Update - March 2023","abstract":"Our latest Anti-Cheat Status Update for March 2023 is here, bringing the latest updates on anti-cheat and more.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/276EjbaZjGq8zZlIRmK9EC/bb9118337bd854def58084f5850dc4ae/Anti-cheat_header_960x540.png","content":"Our latest Anti-Cheat Status Update for March 2023 is here, bringing the latest updates on anti-cheat and more.\n\n## BATTLEYE & DATA BANS\n\nFor an overview on bans, we bring our latest BattlEye and Data Ban numbers, including data for the last 6 months.\n\n![[R6S] Anti-Cheat Status Update March 2023 - Ban Chart v2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4blZESVbRVPcU3gBtf6Tms/511d4a3f2b74727ba5950d6a660f652c/R6_BanChart2023_MAR.v2.jpg)\n\n## CHEATS ADDRESSED\n\nWe've addressed a number of cheats since our last Anti-Cheat Status Update which are listed below.\n\n- Instant kill while in Prep Phase\n- Code insertion via Ban Ticker\n- Add/Remove score points\n- Team chat accessed by cheater on opposing team\n- Flores drone can be teleported\n\nAs well addressing new cheats, we've also been making constant updates to ensure that hacks that we're currently detecting remain detectable, protecting players.\n\n## PRIVACY MODE HEALTH UPDATE\n\nWe're aware that cheats have been used in order to misuse the Privacy Mode feature, and we're working hard to make sure this is not the case.\n\nSince our last update we've:\n\n- Addressed a cheat enabling the additional numbers to be removed from nicknames\n- Addressed a cheat enabling the user to change their nickname multiple times during a match\n\n__What's Next?__\n\nWe are aware of and currently looking into an exploit being used to discover a player's real username when they've got Privacy Mode enabled. We'll share more on this in a future update.\n\n## MOUSETRAP - Input Spoofing Detection on Console\n\nInput spoofing has long been an issue on console, and we've been hearing your feedback throughout Siege's life so far. With Mousetrap we're taking action to create and foster a fair and competitive environment for console players.\n\n__How Will Mousetrap Work?__\n\nWhen a player is detected using an input spoofer, a penalty will be activated adding latency to their inputs which will also build up over time. The goal here is to remove the advantage that mouse and keyboard users on consoles are getting over controller players. If a player receiving the penalty starts using a controller instead, the input latency penalty will gradually be removed.\n\nThis experimental solution has been quietly in development for some time, and we're excited to have this released in Y8S1.2. Work on this feature will also proceed after its release as we continue to fine tune the system.\n\nFor more information, check our dedicated [blog post](https://rainbow6.com/mouse_and_keyboard_anti_cheat).\n","categories":["rainbow-six-siege","anti-cheat"],"readTime":3,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2g7hT2NNuOqrj35RfgsFxN/anticheat-status-update-march-2023","date":"2023-03-24T13:50:00.000Z"},{"id":"y68BmuBkDaaIkoOPZEk4c","title":"Y8S1.1 Patch Notes","abstract":"See the upcoming changes to Rainbow Six Siege with the release of Y8S1.1","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3CbwzoAWgBRWzka73PlxzP/6d237845452c188668f0f0a47ef2a59d/Y8S1.1_PatchNotes.960x540.png","content":"See the upcoming changes to Rainbow Six Siege with the release of Y8S1.1.\n\n## Y8S1.1 Patch Size\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 1.36 GB\n- Steam: 628.78 MB\n- Xbox One: 1.28 GB\n- Xbox Series X: 1.59 GB\n- PS4: 1.88 GB\n- PS5: 1.36 GB\n\n## Bug Fixes\n\n### Gameplay\n\nFIXED - Maestro's Evil Eye, Valkyrie's Black Eye, and the Bulletproof Camera cannot be accessed in Online matches with the unique or secondary ability input button.\n\nFIXED - Brava's Kludge Drone does not display out of range feedback on HUD when failing a hack due to distance.\n\nFIXED - Reload animation for 6P41 doesn't start from the same spot when cancelled while inserting the magazine.\n\nFIXED - Hack VFX does not switch team colors after hacking a Defender drone converted by Brava's Kludge Drone, then converted again with Mozzie's Pest.\n\nFIXED - Zero's Argus Camera is destroyed by electrified walls when hacked by a Kludge Drone controlled by Mozzie.\n\nFIXED - Bailiff 410 reload animation does not play properly after firing a bullet during the reload animation.\n\nFIXED -   IQ's Electronics Detector doesn't detect Claymores or Nomad's Air Jab that are converted by a Kludge Drone controlled by Mozzie.\n\nFIXED -  IQ's Electronics Detector doesn't show wave VFX on Observation Tools converted by a Kludge Drone controlled by Mozzie.\n\nFIXED - Grenade Launcher projectiles and Kaid's Electroclaw  are not caught by Wamai's Mag-NET if it's been converted while an elite skin is equipped.\n\nFIXED - Glitch VFX shows on Bulletproof Cameras after Mute's Signal Disruptor converted by Brava's Kludge Drone is destroyed.\n\nFIXED - IQ's Electronics Detector detects Solis at all times.\n\nFIXED - Bullet hole exploit allowed for unfair lines of sight on Kafe Dostoyevsky map.\n\nFIXED - .44 Magnum magazine appears from the top of the screen during reload animation\n\nFIXED - Drone order is incorrect in Observation Tools when switching between a Kludge Drone controlled by Mozzie's Pest and other drones controlled by Mozzie.\n\n### Audio\n\nFIXED - Echo's Yokai is missing deactivated state SFX after being hacked by Brava's Kludge Drone and going within range of Mute's Signal Disruptor.\n\n### Operators\n\nFIXED - Maestro's Evil Eye open and shoot prompt is missing after being converted by Brava's Kludge Drone.\n\nFIXED - Hack VFX is visible on screen after Brava takes back a Kludge Drone previously hacked by Mozzie's Pest.\n\nFIXED - Brava's Commando Striker Uniform replaces the position of the default uniform in the uniforms menu after unlocking the Brava Guerreira Bundle tile in Battle Pass.\n\nFIXED - Thorn's Razorbloom Shell remains visible after being destroyed by a Mag-NET converted by Brava's Kludge Drone.\n\nFIXED - Zero's Argus Launcher Laser has white team color regardless of what's set in the accessibility options.\n\nFIXED - Echo's Yokai firing VFX is missing in first person and misplaced in third person.\n\nFIXED - Defenders receive negative score points when destroying converted security cameras by Brava's Kludge Drone.\n\nFIXED - Azami's Kiba Barriers are not caught by a Mag-NET converted by Brava's Kludge Drone.\n\nFIXED - Brava's Kludge Drone consumes a charge even when the device is picked up before a successful conversion.\n\nFIXED - Lesion's Gu Mines are not caught by a Mag-NET converted by Brava's Kludge Drone.\n\n### User Experience\n\nFIXED - Multiple LOD issues on various maps.\n\nFIXED - Various Shop and Customization issues.\n\nFIXED - Various Localization issues.\n\nFIXED - Play Again button in Play section isn't working.\n\nFIXED - Opening and closing the Battle Pass minimap prolongs item loading times.\n\nFIXED - Operator icon in unique ability loadout preview is displayed multiple times on some operators.\n\nFIXED - Placeholder names and art present for attachment skins instead of a bundle.\n\nFIXED - Parade Companion drone skin is incorrectly listed as a unique drone skin.\n\nFIXED - Penalty sanction pop-ups appear during custom games.\n\nFIXED - Overlapping text is displayed on all weapon skins that are a part of a bundle.\n\nFIXED - Device icons overlap with success icon while Brava's Kludge Drone is converting a device.\n\nFIXED - The Copper card background is displayed instead of the Champion one in the Rank and Rewards section.\n\nFIXED - Detail info aren't displayed after the user switches to another elite while watching a victory celebration.\n\nFIXED - Background doesn't scale properly in different menus after changing the aspect ratio to 21:9.\n\nFIXED -  User isn't returned to the Home section if the Battle Pass expires while navigating through the Battle Pass.\n\nFIXED - Operator Guide in Match Replay controls.\n\nFIXED - Brava's Guerreira bundle in Battle Pass contains art from another bundle.\n\nFIXED - Y7S4 rewards in unused token conversion popup appears as locked unless Y8S1 Premium Pass is purchased.\n\nFIXED - Rewards to be received aren't displayed properly when buying Battle Pass levels.\n\nFIXED - Operator Portraits don't display correct Operator icons in the enlarged Battle Pass map.\n\nFIXED - Prices aren't displayed in item previews in the Bravo Collection.\n\nFIXED - Using the Skip Cinematic button before loading completes causes a black screen.\n\nFIXED - Counter-defuser progression bar VFX is unavailable.\n\nFIXED - Shifting textures when firing the 9mm C1 weapon.\n\nFIXED - Input key icon isn't displayed on the Upgrade to Premium, Buy Battle Pass Levels, and Confirm Unlock buttons.\n\n---\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game), [Reddit](https://www.reddit.com/r/Rainbow6/), [Facebook](https://www.facebook.com/Rainbow6/) and on our [forums](https://discussions.ubisoft.com/category/609/rainbow-six-siege?lang=en-US).","categories":["rainbow-six-siege"],"readTime":5,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/y68BmuBkDaaIkoOPZEk4c/y8s11-patch-notes","date":"2023-03-21T11:45:00.000Z"},{"id":"3GBmCZvYeE46RnsIPQebuh","title":"COMMUNITY ARTIST BUNDLE PROGRAM Y8S1: LEVASOJ","abstract":"Learn more about the Y8S1 Community Artist Bundle - designed by LevaSoj for the operator Kapkan.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7qtD6unKDzdx2GkWxwt07D/aaa1f673f48cafcbe83642feffad3e00/R6S_Y8S1_CommunityArtistBundle_ArticleHeader.jpg","content":"During Year 7, we worked together with [Shinosaaaaaaang](https://www.ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/4OToCGhnobG8BqwdtHfBxX), [Siege Tales](https://www.ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3yE38OvDoFtUy0iHjni0p8), and [Retrodisaster](https://www.ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1uQ7xM7JkykYbG5yu8jyhA) to release amazing bundles. We are happy to announce that this program is back with the artist LevaSoj leading the way in Year 8! Starting 14<sup>th</sup> March, their Kapkan bundle will be available to redeem for a limited time on the dedicated Rainbow Six Siege [Prime gaming page](https://gaming.amazon.com/rainbowsixsiege).\n\nWith this program, we want to celebrate our amazingly creative and dedicated community artists and give them the chance to have their art styles represented in-game. Each chosen artist will have the opportunity to design a full set for an operator of their choice and the resulting bundles will become available during Year 8.\n\nIf you haven't yet, go have a look at our previous bundles: [SAU_SIEGE](  https://rainbow6.com/artistbundle_y6s1), [Sunstark](https://rainbow6.com/artistbundle_y6s2), [FrAgMenT](https://rainbow6.com/artistbundle_y6s3), [Pericote](https://rainbow6.com/artistbundle_y6s4), [Shinosaaaaaaang](https://rainbow6.com/artistbundle_y7s1), [Siege Tales](https://rainbow6.com/artistbundle_y7s3) and [Retrodisaster](https://rainbow6.com/artistbundle_y7s4).\n\n![[R6S] Y8S1 Artist Bundle - Levasoj Kapkan](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7scWYaxSuYmG2D3loXxJtQ/c4b35f02efaf60030f464bfc21c3e67c/Y8S1_Twitch_Community_Artist_Levasoj_Kapkan.jpg)\n\nLevaSoj’s Kapkan Operator Bundle includes:\n\n-\tUniform\n-\tHeadgear\n-\t9x19VSN weapon skin\n-\tCharm\n\n### HOW TO REDEEM THE BUNDLE\n\nThe LevaSoj Operator Bundle will be available via Prime Gaming for a __limited time__, starting __from 14th March__. \n\nPrime Gaming members will be able to claim this exclusive set for free. If you're not a Prime member yet, you can sign up for a free trial.\n\nHere's how you can get these Prime Gaming offers:\n\n-   Link your Ubisoft and Amazon accounts [here](https://primegaming.ubisoft.com/).\n-   Redeem the respective offer through Prime Gaming [here](https://gaming.amazon.com/rainbowsixsiege).\n-   Receive the content automatically in-game within 48 hours.\n\n### ABOUT THE ARTIST\n\nLevaSoj is a freelance artist from Finland specialized in video games. Art has always been part of their life, they started by drawing loads of comics and in 2006, they received a drawing tablet, leading them to immerse into digital art and animation. Since, inspired by the passionate people around them and fellow creators, they haven't stopped drawing.\n\nBeing a versatile artist, LevaSoj can adapt depending on the message they want to convey and the public they want to reach. Their Siege artwork is colorful and casual, while their personal style is more serious and grittier.\n\nWhile they had been following Siege since its beta phase, it's in 2019 that LevaSoj actively joined its art community. Today, they are presenting their version of Kapkan as a hunter, a trapper, inserting their own characteristics, combined with military, horror, and sci-fi elements to build a narrative around this bundle. LevaSoj also states that there are references from the the Siege community hidden in the details of their Kapkan bundle - will you be able to find them?\n\nWant to see more of LevaSoj's amazing art? Check out those links [Twitter](https://twitter.com/LevaSoj), [Twitch](https://www.twitch.tv/levasoj) and [Instagram](https://www.instagram.com/levasoj_/).\n\n![[R6S] Y8S1 Artist Bundle - Prime Gaming Asset](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7K2bCkWgRs1SZt78ptYMrh/d5b1f3d4542dc7a5eb2c60b9f4298250/RS6_Y8S1_ArtistBundle_PrimeGaming_Asset.jpg)\n\n### FAQ\n\n__What is the Community Artist Bundle Program?__\n\nThe Community Artist Bundle Program launched in Y6S1 and it brings operator bundles created by some of our most talented and dedicated Siege fan artists into the game.\n\n__I'm a Siege fan artist too - what can I do to get selected as well?__\n\nGiven the length of our production cycle for in-game content, the fan artists for Year 8 have already been determined. However, we are always on the lookout for future participants. If your goal is to see your bundle in-game, continue showing us your passion and strive to be an outstanding member of the Siege community. We have multiple ways for our dedicated community artists to get more involved with the game, such as the Ubisoft Star Player Program.\n\n__How can I get the Y8S1 LevaSoj Operator bundle?__\n\nLink your Ubisoft account with your Amazon account [here](https://primegaming.ubisoft.com/) and claim the Operator set through [Prime Gaming](https://gaming.amazon.com/loot/rss?ref_=SM_R6S05_P5_IGP) starting from March 14th. After successfully redeeming the content, it will be available in your in-game inventory within 48 hours. Players must have Kapkan available as an operator.\n\n__Can I buy the LevaSoj Operator Bundle with Renown or R6 Credits as well?__\n\nThe LevaSoj Operator Bundle is exclusive to Prime Gaming for a limited time only and can be obtained via the Prime Gaming offer as described above. Prime Gaming is included for free with Amazon Prime, and free trials are available for new users.\n\n__Will this offer be available on all platforms?__\n\nYes, it can be redeemed on PC, Xbox One, Xbox Series S|X, PlayStation 4, PlayStation 5, and Amazon Luna.\n\n__How long will this offer be available?__\n\nFollowing its release on 14th March, you have one month to claim this offer via Prime Gaming.\n\n__I don't see my rewards.__\n\nIf you're having trouble redeeming your LevaSoj Operator Bundle, please contact our [support](https://support.ubisoft.com/).\n\nFor more information about Prime Gaming, visit the [Prime Gaming FAQ](https://www.amazongames.com/support/prime-gaming).","categories":["community"],"readTime":5,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3GBmCZvYeE46RnsIPQebuh/community-artist-bundle-program-y8s1-levasoj","date":"2023-03-14T17:00:00.000Z"},{"id":"1xLJqGTce4nquXpg4cZYDC","title":"Y8S1 Commanding Force Patch Notes Addendum","abstract":"Updates and fixes made over the course of the Y8S1 Season Test Server.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5Z4jz6wtTAOd1xnKwO0k1f/f835c0237860237eff66cebb74225e7e/Y8S1_PatchNotes.Addendum.jpg","content":"You can find here the updates and fixes made over the course of the Y8S1 Season Test Server. For the full Operation Commanding Force Patch Notes, follow the link below.\n\nOperation Commanding Force Season Patch Notes: \nhttps://rainbow6.com/CommandingForce\n\n## Y8S1 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 5.34 GB\n- Steam: 3.6 GB\n- Xbox One: 4.35 GB\n- Xbox Series X: 4.87 GB\n- PlayStation 4: 4.53 GB\n- PlayStation 5: 4.18 GB\n\n## PLAYER COMFORT\n\n### BRAVA\n\nAt season launch, Brava's Kludge Drone will overload Aruni's Surya Gate rather than convert it, meaning that it will deactivate but remain a Defender device.\n\nThis is a temporary fix until an issue with conversion between these two devices is resolved in a later update.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Defuser can't be picked up while sprinting.\n\nFIXED - Operator Card health bar extends beyond the frame during the end of round replay.\n\nFIXED - Operators can melee through Shields.\n\nFIXED - Misleading controller layout for Spectator.\n\nFIXED - Ammo desync between players shooting after the reload is finished.\n\nFIXED - Zero's Argus Camera floats in the air if it was deployed on Castle's Armor Panel and Defenders remove it from the other side.\n\nFIXED - Zero's Argus Camera can't pierce the surface if there was a device on the other side while the camera deployed.\n\nFIXED - Clipping occurs when deploying a device onto an elevated surface.\n\nFIXED - Dokkaebi can hack an additional phone if two more Defenders are eliminated.\n\nFIXED - Low performance while rewinding or fast-forwarding in Match Replay.\n\nFIXED - Match Replay UI widgets have arrows displayed incorrectly.\n\nFIXED - Incorrect behavior after pressing ESC key when affected by Dokkaebi's Logic Bomb as an eliminated Defender.\n\nFIXED - Incorrect animation while counter-defusing.\n\nFIXED - Play Again button in the Home section doesn't display the last-played playlist.\n\nFIXED - VFX and SFX for out of bounds occur briefly while respawning.\n\n### LEVEL DESIGN\n\nFIXED - Azami's Kiba Barrier at certain angles allows players to vault vegetation near the stairs at 2F CC Stairs on Nighthaven Map.\n\n### OPERATORS\n\nFIXED - Clipping present during deploy and pickup animations while rappelling as Osa.\n\nFIXED - Missing VFX and SFX on Flores's RCE-Ratero Charge.\n\nFIXED - Mute must fully finish equipping the Signal Disruptor before he can deploy it.\n\nFIXED - Solis' SPEC-IO Electro-Sensor HUD remains displayed on her kill cam after being eliminated.\n\nFIXED - Zero's Argus Launcher crosshair incorrectly displays that it can pierce metal floor beams.\n\nFIXED - Zero's Argus Camera uses incorrect SFX when piercing a reinforced wall.\n\nFIXED - Mute's Signal Disruptor unequip animation is played too fast.\n\nFIXED - Lion's EE-One-D is reflecting onto the ground indoors and outdoors.\n\nFIXED - Sledge cannot equip the Breaching Hammer while in ADS.\n\nFIXED - Zero's Argus Launcher screen isn't displaying anything.\n\nFIXED - Brava's left arm clips into her weapon in the Home section animation.\n\nFIXED - Operators lose functionality after attempting to pick up a throwable device while Brava's Kludge Drone is converting it.\n\nFIXED - Devices aren't deactivated after being converted by Brava's Kludge Drone if they're deployed near Mute's Signal Disruptor.\n\nFIXED - Nøkk's HEL Presence Reduction isn't detected by Solis' SPEC-IO Electro Sensor.\n\nFIXED - No scoring points are awarded for converting opponent devices with Brava's Kludge Drone.\n\nFIXED - Misplaced LED on Brava's Kludge Drone.\n\nFIXED - Wave VFX displays for enemy devices converted by Brava's Kludge Drone on IQ's Electronic Detector.\n\nFIXED - Brava's Kludge Drone has White LED lights instead of the selected Team Color while moving.\n\nFIXED - Nøkk's D-50 does not use the new reload system when reloading after firing the single round.\n\nFIXED - Brava's Kludge Drone LED is visible in first person while using the drone.\n\nFIXED - Brava's squad is missing from her bio.\n\n### USER EXPERIENCE\n\nFIXED - Reloading shotgun with one round in the chamber creates invisible shots in walls.\n\nFIXED - Incorrect render scaling setting while FSR is turned on.\n\nFIXED - Several navigation issues in the Operator Guide.\n\nFIXED - Rubber banding occurs occasionally at the beginning of the Action Phase in online multiplayer playlists.\n\nFIXED - Various information issues in the Spectator HUD.\n\nFIXED - Custom Game button has no text in Korean, Thai or Arabic.\n\nFIXED - The dynamic button for Situations will suggest the CQB Basics instead of Article 5.\n\nFIXED - All voice lines for time remaining play when a Custom Game round begins with Preparation Phase timer set to 0s.\n\nFIXED - Various reload rework issues.\n\nFIXED - Can reload faster on some weapons by cancelling the animation.\n\nFIXED - CAMRS and POF-9 weapons create an extra magazine in the map if the reload is cancelled by shooting a bullet.\n\nFIXED - Maestro's Evil Eye can't fire after Dokkaebi hacks Defender Observation Tools.\n\nFIXED - The player needs to input left - left -right to regain focus on the Operator Guide when there are no Operator Cards visible on Match Replay.\n\nFIXED - Mozzie's Pest Launcher can't reload if the first Pest is shot again after being picked up.\n\nFIXED - Incorrect name of Drone Skins category displayed in the Appearance section.\n\nFIXED - Brava's Kludge Drone LED color is desaturated and missing the glow VFX.\n\nFIXED - Zero's Argus Camera VFX overlay remains on screen for the player spectating whoever used the camera while Brava's Kludge Drone converted it.\n\nFIXED - Observation Tool VFX overlay remains on screen for the player spectating whoever used the camera while Brava's Kludge Drone converted it.\n\nFIXED - Mozzie's Pest is not affected by converted Mute's Signal Disruptor when it's shot from outside of its area.\n\nFIXED - Attackers are not kicked out of the Observation Tool after a hack.\n\nFIXED - Maestro's Evil Eye VFX remains visible on support mode right after being converted by Brava's Kludge Drone.\n\nFIXED - Overlapping UI elements on Brava's Parade Companion drone skin.\n\nFIXED - Various Operator icon issues.\n\nFIXED - Wrong ammo count displayed on the HUD while operating Brava's Kludge Drone.\n\nFIXED - Reload prompt is incorrectly displayed when performing a normal reload on weapon while Buck's Skeleton Key has one bullet left.\n\nFIXED - Hack VFX of Brava's Kludge Drone remains visible when spectating a player using the converted Observation Tool.\n\nFIXED - Brava's Kludge Drone hack completes before the progress bar is full.\n\nFIXED - Brava's Kludge Drone can overheat Defenders' dropped phones, preventing Dokkaebi from hacking them.\n\nFIXED - Inconsistent icon sizes when detecting Operator devices with IQ's Electronics Detector.\n\nFIXED - Ability Skin thumbnails fail to display when changing their skin to default and back.\n\nFIXED - The round timer UI element is shorter during the Planning Phase if the previous rounded ended while the defuser was planted.\n\nFIXED - If Wamai's Mag-NET was converted by Brava's Kludge Drone, picking up a Defender throwable midair while the Mag-NET is capturing it will cause a looping SFX.\n\nFIXED - If a Defender is using an Observation Tool while Brava's Kludge Drone converts it, the light doesn't change team colors.\n\nFIXED - Player in a Custom Game lobby can't change their ready state while someone is requesting to switch teams.\n\nFIXED - Various Localization issues.\n\nFIXED - LOD issues on various maps.\n\nFIXED - Various Shop and Customization issues.\n\nFIXED - Aim and shoot inputs are both on the \"L2\" button for the Lefty controller layout when the Aim option is set to Toggle.\n\nFIXED - Redirect not working when accessing the View Item button on the side-panel of the News menu.\n\nFIXED - Cleared tag is missing from cleared Breach Path tile preview of the Battle Pass.\n\nFIXED - Weapon skin fullscreen view is missing the Operator icons when redirected from the News section.\n\nFIXED - Missing animated tag for weapon skins.\n\nFIXED - The transparent background layer in the Reputation section doesn't cover the entire screen when the Menu Display Area option or certain aspect ratios are used.\n\nFIXED - The amount of missing currency is incorrect in the “Get Currency Packs” side panel when a player doesn't have enough R6 Credits to buy Battle Pass Levels.\n\nFIXED - Notification marker for new content available fails to display on Battle Pass tile.\n\nFIXED - Button to \"Unlock all Rewards\" remains functional after unlocking all levels resulting in incorrect messages displayed.\n\nFIXED - Completed personal challenges aren't displayed in the Post-Action Report.\n\n### PLAYER EXPERIENCE\n\nFIXED - Duplicated notifications are displayed.\n\nFIXED - Mouse sticks to top left corner of screen when closing the game.\n\nFIXED - Charms purchased through the View More section don't move to owned list\n\nFIXED - Sanction ribbon doesn't use alternate title for permanent sanctions.\n\n### AUDIO\n\nFIXED - Duplicate SFX plays when deploying Breach Charge on a breakable wall.\n\nFIXED - Audio inconsistencies can be heard by opponents.\n\nFIXED - Wrong SFX plays for toggles in the Options menu.\n\nFIXED - Drone SFX remains active for player if drone is destroyed by Vigil.\n\nFIXED - Vigil's ERC-7 SFX plays on loop for the droning Attacker who observed Vigil activate and deactivate his ability.","categories":["rainbow-six-siege","patch-notes"],"readTime":9,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1xLJqGTce4nquXpg4cZYDC/y8s1-commanding-force-patch-notes-addendum","date":"2023-03-07T17:45:00.000Z"},{"id":"65UBprZeK2lHJw1qKI8ygM","title":"MOUSE AND KEYBOARD ANTI-CHEAT FEATURE ON CONSOLES","abstract":"Information regarding MouseTrap, a new anti-cheat feature aiming to combat the unfair use of Mouse and Keyboard on Consoles.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4XwzSeWTfQSMS7k3yjUN1o/f1d894620807a8dba035746c2c0582b5/R6S_MnK_blogpost_thumbnail.jpg","content":"## Mouse and Keyboard on Consoles\n\nOn Consoles, we've noticed that some players are using external \"input spoofing devices\" which let them play with a Keyboard & Mouse instead of a controller. This gives them an unfair advantage against controller players. It's one of the biggest complaints on all competitive shooters, but especially on Rainbow Six Siege. We heard you and we totally agree that it's unfair when your opponents have such an advantage. That's why we have been developing a system to address this form of cheating. We called it *MouseTrap*.\n\n## What is MouseTrap?\n\nMouseTrap is a console-centric research and development initiative led by our Team at Rainbow Six Siege working specifically on this system. It is a detection tool that can sniff out input spoofers. It has actually been running in shadow mode, for several seasons, with the aim of building a better picture of which players are spoofing.  Now that we have that data, we can use it to improve fair play on Rainbow Six Siege.\n\n## Penalties \n\nWe really want to encourage those players to return to fair play if possible.  In doing so, we will be giving a new \"Mouse & Keyboard Penalty\" to players that we detect using a Spoofing device. This new penalty will add additional latency to the inputs of MnK users. In short, it will be harder to aim and shoot with your operator when the penalty is active. The lag will start low and build up over several games if the use of MnK is still detected.\n\nIf the player chooses to remove their spoofing device, the lag will be gradually reduced; returning to normal after a few games.\n\nAdditionally, not all players will be penalized. The higher your skill level, the more chance you have of being affected by this new penalty.\n\n<center>\n\n![[R6S] MnK blogpost - MNKGIF](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4YK6maqgJdmlkg0yUKplzQ/1a2b2a50a45b8cd4b1be5de73e6b417b/MNKGIF.gif)\n\n</center>\n\n## Accessibility\n\nWe've worked closely with our accessibility group to make sure that we take the needs of disabled players into account. The feature has been designed to reduce the chances of disabled players who use adaptive technology to access the game from being penalized.\n\nIf you are a disabled player and feel unfairly penalized, there will be an in-game QR code that you can use to contact us so that we can investigate so that we can use your feedback to fine-tune the system.\n\n![[R6S] MnK blogpost - MNK QR BLOGPOST](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3MeqiFVqikqg6Jww5NEEQ3/d972f7cb654f5d698d8a1ea7b22f6de6/MNK_QR_BLOGPOST.png)\n\n## Current stage\n\nWe are releasing something new and innovative with MouseTrap. However, it's still an experimental solution. Our objective is to restore a true balance between competition and skill, while increasing the fairness of Rainbow Six Siege and convey a positive experience for all players. We are committed to analyzing the results, improving the detection and tweaking the penalties in future seasons.\n\n## Release date\n\nMouseTrap releases April 11th! \n\nWith this update, we aim to improve the competitive experience on console. Penalties will now apply to players who used Mouse and Keyboard on consoles.\n\nAffected Game Modes: Team Death Match, Event, Quick Match, Arcade, Ranked, Unranked, Newcomer, Online Co-op & Custom Games.\n\nTo gradually decrease a MouseTrap penalty, players must plug in a regular controller and play in Events, Arcade, Quick Match, Newcomer, Ranked or Unranked.\n","categories":["anti-cheat"],"readTime":3,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/65UBprZeK2lHJw1qKI8ygM/mouse-and-keyboard-anticheat-feature-on-consoles","date":"2023-03-06T17:00:00.000Z"},{"id":"51HYg7wtev23dRtHf3nLcR","title":"RANKED 2.0: Y7S4 FINDINGS","abstract":"In this article, learn about our findings on the new Ranked system since its launch in Y7S4.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4mPoUw84fGpWUFU5eAhCYH/d8a10a70fa01336c858b4ba5261af03c/R6S_Ranked_2.0_Findings_Header.jpg","content":"In Y7S4, a new Ranked system called [Ranked 2.0](http://rainbow6.com/ranked2.0). was introduced, transforming the players’ experience on the matchmaking level.\n\n## WHAT WE DISCOVERED\n\nWith Ranked 2.0 being live for a full season, we can now share more information about what we’ve learned so far. We’ve included in this dev blog our discoveries as well as steps we will be taking to improve this system. For more details on what has changed since the launch of Ranked 2.0, please refer to this [dedicated article](http://rainbow6.com/ranked2.0).\n\n### RANKED PLAYER’S POPULATION\n\nSince the launch of Ranked 2.0, we've seen an increase in the Ranked players population. 41% of players have tried ranked at least once last season, which represents an increase when compared to the previous seasons for which the average was around 35%. Ranked players also played more matches. \n\n![[R6S] Ranked 2.0: Y7S4 Findings - Bar Graph](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6PZckqTZy4rIbbgaSn48ML/a35db0b06ba845dde7cec3e9a531af11/R6S_Ranked_2.0_Bar_Graph.png)\n\nWhen looking at the time spent on each game mode, we can clearly see how Ranked has grown to encompass an average of 51.4% of the global playtime spent in Rainbow Six: Siege, with the previous average being at around 39%.\n\n![[R6S] Ranked 2.0: Y7S4 Findings - Line Graph](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1r3T9bZOK2T7KmCdrdQPSj/7fd752f0fd991ed7172bb4e4359ece0b/Ranked_2.0_Line_Graph.png)\n\n### MATCHMAKING\nRemoving skill reset at the season’s start helped improve matchmaking balance and fairness. In Y7S4, the percentage of one-sided matches (matches ending in 4 or 5 rounds) reduced, meaning that matches were more even for everyone.\n\n<br>\n\n## WHAT WILL HAPPEN NEXT\n\nDespite good results from the new Ranked system, we are also aware of some issues that are affecting players in their ladder experience.\n\n### RANK DISTRIBUTION\n\nOverall, players seemed to reach a Rank equal to their hidden skill near the middle of the season. Players that reach that point and keep playing achieve a maximum of 1 to 2 divisions above their skill level, with fewer than a 0.05 percentage of players reaching higher than those 2 extra divisions which, overall, we are pleased about. \n\n### CHAMPIONS’ DISTRIBUTION  \n\nIt’s true that we’ve seen an increase in the number of players reaching the Champion’s Rank. However, as shown previously, hitting Champion remains a matter of skill. The average Champion player still takes around 100 matches to regain the Champions’ Rank which is what we expected and is in line with the previous season's rule. We know that reaching the top rank in Siege should feel like an accomplishment and that’s why we are working on a way to make it more challenging. We’ll have more to share on this in Y8S2. \n\n### LINEAL CLIMB PROGRESSION\n\nRight now, the common Ranked experience for players is earning +80RP per win for most of the season until they start getting close to their real Rank. This is not a positive experience for most players as the journey through those ranks starts to feel very linear. \n\nWe also feel like maintaining the same progression speed throughout much of the ladder does not represent the experience that we want, for example, a player with a hidden Skill  of 4000 should not progress through Copper and Bronze at the same speed as through Platinum and Emerald.\n\n## CONCLUSION\n\nRest assured that Ranked 2.0 has been built in order to make it easy to tweak this system as our goal is to continuously adjust and improve it based on our findings throughout the seasons. We are also happy to listen to your comments and feedback, which constantly helps us improve our game.\n\n<br>\n\n---\n\n<br>\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game), [Reddit](https://www.reddit.com/r/Rainbow6/), [Facebook](https://www.facebook.com/Rainbow6/) and on our [forums]( https://discussions.ubisoft.com/category/609/rainbow-six-siege).","categories":["rainbow-six-siege","dev-blogs"],"readTime":4,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/51HYg7wtev23dRtHf3nLcR/ranked-20-y7s4-findings","date":"2023-03-06T14:50:00.000Z"},{"id":"1KnEHmLAYUzeGMnKUVzwNT","title":"“Sometimes the only path to justice is through a bullet...” – Brava","abstract":"In Operation COMMANDING FORCE hard decisions lay ahead, and who better to handle the situation than our newest Attacker: BRAVA.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3XufzdxrgaxwZ310JiVJkI/6d6f00063aead935ef72219c761eef08/Y8S1_CommandingForce_IMG_MainKeyArt_1920x1080_textless.jpg","content":"In Operation COMMANDING FORCE hard decisions lay ahead, and who better to handle the situation than our newest Attacker: BRAVA. Joining the VIPERSTRIKE squad, Brava knows the weight of her choices can mean the difference between success and failure on the field.\n\nWith the KLUDGE DRONE in her arsenal capable of sabotaging the opponent’s tools and using them to her own advantage, BRAVA brings a powerful observation tool to the team. With 1 HEALTH, 3 SPEED, and the PARA-308 and CAMRS as primary weapons, Brava can snatch victory from the jaws of defeat, especially with the SMOKE GRENADE and CLAYMORE as gadget options.\n\nThe KLUDGE DRONE connects to opponent devices from a distance and allows BRAVA to use them for her own means. If the device can’t be converted, it’s destroyed. Defenders will need to rely on SOLIS’ SPEC-IO ELECTRO SENSOR to spot the drone before it can do any serious damage, or MOZZIE’S PEST to catch it.\n\nBorn in Curitiba Brazil and working with COT and specializing in counter tactics BRAVA turned impossible situations into successes because she is willing to do what’s needed, even when it requires sacrifice.\n","categories":["rainbow-six-siege","game-updates"],"readTime":1,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1KnEHmLAYUzeGMnKUVzwNT/sometimes-the-only-path-to-justice-is-through-a-bullet-brava","date":"2023-02-20T17:00:00.000Z"},{"id":"2fOZy6mrCdlSuGhNFSYrK9","title":"Y8S1 Designer's Notes","abstract":"In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y8S1 Balancing Test Server and give you some insight into the reasons behind them.","thumbnail":"https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1Q6sDU6CLWJNX5v5ZT6TQ2/2e9252744ada8da9fcd673e1eaa927cd/R6_DesignersNotes_Header.jpg","content":"# Y8S1 DESIGNER'S NOTES\n\nIn this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y8S1 Balancing Test Server and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n## WIN DELTA VS. PRESENCE\n\n<video width=\"100% !important;\" muted autoplay loop controls>\n<source src=\"https://staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4vIkHv5WGUEOsi8rE1dIG1/dba57fd2a7b1b4f5ae497254db30256e/R6S_DN_Y7S4.2_BalancingMatrix_Att.mp4\" type=\"video/mp4\"> \nYour browser does not support the video tag. \n</video>\n\n<br><br>\n\n<video width=\"100% !important;\" muted autoplay loop controls>\n<source src=\"https://staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5lah4XxgvrmzxoWrK7tFtQ/1659e97da81ca67c362334a5ef80accd/R6S_DN_Y7S4.2_BalancingMatrix_Def.mp4\" type=\"video/mp4\"> \nYour browser does not support the video tag. \n</video>\n\n<center><i>Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.</i></center>\n\n<center><i>Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.</i></center>\n\n## OPERATOR BAN RATE\n\n<video width=\"100% !important;\" muted autoplay loop controls>\n<source src=\"https://staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3wM367dc9HhiXIA6ISQxfM/2d384340bac6b1c6a8bed9ae453f72cf/R6S_DN_Y7S4.2_BanMatrix_Att.mp4\" type=\"video/mp4\"> \nYour browser does not support the video tag. \n</video>\n\n<br><br>\n\n<video width=\"100% !important;\" muted autoplay loop controls>\n<source src=\"https://staticctf.akamaized.net/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7zue5DRrTFQJ61WEFIux3h/c6f7500ccef07e4eab1b5bf102aec4fa/R6S_DN_Y7S4.2_BanMatrix_Def.mp4\" type=\"video/mp4\"> \nYour browser does not support the video tag. \n</video>\n\n## OPERATOR BALANCE\n\n### ZERO\n\n__ARGUS CAMERA__\n\n-   The camera won't pierce the surface automatically.\n-   The piercing action can only be initiated by Zero and only when controlling a deployed Argus Camera.\n-   Once the camera has pierced a surface, any living attacker can swap sides.\n\nWe intend to improve two aspects of Zero's gadget with this change.\n\nFirst, we want to make it easier to place the initial camera in more locations. Since it won't pierce automatically, you can place it wherever you want without worry it will be vulnerable from the other side of the wall. This should increase the stealth fantasy of being able to setup your camera network undetected to utilize it when your squad is in position.\n\nSecond, we're increasing the window of opportunity after piercing through a surface. With the manual interaction, you will decide when to pierce walls, meaning you will already be on the camera when this action happens. It will help you to gather intel or deal with some utility before it gets destroyed by defenders, something that could happen before you had access to your camera prior to this change.\n\n## WEAPON BALANCE\n\n### ONE IN THE CHAMBER\n\n__WEAPON RELOAD SYSTEM__\n\n-   If you interrupt the reload animation after the magazine is removed the weapon will remain without a magazine until the animation is completed.\n-   The ammunition is available once the magazine is attached to the weapon.\n-   If the weapon uses a closed bolt system, a bullet will remain in the chamber, if a reload of a partially spent magazine is interrupted. You can shoot this bullet at any time.\n\nRight now, reloading a weapon does not carry the same weight as other actions in the game as you can cancel it at any moment without consequence. Additionally, it can be frustrating when you hear someone reloading, start to push because you think they will be vulnerable, but they aren't.\n\nWe want to encourage thought before taking an action because you can end up in a situation where there is no place to reload your weapon safely. You'll have to be careful when taking on several engagements in a row. We also want to discourage random pre-firing; we've already made changes in this direction by reducing the maximum number of magazines on every weapon. So now, wasting bullets without a reason can put you in a disadvantageous position if the enemy waits until you reload to attack.\n\nAdditionally, this will make secondary weapons more impactful, as they will be your backup plan if you need to defend yourself while reloading. Going with the secondary shotgun or the Gonne-6 may now require more thought regarding the best loadout vs. survivability.\n\nOur goal with this change is to increase the tactical aspect of the game, encouraging players to be aware of their resources and stick closer to teammates, so they can cover each other.\n\n### COMPENSATOR\n\n__BASE STATS__\n\n-   Compensator effectiveness increased.\n-   Horizontal recoil: Reduction of 35% (from 15%).\n\nWe normalized the compensator's distribution to give players tools to customize weapon recoil, but the Compensator is not strong enough to compete with the latest changes to the other muzzle attachments. We hope that this change will make it an option again.\n\n### MUZZLE BRAKE\n\n__BASE STATS__\n\n-   Muzzle Brake effectiveness increased.\n-   First shot kick: Reduction of 50% (from 45%).\n\nThe Muzzle Brake is in the same situation as the Compensator, but is more balanced on DMRs, so we will increase the bonus slightly.\n\n## QUALITY OF LIFE IMPROVEMENTS\n\n### TWITCH\n\n__SHOCK DRONE__\n\n-   Deceleration power: Increased to 14 (from 5.9). You will stop sooner when releasing the input.\n\nWe are making the Shock Drone respond better to player input. This will be represented with less sliding when stopping. The overall responsiveness of the drone will feel snappier and give the player more precise control over their gadget.\n\n<br>\n\n---\n\n<br>\n\nTry out the latest Siege updates on the Test Server and don't hesitate to report any bugs or issues you encounter on the [new and improved R6Fix](https://r6fix.ubi.com/projects/RAINBOW6-SIEGE-TS).\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game), [Reddit](https://www.reddit.com/r/Rainbow6/), [Facebook](https://www.facebook.com/Rainbow6/) and on our [forums](https://discussions.ubisoft.com/category/609/rainbow-six-siege?lang=en-US).","categories":["patch-notes"],"readTime":5,"url":"https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2fOZy6mrCdlSuGhNFSYrK9/y8s1-designers-notes","date":"2023-02-20T14:50:00.000Z"}]