[
  {
    "id": "1T6yWQHcJZvPFpO6QaQjAG",
    "title": "Holiday Pack 2024",
    "abstract": "The Free 2024 Holiday Pack is available from December 23 2024 through January 3 2025.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4HCAIKCAUfu7n1BAz3cUgl/3421fc1e591c4af191c50ba71726d116/R6S_Y9S4_HolidayPack_960x540.jpg",
    "content": "Happy Holidays from the Rainbow Six Siege team! We've got a surprise for you!\n\nThe free 2024 Holiday Pack is available from December 23rd, 2024, through January 3rd, 2025.\n\nThe Holiday Pack contains 1 random unowned Operator or a Bravo Pack if all Operators are already owned.\n\nTo get your pack go the shop and claim the \"free gift\" item. The in-game news bulletin should also direct you there.\n\nWe hope you enjoy and have a great time heading into the new year.\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege",
      "store"
    ],
    "readTime": 1,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1T6yWQHcJZvPFpO6QaQjAG/holiday-pack-2024",
    "date": "2024-12-23T11:00:00.000Z"
  },
  {
    "id": "NFdKlD7aNKI9a98ICe8oq",
    "title": "Y9S4.1 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y9S4.1!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7uL0GFPrHHB2n2JVOix4TE/521a8badd25cad5a5d90df8734828bf5/PATCHNOTES_Y9S4.1_960x540.jpg",
    "content": "Here you can find the fixes for the Y9S4.1 patch.\n\n<br>\n\n## Y9S4.1 PATCH SIZE\n\nFind the download sizes for each platform below:\n\n- Ubisoft Connect: 32.8 GB\n- Steam: 5.3 GB\n- Xbox One: 8.09 GB\n- Xbox Series X: 7.9 GB\n- PlayStation®4: 9.8 GB\n- PlayStation®5: 7.4 GB\n\n<br>\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Squad leader is unable to select banned Operators in a Custom Lobby.\n\nFIXED - Timer animation for recharging Gadgets will grey-out when the available Gadgets reaches zero.\n\nFIXED - Context to toggle preview on or off is missing for Brava's Kludge Drone Twitch's Shock Drone guide.\n\nFIXED - Blackbeard's SR-25 clips through the H.U.L.L Adaptable Shield when viewed by an Opponent.\n\nFIXED - Blackbeard's H.U.L.L Adaptable Shield remains unequipped after performing a full reload in rappel.\n\nFIXED - Aim Down Sight desync between first-person and third-person view when Blackbeard is selected as an Attacker.\n\nFIXED - Task system is empty when selected for the first time through \"Wait in Shooting Range\" in Siege Cup or Matchmaking.\n\nFIXED - Weapons appear to float behind the Operators in the Weapon Roulette session.\n\nFIXED - Blackbeard doesn't get pushed back when colliding with Oryx's Remah Dash with his own dash ability.\n\nFIXED - Blackbeard's H.U.L.L Adaptable Shield can't vault through Osa's Talon-8 Clear Shield.\n\nFIXED - Teammate sprint animation isn't visible to the player in support.\n\nFIXED - Hard Breach Charge is floating on Azami's Kiba Barrier while being destroyed.\n\nFIXED - Instead of sprinting, the Operator seems to walk faster in third-person view.\n\nFIXED - Operator guides are accessed only by using D-pad in Match Replay.\n\n<br>\n\n### LEVEL DESIGN\n\nFIXED - Cubicle walls in 1F Open Area disappear when viewed from EXT Back Alley on the Bank map.\n\nFIXED - Skybox is too dark on several maps.\n\n<br>\n\n### OPERATORS\n\nFIXED - Reload animation for Golden Gun is missing for Operators in the Golden Gun Arcade Mode.\n\nFIXED - Skopós's idle V10 Pantheon Shell doesn't deploy its shield when spawned in 2F Penthouse on the Stadium Alpha map.\n\n FIXED - Skopós's Idle V10 Pantheon Shell doesn't deploy its shield when spawned in 1F Piano Room on the Stadium Alpha map.\n\nFIXED - Skopós's Idle V10 Pantheon Shell doesn't spawn properly in 2F Office on the Stadium Alpha map.\n\nFIXED - Skopós's Idle V10 Pantheon Shell spawns too close to the wall in 2F Lockers on the Stadium Alpha map.\n\n<br>\n\n### USER EXPERIENCE\n\nFIXED - Osa's Talon-8 Clear Shield skin thumbnail is too large to be previewed in the Loadout section.\n\nFIXED - Buck's Elite uniform is not visible on screen previews when selected.\n\nFIXED - Battle Pass Points total boost is at 30% on the After Action Report of Events.\n\nFIXED - Status Change notification on Reputation Tile remains visible when leaving and entering Career tab.\n\nFIXED - Ribbon for \"EXPAND YOUR ROSTER\" remains after operators have been purchased.\n\nFIXED - Tile effect is missing for The Old Stock Weapon Skin in the Battle Pass.\n\nFIXED - Buck's Elite device skin is oversized in the details window for the Elite uniform.\n\nFIXED - Blitz's Elite shield skin is shown twice in the details window for the Elite uniform.\n\nFIXED - Montagne's Elite Shield Skin is shown twice in the details window for the Elite uniform.\n\nFIXED - Negative or unusually high numbers appear for Battle Pass points after any PvP match.\n\nFIXED - User is unable to open related bundle sets.\n\nFIXED - Missing text on the \"Custom Game\" button in the main menu.\n\nFIXED - Title and image are missing on Thorn's Punk bundle modal.\n\nFIXED - Title is missing on Sledge's Strength bundle modal.\n\nFIXED - Commendation Streak action isn't given to players with Reputation Penalties.     \n\nFIXED - Players can't see Reverse Friendly Fire icon for other players if they have their own Reverse Friendly Fire active.\n\nFIXED - Disconnected players don't receive abandon sanctions when a match is cancelled due to the missing player.            \n\nFIXED - Placeholders are present in several sections in the How it Works tab of the Reputation menu.    \n\nFIXED - Mouse scroll doesn't work when hovering over item tile.\n\n<br>\n\n### AUDIO\n\nFIXED - Missing SFX for Blackbeard entering a window while H.U.L.L Adaptable Shield is equipped.\n\nFIXED - Operators sprinting SFX and animation are the same when viewed by an opponent.\n\nFIXED - Bomb SFX can be heard on loading screen before the prep phase.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 5,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/NFdKlD7aNKI9a98ICe8oq/y9s41-patch-notes",
    "date": "2024-12-12T12:15:00.000Z"
  },
  {
    "id": "6MQfBtcDbLYv6CbQxZg3pF",
    "title": "Y9S4 PATCH NOTES ADDENDUM",
    "abstract": "See the changes made over the course of the Y9S4 Season Test Server.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/39EacrmxvHewBJgDU6Rhfl/3d972c0d594a8aaa42c601ede224f7c6/PATCHENOTES_ADDENDUM_Y9S4_960x540.jpg",
    "content": "Here you can find the updates and fixes made over the course of the Y9S4 Season Test Server.\n\n## Y9S4 PATCH SIZE\n\nFind the download sizes for each platform below.  \n\n- Ubisoft Connect: 73.99 GB    \n- Steam: 14.8 GB    \n- Xbox One: 34.4 GB    \n- Xbox Series X: 40.7 GB    \n- PlayStation®4: 39.90 GB    \n- PlayStation®5: 36.74 GB    \n\n## Y9S4.0 PATCH\n\n- Shotguns ecosystem tweaks for PC and Console:\n- ADS Dispersion Cone Reduction: ITA12L, M590A1, M870, SG-CQB, FO-12, SASG-12.\n- Hip-Fire Dispersion Cone Reduction: ITA12L, M590A1, M870, SG-CQB, Supernova.\n- First Shot Reduced: M1014, SPAS12, Super 90, SASG-12.\n- Increased Vertical Recoil after first shot: M1014, SPAS12, Super 90.\n\n## WINDOW BLOCKER\n\n- To reduce toxicity and spawn peeking, players will no longer be allowed to navigate onto window ledges.\n- Vaulting and Hot-Breaching through windows will not be affected\n\n## TEXTURE REFORGE\n\n- A texture reforge has been done which means players will be expecting a larger than usual Patch Size (between 30 and 40GB update).\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Shield doesn't lean with the Operator when holding a grenade when viewed as an Opponent.\n\nFIXED - Blackbeard's H.U.L.L. Adaptable Shield occasionally doesn't block damage from throwable devices.\n\nFIXED - Defender Bots leave the building when player picks Montagne.\n\nFIXED - Barricades and objects behind them aren't destroyed by Impact Grenades thrown underneath them in 2F White Stairs on the Kanal map.\n\nFIXED - Defender Operator animation pauses briefly after being affected by Dokkaebi's Logic Bomb.\n\nFIXED - Goyo's Volcán Canister floats in the air after destroying Azami's Kiba Barrier if the canister is placed on the barrier.\n\nFIXED - Operator change stance when existing Observation Tools.\n\nFIXED - Sens' R.O.U. Projector System VFX and SFX remains when destroyed while being held by Wamai's MAG-NET System.\n\nFIXED - Aiming down sights during free-look causes shaking animations.\n\nFIXED - Hibana's X-Kairos pellets stick to the metal frame of hatches and clip through.\n\nFIXED - Dust VFX is missing in Third Person when using Sledge's Breaching Hammer.\n\nFIXED - Goyo loses points when detonating his Volcán Canister.\n\nFIXED - Player can vault through a single barricade window by breaking part of the barricade and using melee on the frame twice in a row.\n\nFIXED - Devices can't be deployed on debris of a destroyed Deployable Shield.\n\nFIXED - Players can clip through barricades by making a hole in the barricade and rappelling into the wall.\n\n### LEVEL DESIGN     \n\nFIXED - Luggage used as drone vent blockers are destructible and allow for line of sight when removed in 2F Master Bedroom on the Villa map.\n\nFIXED - Attackers can shoot through drone vents due to clipping issues with fire extinguishers used as drone vent blockers in 1F Throne Room on the Theme Park map.\n\nFIXED - Ying's Candelas and Fuze's Cluster Charges can be deployed through metal sheets in 2F Bedroom on the Oregon map.\n\nFIXED - Skopós's idle V10-Pantheon Shell spawns misaligned in 2F Cafeteria on the Yacht map\n\nFIXED - Operators can navigate on top of the fence by vaulting on the white van at EXT Parking on the Clubhouse map.\n\nFIXED - Thermite's Exothermic Charge can't destroy walls at EXT Gardens or EXT Front Balcony on the Emerald Plains map.\n\nFIXED - Players can deploy drones to look through wall in 2F Yellow Stairs on the Consulate Map.\n\nFIXED - Interaction lost for Valkyrie's Black Eye when deployed on a printer that is destroyed on the Bank map.\n\nFIXED - Skopós's idle V10- Pantheon Shell spawns without a shield in 1F Meeting Hall on the Oregon map on Hostage game mode.\n\nFIXED - Operators are able to navigate on top of a container by using Osa's Talon-8 Shield at EXT Generator on the Nighthaven map.\n\nFIXED -Rock texture isn't applied properly in Escape Tunnel B on the Clubhouse map.\n\nFIXED - Skopós's idle V10-Pantheon Shell spawns without its shield in 2F Engine Control on the Yacht map.\n\nFIXED - Skopós's idle V10-Pantheon Shell spawns too close to the wall in 1F Lounge on the Emerald Plains map.\n\nFIXED - Skopós's idle V10-Pantheon Shell is misaligned and clipping with the shield and objective when spawning in B Garage on the Consulate map.\n\nFIXED - Skopós's idle V10-Pantheon Shell spawns without its shield in the 2F Kitchen on the Yacht map.\n\n FIXED - Skopós's idle V10-Pantheon Shell spawns without its shield in the 4F Cockpit and 4F Maps Room on the Yacht map.\n\n### OPERATORS\n\nFIXED - Deimos's arm animation is delayed when aiming down sight of the .44 Vendetta.\n\nFIXED - Blackbeard's H.U.L.L Adaptable Shield doesn't lean with him after breaching a wall.\n\nFIXED - Blackbeard's MK17 reload cancel animation is not working properly.\n\nFIXED - Blackbeard's feet are twisted when breaching from rappel with H.U.L.L Adaptable Shield equipped.\n\nFIXED - Hibana's X-Kairos spins in her hand while she remains idle in the Operator section.\n\nFIXED - Blackbeard's H.U.L.L Adaptable Shield is present in his Guerilla Victory Celebration.\n\nFIXED - Smoke VFX incorrectly displays when using Blackbeard's H.U.L.L. Adaptable Shield breach.\n\nFIXED - Frost VFX from Tubarão's Zoto Canister applies to the scope twice when aiming the CSRX3000 inside the Zoto Canister area of effect.\n\nFIXED - Skopós's idle V10-Pantheon Shell spawns in T-Pose occasionally.\n\nFIXED - Vertical Grip triggers standard magazine reload animation for Nomad's Airjab Launcher.\n\nFIXED - Unable to scan Operators for 3 to 4 seconds after Capitão's Tactical Crossbow Smoke Dart dissipates.\n\nFIXED - Nøkk's HEL Presence Reduction VFX persist occasionally if she is eliminated while the effect is active.\n\nFIXED - Operators can get stuck between a security cart and gun cabinet in the Aiming Lane on the Shooting Range map.\n\nFIXED - Skopós's V10-Pantheon Shell LED lights clip into the shoulder.\n\nFIXED - Oryx can clip through walls to climb a hatch in another room.\n\nFIXED - The LED indicators on Skopós's active V10-Pantheon Shell aren't affected by changes to team color settings.\n\nFIXED - Text prompt is misaligned with the center of the screen when activating Deimos' DeathMARK.\n\nFIXED - Kapkan's arm clips through barricades when deploying Entry Denial Device.\n\nFIXED - Hibana's X-Kairos pellets are red instead of white when equipped with the elite skin.\n\nFIXED - Full reload animation plays instead of the gadget reload for Nomad's Airjab on an ARX200 when the iron sight is equipped with any grip attached.\n\nFIXED - Missing VFX for Sens's R.O.U. Projector System if the projector is destroyed while deploying.\n\nFIXED - Players can clip through the shield of Skopós's idle V10- Pantheon Shell and take damage.\n\n### USER EXPERIENCE\n\nFIXED - The status change notification is missing from the Reputation tile.\n\nFIXED - Attackers enter into a T-pose when equipping Smoke Grenades.\n\nFIXED - Skopós's idle V10-Pantheon Shell blocks players from reinforcing walls from the same side.\n\nFIXED - Skopós's Idle V10-Pantheon Shell blocks players from barricading doorways from the same side.\n\nFIXED - Ping input disappears from the HUD after exiting a damaged Bulletproof Camera.\n\nFIXED - Mute's Signal Disruptor reappears when viewed in Match Replay after being destroyed.\n\nFIXED - Frost's Welcome Mat body reappears when viewed in Match Replay after being destroyed.\n\nFIXED - Thunderbird's Kona Station reappears when viewed in Match Replay after being destroyed.\n\nFIXED - The Hard Breach Charge reappears when viewed in Match Replay after being destroyed.\n\nFIXED - Valkyrie's Black Eye reappears when viewed in Match Replay after being destroyed.\n\nFIXED - Claymore reappears when viewed in Match Replay after being destroyed.\n\nFIXED - Thermite's Exothermic Charge reappears when viewed in Match Replay after being destroyed.\n\nFIXED - Smoke's Remote Gas Grenade reappears when viewed in Match Replay after being destroyed.\n\nFIXED - Several deployable devices reappear when viewed in Match Replay after being destroyed.\n\nFIXED - Defenders see a drop in FPS when Attackers switch Operators.\n\nFIXED - Retro Steel weapon skin appears on the equipped sight in the thumbnail for the .44 Mag Semi-Auto handgun.\n\nFIXED - Blackbeard's H.U.L.L. Adaptable Shield charm is positioned incorrectly in some situations.\n\nFIXED - Operators leave a floating device on the map when viewed in Match Replay if they equip their device then swap back to their primary weapon.\n\nFIXED - Operators have the outline of the opposing team in Spectator mode.\n\nFIXED - Melee weapon clips into the Operator's hand when viewed in Match Replay if they melee and then swap to their Unique Ability.\n\nFIXED - Dropped defuser icon is missing in Spectator mode.\n\nFIXED - Defuser icon in the overhead camera of Spectator mode is different than in the first-person point of view.\n\nFIXED - Equipped weapon skin doesn't update to default if the current equipped weapon skin is sold on the Marketplace.\n\nFIXED - Dust particles floating in the air appear larger than intended.\n\nFIXED - Reconnect button and banner appear while waiting for a match to begin in Siege Cup.\n\n### AUDIO\n\nFIXED - Blackbeard's sprint animation and corresponding SFX aren't in sync when equipped with the MK17.\n\nFIXED - Shooting SFX present when using Maverick's Breaching Torch.\n\nFIXED - Drone landing SFX triggers when previsualizing the jump trajectory.\n\n### KNOWN ISSUES\n\nPC players can tell who is a Console player in their lobby. This and other areas where they can be identified are being addressed in Y9S4.1 patch.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 9,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6MQfBtcDbLYv6CbQxZg3pF/y9s4-patch-notes-addendum",
    "date": "2024-12-03T10:15:00.000Z"
  },
  {
    "id": "5mPizyvgMnc7itNGlIIJPN",
    "title": "Y9S4 Streamer Charms",
    "abstract": "New Rainbow Six Siege Streamer Charms for Y9S4!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2ze0ay3Fj2esnZ8s2K7xiY/25d8ea8ddf3d981559cd577614c94475/-R6S-_Y9S4_Streamer_Charms_-_thumbnail.jpg",
    "content": "# New Rainbow Six Siege Streamer Charms for Y9S4!\n\n## Announcing the next Streamer Charms!\n\nEach season will bring the release of new charms, as well as the return of streamer charms from previous seasons!\n\n## New\n\n![-R6S- Y9S4 Streamer Charms - thumbnail](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2ze0ay3Fj2esnZ8s2K7xiY/25d8ea8ddf3d981559cd577614c94475/-R6S-_Y9S4_Streamer_Charms_-_thumbnail.jpg)\n\n[MeatyMarley](https://www.twitch.tv/meatymarley)\n[ThatOneBritt](https://www.twitch.tv/thatonebritt)\n[TitaniumRolo](https://www.twitch.tv/titaniumrolo)\n\n## Returning\n\n![-R6S- Y9S4 Streamer Charms - 1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/76EkMXQ5RTaBe93r6d5mrp/a924ce84ab89b01d1ac5945da5a55f40/-R6S-_Y9S4_Streamer_Charms_-_1.jpg)\n\n![-R6S- Y9S4 Streamer Charms - 2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4Dnb4zGc5Ujx6FVapBE2Hj/05ab27124b3cf248e2351a0b8c4d8019/-R6S-_Y9S4_Streamer_Charms_-_2.jpg)\n\n![-R6S- Y9S4 Streamer Charms - 3](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4jYtJABNA4BUrHiDwjNhRg/221823f17d94f2db72d2722388734607/-R6S-_Y9S4_Streamer_Charms_-_3.jpg)\n\n![-R6S- Y9S4 Streamer Charms - 4](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6sWyW29OEv727wXqE0EWG3/a30a5992fe53eaf645f1ea06a6c1dbeb/-R6S-_Y9S4_Streamer_Charms_-_4.jpg)\n\n![-R6S- Y9S4 Streamer Charms - 5](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/I96CNcBmHHswQdhQKXUJ7/1e70bb0f5d6a6f0f38705ba9f83048d1/-R6S-_Y9S4_Streamer_Charms_-_5.jpg)\n\n![-R6S- Y9S4 Streamer Charms - 6](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1a0iSeIYB0QWNed9Xxyyl5/d9810159997f6cd24722bf954a28cf96/-R6S-_Y9S4_Streamer_Charms_-_6.jpg)\n\n[Alfredoplays](https://www.twitch.tv/alfredoplays)\n[AnneMunition](https://www.twitch.tv/annemunition)\n[Beaulo](https://www.twitch.tv/beaulo)\n[Bighead](https://www.twitch.tv/bighead033)\n[BikiniBodhi](https://www.twitch.tv/bikinibodhi)\n[Bnans](https://www.twitch.tv/bnans)\n[Braction](https://www.twitch.tv/bractionfps)\n[Drid](https://www.twitch.tv/dridgg)\n[FastAnne](https://www.twitch.tv/fastanne)\n[Gabbo](https://www.twitch.tv/JustGabbo)\n[Heideltraut](https://www.twitch.tv/heideltraut)\n[Interro](https://www.twitch.tv/interro)\n[JerichoFive](https://www.twitch.tv/jerichofive)\n[JessGOAT](https://www.twitch.tv/jessgoat)\n[Jynxzi](https://www.twitch.tv/jynxzi)\n[Just9n](https://www.twitch.tv/just9n)\n[KingGeorge](https://www.twitch.tv/KingGeorge)\n[KittyR6](https://www.twitch.tv/kitty_r6)\n[LagonisR6](https://www.twitch.tv/lagonis)\n[Lil_Lexi](https://www.twitch.tv/lil_lexi)\n[Lt Custard](https://www.twitch.tv/lt_custard)\n[Lusorkoeffizient](https://www.twitch.tv/lusorkoeffizient)\n[MacieJay](https://www.twitch.tv/MacieJay)\n[Mag6](https://www.twitch.tv/mag6)\n[M3ry](https://www.twitch.tv/m3ry)\n[Matimi0](https://www.twitch.tv/matimi0)\n[MrBboy45](https://www.twitch.tv/mrbboy45)\n[Narcoleptic Nugget](https://www.twitch.tv/narcolepticnugget)\n[Nesk](https://www.twitch.tv/neskwga)\n[PaladinAmber](https://www.twitch.tv/paladinamber)\n[Patife](https://www.twitch.tv/patife)\n[Pengu](https://www.twitch.tv/pengu)\n[RazaH](https://www.twitch.tv/razah)\n[REMGURI / 렘쨩](https://www.twitch.tv/remguri)\n[Rubsarb](https://www.twitch.tv/Rubsarb/)\n[SexyCake](https://www.twitch.tv/smexycake)\n[Sha77e](https://www.twitch.tv/sha77etv)\n[Shorty](https://www.twitch.tv/shortyyguy)\n[shroud](https://www.twitch.tv/shroud)\n[SilphTV](https://www.twitch.tv/silphtv)\n[Tatted](https://www.twitch.tv/tatted)\n[Tranth](https://www.twitch.tv/tranth)\n[Varsity](https://www.twitch.tv/varsitygaming)\n[WhiteShark67](https://www.twitch.tv/whiteshark67)\n[yo_boy_roy](https://www.twitch.tv/yo_boy_roy)\n[z1ronic](https://www.twitch.tv/zironicdk)\n[Zander](https://www.twitch.tv/zander)\n[ziGueira](https://www.twitch.tv/zigueira)\n[GarfieldIsDoc](https://www.twitch.tv/garfield)\n[Supr](https://www.twitch.tv/supr)\n[RyyFyy](https://www.twitch.tv/ryyfyy)\n[FoxA](https://www.twitch.tv/foxa_r6)\n[Nerdengenheiro](https://www.twitch.tv/nerdengenheiro)\n[Rainbow6itacom](https://www.twitch.tv/rainbow6itacom)\n[Minimichegga](https://www.twitch.tv/minimichegga)\n[JostRekt](https://www.twitch.tv/jost)\n[JustRyuk](https://www.twitch.tv/justryuk)\n[Paluhh](https://www.twitch.tv/paluhh)\n[Poxonlox](https://www.twitch.tv/poxonlox)\n[TheLionerYT](https://www.twitch.tv/thelioneryt)\n[itsSpoit](https://www.twitch.tv/itsspoit)\n[Retalha](https://www.twitch.tv/retalha)\n[FooYa](https://www.twitch.tv/fooya)\n[IceCold](https://www.twitch.tv/icecold)\n[Athieno](https://www.twitch.tv/athieno)\n[Marciu](https://www.twitch.tv/marciu)\n[Rembeey](https://www.twitch.tv/reembey)\n[rasco100](https://www.twitch.tv/rasco100)\n[Vetelcito01](https://www.twitch.tv/vetelcito01)\n[OneShooter](https://www.twitch.tv/oneshooter)\n[Scythe](https://www.twitch.tv/scythe)\n[Jenz](https://www.twitch.tv/jenz)\n[Frankystrings](https://www.twitch.tv/frankystrings)\n[Eternal_regina](https://www.twitch.tv/eternal_regina)\n[Pxppy](https://www.twitch.tv/eternal_regina)\n[Skyte](https://www.twitch.tv/skyte)\n[Ru_rumiiiin](https://www.twitch.tv/ru_rumiiiin)\n[Anifex](https://www.twitch.tv/anifex)\n[Vetelcito](https://www.twitch.tv/vetelcito01)\n[Priest](https://www.twitch.tv/omgitspriest)\n[Nonomiyamika](https://www.twitch.tv/nonomiyamika)\n[alyttleton](https://twitch.tv/alyttleton)\n\n## Program Update\n\nWe have implemented additional screening procedures into our selection process for streamer charms.\n\nUpon selection for the program, streamer charm candidates' main and alt accounts are now screened for MouseTrap violations, in addition to the other screening steps they undergo for eligibility.\n\n## How to acquire charms\n\nThese charms are only available by subscribing to the respective streamer's Twitch channel with a linked Ubisoft account. For more information on how to link your Ubisoft and Twitch account, as well as opt in for Twitch Drops, please refer to [this FAQ](https://support.ubi.com/Faqs/000035432/Get-your-Twitch-Streamer-s-charm).\n\n## How to get involved\n\nWe have updated the Ubisoft Creators Program registration to open the program to TikTok and Instagram, therefore opening new collaboration opportunities for content creators, streamers, fan artists, and cosplayers from our community.\n\nWe are always on the lookout for content creators that inspire and enrich the Siege community. If you would like access to the perks of being a partnered content creator, and your goal is to one day have a charm in the game, we would like to invite you to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/en-us).\n\nFrom there, complete the following steps:\n\n1. Connect your Ubisoft Account. If you do not have one, you can create one [here](https://connect.ubisoft.com/create).\n\n2. Agree upon the eligibility criteria.\n\n3. Connect your primary channel (Twitch, YouTube, TikTok, Instagram) or secondary channels.\n\n4. Indicate your games preferences.\n\n5. Set your location, broadcast language, and communication language.\n\nYour application will then be submitted and must be approved by Ubisoft. An email will be sent to confirm your participation.",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5mPizyvgMnc7itNGlIIJPN/y9s4-streamer-charms",
    "date": "2024-11-29T16:30:00.000Z"
  },
  {
    "id": "qvAE3p87KtfLUhvTVTjUg",
    "title": "Y9S4 Designer's Notes",
    "abstract": "In this latest edition of Designer’s Notes, we'll go into more detail about the balancing changes that’ll come with the Y9S4 update and give you some insight into the reasons behind them.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/eLMBPGP1C747kzpP9h9Yh/168dfa4d40c7999a371c2827b9f0812c/DESIGNER_NOTES_Y9S4_960x540.png",
    "content": "In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y9S4 update and give you some insight into the reasons behind them. \n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n### WIN DELTA VS. PRESENCE\n\n![[R6S] Y9S4 Designer's Notes - BalancingMatrix_Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1cFpZG4LPiG8ay0HIzcPeW/ea386bb4dc227cbba542898aa96c3dae/R6S_DN_Y9S4_BalancingMatrix_ATTK.mp4)\n\n![[R6S] Y9S4 Designer's Notes - BalancingMatrix_Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4iIBz89GHJNAEoySAG5eU0/22f490d68fe686e4d02e7c8d81973969/R6S_DN_Y9S4_BalancingMatrix_Def.mp4)\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n### OPERATOR BAN RATE\n\n![[R6S] Y9S4 Designer's Notes - BanMatrix_Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/31CRMgA1e0T4h9ckMuDfch/542422a8cb129c7c163f1ca6279fa824/R6S_DN_Y9S4_BanMatrix_Attk.mp4)\n\n![[R6S] Y9S4 Designer's Notes - BanMatrix_Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2Nc9WmbQ7Mb5qaRqSy2sNL/d84552c5633e29fab049fe82fbb9370f/R6S_DN_Y9S4_BanMatrix_DEF.mp4)\n\n# OPERATOR BALANCING\n\n### BLACKBEARD\n\nBlackbeard's ability is designed to provide a defensive advantage while remaining lethal. Despite numerous adjustments to balance his ability, success has been limited. Currently, the Rifle Shield can withstand only 20 HP, making it unreliable for protection. This frustrates both Blackbeard and his opponents, as it can block a single headshot but leaves Blackbeard vulnerable.\n\nTo address this frustration, we decided to eliminate the Rifle Shield and introduce a completely new gadget. The Blackbeard Remaster aims to balance his defensive and offensive capabilities. Additionally, we want Blackbeard to contribute more than just killing potential to his team. Blackbeard's new gadget is the H.U.L.L. Adaptable Shield. This shield functions like any other Ballistic Shield but with added features:\n\n- __Rappel Shield__: Blackbeard can change the shield's shape to use it while rappelling.\n\n- __Breaching Dash__: Blackbeard can perform a short, powerful dash using the H.U.L.L. Adaptable Shield's pneumatic system to breach Soft Walls, Barricades, Deployable Shields, Armor Panels, Talon Shields, and Kiba Barriers. After breaching, he will be concussed and slowed for a few seconds.\n\n- __Big Guns__: Blackbeard can use Primary Weapons (Mk-17 and SR-25) while wielding the Ballistic Shield. However, he cannot hip fire like other shield operators and will expose his upper body when aiming and reloading.\n\nWe've aligned this new gadget with some changes to the Operator Balance aiming to compensate for his new fast breaching capabilities. Blackbeard will now move slower, as a 1 Speed / 3 Armor Operator. He no longer has access to the D-50, and the Stun grenades have been removed.\n\nWe want Blackbeard to fulfill two main roles. As a Rappel Master, he should be able to sit comfortably on rappel behind his shield, watching the enemy and gathering intel. Additionally, he can now use the H.U.L.L. Adaptable Shield's breaching capabilities to push forward, hunt roamers with the team, and secure a path for the rest of the team.\n\n#### BASE STATS\n- Armor: 3\n- Speed: 1\n\n#### H.U.L.L. ADAPTABLE SHIELD\n- Breaching Ability\n  - Max. resources: 4 Charges.\n  - 8 seconds Cooldown between use.\n\n#### LOADOUT\n- H.U.L.L. Adaptable Shield\n- Primary weapons:\n  - Mk-17\n    - Damage increased to 44 (was 40)\n    - Magazine Size increased to 25 (was 20)\n    - Total ammunition increased to 226 (was 181)\n  - SR-25\n- Gadgets: Frag Grenades, Claymores.\n\n### MONTAGNE\n\nThe new fix we implemented for Ballistic Shield's guard break (more details below) made Montagne too vulnerable with the current configuration. The accumulative guard break strength allowed a single defender to take him down too easily. To address this, we have reduced the opening caused by a single melee attack. However, it's important to note that the overall opening a defender can create is now larger. Previously, with the third melee, the strength would be 40%, but with the new fix, it will be approximately 60%.\n\nMontagne must be smart when facing multiple defenders because if they collaborate, he won't be able to hold them anymore.\n\n#### LE ROC SHIELD\n- Guard break animation strength when melee'd reduced to 20% (from 40%).\n\n### SENS\n\nThe new ability to turn the R.O.U. Projectors on and off will introduce a fresh layer of strategy when using Sens. This enhancement will make Sens' gameplay more dynamic, granting greater control over the gadget to precisely manage lines of sight. Defenders will need to exercise more caution when moving around, as the wall can disappear at any moment. Additionally, the projector's battery depletes only when the wall is active. Sens will have ample time to plan and deploy all the projectors without rushing, allowing for precise placement.\n\nTo limit chaos and minimize potential mistakes, we have also reduced the number of projectors deployed per system. Additionally, we have shortened the distance at which the light wall starts to blind operators when they are too close. This adjustment makes it more comfortable for attackers to move around and less punishing for defenders who choose to take the risk of passing through.\n\nWe have enhanced the light walls to be resistant to Thermal View devices such as Glaz, Warden, Evil Eyes, and Bulletproof Cameras. This improvement will differentiate the R.O.U. Projectors from regular Smoke Grenades, making Sens the preferred choice for smoke-plants.\n\n#### R.O.U. PROJECTOR SYSTEM\n- New Switch Ability Mode to turn On and Off the projectors.\n- The projectors' battery only depletes while the walls are On.\n- Reduced number of projectors to 7 (from 10).\n- Reduced distance in which the wall starts to block vision to 0.75 meters (from 1.15),\n- Thermal View gadgets cannot see through the Wall.\n\n### THUNDERBIRD\n\nThe Kóna Station will now not only provide a flat heal but also grant a Health Regeneration buff to the target. This enhancement aims to make each station more valuable for sustaining teammates through the round. With this change, Thunderbird can distribute her resources more effectively, as a single station will be capable of bringing operators back to full health. However, this buff will disappear immediately upon taking damage or reaching full health, encouraging player to use it wisely and stay out of danger to maximize its benefits.\n\nAdditionally, the inclusion of the ITA12S will offer more flexibility to her loadout, allowing for the creation of new lines of sight for the stations to function without significantly compromising firepower.\n\n#### KÓNA STATION\n- Added new Health Regeneration buff.\n- Regeneration speed: 2hp per second.\n- Buff end conditions: Receive damage or reach 100% health.\n\n#### LOADOUT\n- Secondary weapons: Added ITA12S\n\n### YING\n\nYing has always been one of the more frustrating operators to face, so we have decided to make some adjustments to her Candela. We have removed the insta-trigger option to provide defenders with more opportunities to counteract it. This change allows defenders to make rapid tactical decisions, keeping the gameplay engaging and ensuring that both attackers and defenders have meaningful choices to make.\n\nDefenders can now use the brief delay before the Candela detonates to move to safer positions and avoid the full impact. This should make the gameplay more dynamic, rewarding quick thinking and movement.\n\nThe additional delay also gives defenders a chance to potentially destroy the Candela. This interaction encourages defenders to stay alert and actively engage with Ying's gadget, rather than passively waiting for the effect to go off.\n\nMoreover, the need to time the Candela correctly will highlight player skill. An insta-trigger setting reduced the skill ceiling, making it easier but less rewarding. Additionally, the extra time and audio feedback will hep teammates coordinate better and avoid being caught off guard by an unexpected Candela.\n\n#### CANDELA\n- Rolling distance:\n  - 0 charges: 10 meters\n  - 1 charge: 7.5 meters\n  - 2 charges: 5 meters (from 2.6)\n  - 3 charges: 2.5 meters (from 0)\n- Piercing time:\n  - 0-1 charges: 3 seconds\n  - 2 charges: 2 second\n  - 3 charges: 1 seconds\n\n# GADGET BALANCING\n\n### STUN GRENADES\n\nReducing the number of Stun Grenades helps minimize the overwhelming effect where defenders are frequently bombarded with flashes, leading to a less enjoyable experience. Overuse of Stun Grenades can create a chaotic environment, overshadowing skill and strategy with volume of utility use. This can make the game feel less tactical and more about who can throw the most grenades rather than who can outsmart and outplay their opponents.\n\nBy limiting the availability of Stun Grenades, we aim to encourage more skill-based engagements and strategic play. This change enhances the effectiveness of projectile catchers like Jäger and Wamai. With fewer projectiles in play, they can use their gadgets more efficiently, allowing defenders to maintain control over important areas for longer periods and protect crucial utility without the fear of their gadgets being exhausted too quickly.\n\nWe believe that holding a strong position is generally more efficient than peeking outside of the building, and this change should allow defenders to do so more comfortably. Defenders should utilize their utility and the environment to their advantages, reducing the chances of being eliminated too early in the round. This approach also supports better team coordination, allowing defenders to cover each other's angles, set up crossfires, and use their gadgets more effectively, which is crucial for maintaining control over key areas and objectives.\n\n#### BASE STATS\n- Max. number: Reduced to 2 gadgets per operator (from 3).\n\n#### OPERATORS AFFECTED\n- Amaru\n- Buck\n- Dokkaebi\n- Finka\n- Flores\n- Hibana\n- Lion\n- Maverick\n- Nomad\n- Ram\n- Sledge\n- Striker\n- Thermite\n\n# WEAPON BALANCING\n\n### BALLISTIC SHIELDS\n\nThe Suppressive Fire mechanism is intended to prevent and interrupt shield's sprinting ability, assisting defenders in stopping aggressive players and giving them time to reposition or seek for help. However, we have observed that the system is not being used as frequently as we expected. This could be because defenders find it difficult to recognize when the effect is active, making it hard to judge if shooting at the shield is worthwhile.\n\nTo address this issue, we have reduced the number of bullets required to trigger the effect, ensuring that all the gameplay consequences of being suppressed are easier to apply. Additionally, we have adjusted the number of bullets needed to reach maximum intensity, making the effect last longer. Please note that high-caliber weapons will require fewer bullets.\n\nFurthermore, we are also looking to refine the abilities, specifically the melee attack. In its current form, it encourages shielded players to play more aggressively than intended. The new animation and damage make it the most effective way to take down targets. However, the initial intention was for it to create an opening for a teammate or the player's handgun -exposing himself- to secure the kill.\n\nTherefore, we have decided to completely remove the damage from the melee attack. This change aims to eliminate the ability to be overly aggressive and increases the risk of being too close to a defender.\n\nAdditionally, we have resolved several issues impacting their power level. The guard break animation now functions as a stun, meaning the shielded operator is unable to do anything until the guard break animation ends. This makes the shielded operator vulnerable until the animation completes, and its duration and intensity can be increased by chaining multiple hits to the shield. Finally, we have also refined the melee range checks, so the battle will be fairer.\n\n#### MELEE\n- Damage reduced to 0hp (from 65).\n\n#### SUPPRESSIVE FIRE\n- Reduced number of bullets required to trigger the effect to 5 (from 10).\n- Reduced number of bullets required to reach its maximum intensity to 20 (from 40).\n\n#### GUARD BREAK\n- Consecutive guard breaks can stack to increase the opening (instead of being ignored if the animation was already playing).\n\n#### OPERATORS AFFECTED\n- Blackbeard\n- Blitz\n- Clash\n- Fuze\n- Montagne\n\n### SHOTGUNS\n\nWe are reviewing the performance and balance of the shotgun ecosystem. Our goal is to enhance the viability and comfort of certain semiautomatic shotguns. For example, the M1014 is currently difficult to control after the first shots, and we aim to address this. Semiautomatic weapons will now be easier to use and more powerful.\n\nIn this revision, we will also improve pump shotguns and automatics by tightening their dispersion cones. We've set them at a midpoint between their current state and the improvement previously granted by old laser attachments.\n\nSome shotguns are already performing well, like the Supernova or SPAS-15, so we have decided not to make significant changes to them. This set of changes should bring the underperforming shotguns closer to the ones players already favor.\n\n#### BASE STATS\n\n- ADS Dispersion Cone Reduction\n  - ITA12L\n  - M590A1\n  - M870\n  - SG-CQB\n  - FO-12\n  - SASG-12\n\n- Hip-Fire Dispersion Cone Reduction\n  - ITA12L\n  - M590A1\n  - M870\n  - SG-CQB\n  - Supernova\n\n#### RECOIL - PC & CONSOLE\n\n- First Shot Reduced\n  - M1014\n  - SPAS12\n  - Super 90\n  - SASG-12\n\n- Increased Vertical Recoil after first shot\n  - M1014\n  - SPAS12\n  - Super 90\n\n# Y9S3 RANK DISTRIBUTION\n\n![[R6S] Y9S4 Designer's Notes - Rank Distribution PC](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/bFZrjePAhHwaDEhM23agw/5a94fad6f453fe9711b5c8d27807cd49/Y9S3_Rank_Distribution_PC.png)\n\n![[R6S] Y9S4 Designer's Notes - Rank_Distribution_Console](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5nSxnSBRCIqaaiPPNqKTNf/70fd0e350a49cf36fc44ffc4b37aba64/Y9S3_Rank_Distribution_Console.png)\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege",
      "dev-blogs"
    ],
    "readTime": 12,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/qvAE3p87KtfLUhvTVTjUg/y9s4-designers-notes",
    "date": "2024-11-18T13:45:00.000Z"
  },
  {
    "id": "31LLHuTF4jb7xzamPNqRpy",
    "title": "Y9S3 MID-SEASON ROADMAP UPDATE",
    "abstract": "Check out what's coming to Rainbow Six Siege in the Y9S3 Mid-Season Roadmap Update.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/45ymT2lvv9pk0aMxpD9gQh/316f7cd039135b25a0f2e8e4b46f4de8/Y9S3_Mid-SeasonRoadmap_960x540.jpg",
    "content": "Each season, we provide a Roadmap update to offer further insights into the development of upcoming features to ensure transparent communication with all players. Each update and decision we make takes into account various elements such as player feedback, time allocated to ensure the quality of the features delivered, and more. \n\nWith that in mind let's delve into this Mid-Season Roadmap Update!\n\n![[R6S] Y9S3 Mid-Season Roadmap Update - roadmap](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/T86DuIiZAdCLdV4dkAkY6/4033f8e2d45ee0a29f24f420e0d4e98e/RoadmapUpdate.960x540.jpg)\n\n## ROADMAP UPDATES\n\n### [NEW] [BALANCING] SHIELD NERF\n\n- __Status: Confirmed for Y9S4__\n\nThe revamped shield mechanic was first released in Y9S1 and since then we've seen an evolution in their overall usage, becoming more relevant and impactful. It's now time for shields to be adjusted and to reduce their oppressiveness.\n\n### [NEW] [PLAYER COMFORT] PHANTOM PLAYER - IMPROVED LOBBY BALANCING\n\n- __Status: Confirmed for Y9S4__\n\nPhantom Player is coming to enhance the experience of all players. In a nutshell, the Phantom Player is a mathematical value, a ''6th player'', which will bring an extra layer of balancing to matchmaking. Concretely, the Phantom Player sees the skill disparity between players of a stack and adds the appropriate skill value to even out the matches depending on the number of players within this stack.\n\n### [MAJOR FEATURES] CONSOLE TO PC CROSSPLAY 1.0 + MOUSETRAP IMPLEMENTATION\n\n- __Status: Confirmed for Y9S4__\n\nConsole to PC Crossplay will enable PC and console to play together. This will work by allowing console players to join their PC friends, opting into the PC matchmaking pool. In Y9S4 MouseTrap will also force confirmed mouse and keyboard console players into PC matchmaking, with PC recoil values.\n\n### [MAJOR FEATURES] CHEATER MATCH CANCELLATION\n\n- __Status: Confirmed for Y9S4__\n\nWith Cheater Match Cancellation, once a cheater is confirmed and consequently banned, the match they are in will be automatically cancelled. This will lead to less time being spent by honest players in unfair matches, while ensuring that the legitimate players in these matches aren't incurring abandonment penalties or unjust Ranked losses.\n\n### [MAJOR FEATURE] SIEGE CUP (BETA) - ALL PLATFORMS\n\n- __Status: Confirmed for Y9S4__\n\nThe Siege Cup will provide a highly competitive experience on both PC and console, while remaining in its Beta phase to allow further testing. For more information, check out our [FAQ](https://rainbow6.com/siegecupfaq).\n\n### [BALANCING] YING, SENS, & THUNDERBIRD\n\n- __Status: Confirmed for Y9S4__\n\n__YING:__ Introducing a tweak to Ying aimed at reducing defender frustration.\n__SENS:__ An update for Sens will expand the opportunities for more strategic plays.\n__THUNDERBIRD__: An adjustment for Thunderbird will help make her a more valuable asset for the team.\n\n### [PLAYER PROTECTION] AI CHAT MODERATION\n\n- __Status: Confirmed for Y9S4__\n\nAI will analyze and moderate all text chat messages in real-time, resulting in problematic messages being flagged or removed. Your messages will have an impact on your Reputation Standing, whether they are censored, flagged, or positive.\n\n### [PLAYER PROTECTION] REPUTATION SYSTEM REFRESH\n\n- __Status: Confirmed for Y9S4__\n\nThis update will feel different from the Reputation System you know. We are actively working on the refreshed Reputation System for Y9S4 and are in the balancing stages right now, ensuring that the actions we're tracking have a meaningful and fair impact.\n\n### [PLAYER COMFORT] DYNAMIC MATCHMAKING 1.0\n\n- __Status: Delayed to Y10__\n\nA dynamic matchmaking feature for improved server allocation based on a broader set of players' data. This feature has been delayed allowing our Playlist team to focus their resources on Phantom Player, which is now coming earlier than was originally planned.\n\n### FULL REVEAL\nStay tuned for the __Operation Collision Point reveal__ coming up on Sunday, __NOVEMBER 17TH__, at 11AM PT / 2PM ET / 8PM CET.\n\n---\n\nJoin the discussion on [Twitter](https://twitter.com/Rainbow6Game/), [Instagram](https://www.instagram.com/rainbow6game/), [Reddit](https://www.reddit.com/r/Rainbow6/), [Discord](https://discord.gg/rainbow6), [Facebook](https://www.facebook.com/Rainbow6/), and [TikTok](https://www.tiktok.com/@rainbow6game).\n\nCheck out the [public Roadmap](http://rainbow6.com/roadmap) for more information on the changes coming your way!",
    "categories": [
      "rainbow-six-siege",
      "game-updates"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/31LLHuTF4jb7xzamPNqRpy/y9s3-midseason-roadmap-update",
    "date": "2024-11-12T14:15:00.000Z"
  },
  {
    "id": "2qZMThOIMmXBWOmBZS3iSI",
    "title": "Siege Cup FAQ",
    "abstract": "Learn more about the upcoming Siege Cup tournaments.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/24SgMPZdo0ml8PZEoPklLL/5a9a996f47411c5be1849fe238f0e4a2/r6s_siegecup.jpg",
    "content": "## SIEGE CUP BETA - FAQ\n\n__Can my team participate on consoles during the Beta phase?__\\\nNo, the Siege Cup Beta is available only on PC. Having a smaller pool of players will allow us to test all technical aspects of the tournament, helping to ensure a smooth full launch in the near future. Console players have received Competitive Coins as a compensation. The official release of the Siege Cup will be for all players, following the current cross-play configuration.\n\n__When will the Siege Cup see a full release?__\\\nWe are aiming for Y9S4.\n\n__Is the Siege Cup Beta restricted to certain region(s)?__\\\nFor the first tournament (Beta), we aimed for a maximum of around 25 000 players in each region of North America and Western Europe; the following invite waves will have their own parameters, and we will share details as they become available.\n\n__Can any player from a team register their team to the Siege Cup Beta?__\\\nYes, however, the Squad leaders must be accepted into the Siege Cup Beta. Your team will not be able to participate if it is not your Squad Leader who had initially registered and subsequently selected. To identify your Squad Leader in-game, go to your profile at the top of the main menu. If you are Squad Leader and need to make another person Squad Leader, choose a squad member after selecting your profile, and then select \"Promote to Leader\".\n\n## SIEGE CUP - FAQ\n\n__What are the requirements to participate in the Siege Cup?__\\\nPlayers need to be at least Clearance Level 50. Reputation Standings and Sanctions history will also be verified to allow a safe and fair experience.\n\n__Can a player register for more than one team?__\\\nNo. A player can only register to one Siege Cup team each Siege Cup.\n\n__Will we be able to edit our team once registered?__\\\nNo. Make sure to validate your team members prior to the teammates registration which will happen just before the start of the tournament.\n\n__Where can teammates register to the Siege Cup?__\\\nThe teammates registration will be available via the in-game Siege Cup playlist next to Ranked section.\n\n__What happens if a player wants to cancel their registration to the Siege Cup?__\\\nIf registration is completed, players will not be able to unregister and they are locked in for the duration of that tournament. If before registration is completed, the Squad Leader withdraws from the competition, the whole team will see their registration cancelled and players will have to find a new teammate to complete the 5-stack and identify a new leader to register again.\n\n__What can we win from participating in the Siege Cup?__\\\nCompetitive Coins will be distributed when the team wins or is eliminated. The amount earned will be based on tiers and final positioning within the tournament. Competitive Coins will be used to access a collection of exclusive items or to redeem competitive packs. Note there may be a slight delay in Coins delivery.\n\n__What if a player doesn't show up unexpectedly for the tournament?__\\\nAnother player may be added into the squad if the team is not yet registered, so long as they meet the qualifications to participate. A check is performed in game.\n\nIf the team was already registered and a player does not show up, the team will need to play without that player, although they can reconnect at any moment.\n\n__What will happen to cheaters who makes it into the tournament?__\\\nThe identified cheater will be banned, and teammates will also have their access to Siege Cup tournaments removed for one year. The status of someone's eligibility will display if they attempt to queue during the tournament registration phase.\n\n__What will happen if a player is disconnected during a game?__\\\nPlayers will have the opportunity to reconnect. There are no abandonment penalties on single matches.\n\n__What are the recommended minimum PC requirements to be able to play in the Siege Cup tournament?__\\\nThe minimum requirements to play are the same as the base game.\n\n__Where will I be able to find updates and additional communications regarding the Siege Cup?__\\\nEssential information will be available directly via the in-game Siege Cup playlist.  As a complementary source of information, follow us on X to get updates on a regular basis about what's to come.\n\n__Which Maps are going to be designated for the Siege Cup tournaments?__\\\nEach Siege Cup will have a list of chosen maps based on the Pro League criteria although we don't discard the possibility of eventually having a wider map variety.\n\n## TIERS - FAQ\n\n__What are Tiers in Siege Cup?__\\\nTiers are a way for us to determine your Skill level in Siege Cup. Each player has an individual Siege Cup Tier as well as each Team has its own collective Siege Cup Tier.\n\n__What are Tiers used for?__\nWe use tiers in Siege Cup for the matchmaking of tournament brackets, as well as to determine the rewards that teams get at the end of the tournament.\n\n__Can I change my tier?__\nIndividual tiers can be changed by playing the most competitive playlists in the game (Ranked and Siege Cup) as they are a reflection of your Skill in those playlists.\n",
    "categories": [
      "rainbow-six-siege"
    ],
    "readTime": 5,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2qZMThOIMmXBWOmBZS3iSI/siege-cup-faq",
    "date": "2024-11-05T15:15:00.000Z"
  },
  {
    "id": "7EowDNiZbP0grYCmMgBCjW",
    "title": "PLAYER PROTECTION UPDATE – OCTOBER 2024",
    "abstract": "Find our latest Anti-Cheat and Anti-Toxicity updates.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/462bph9oqvwV5eUW548r1u/9a6799d23a0c79b5ef1646184f9145f3/Y9S3_PlayerProtection_header_960x540.jpg",
    "content": "Today we'll be sharing updates on some of the developments we're making on our Anti-Cheat systems. We've also got updates covering Anti-Toxicity, including some info on changes that we've already rolled out.\n\n## IN THIS UPDATE\n\n__ANTI-CHEAT__\n\n- Current Status\n- Encryption - Binary Hardening\n- MouseTrap\n  - Detection Performance\n  - MouseTrap PC Matchmaking\n- QB System\n- Ban Data\n\n__ANTI-TOXICITY__\n\n- Reputation System Refresh Update\n  - How It Will Work\n- Automated Text Chat Moderation\n- Unfair Abandonment Penalties\n- Teamkill Kick Deactivation\n- DBNO RFF Deactivation\n- Privacy Mode Nickname Acceptance\n- Next Steps\n\n![[R6S] PLAYER PROTECTION UPDATE – OCTOBER 2024 - anti-cheat](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4HYcaAPmYsUg6CpIpgfvVo/48b56f1e02f038a9e7a8ecced62357c9/Anti-Cheat.RED.150x960.png)\n\n## CURRENT STATUS\n\nThe topic of cheating remains at the forefront for us here on the Rainbow Six Siege team. We're aware that cheating continues to affect high ranked players in most cases, however with the launch of Y9S3 seeing a decrease in cheating overall compared to S2, we know that we're finding the results needed to provide safer matches, more often. Below, we have updates on some of the topics we're working on, but not all; it's crucial that we're not giving any information away that could benefit cheaters.\n\n## ENCRYPTION - BINARY HARDENING\n\n- Reminder: Binary hardening is the act of using __encryption and hardening techniques__ to update the game code base and __enhance security__, and we've continued to deploy these updates to the game with each patch.\n\nThe launch of Y9S3 was a step forward in our efforts against cheating, with __cheats being down for nearly an entire week__. We can see that this was also felt by players, as we measured a __stark decrease in cheater reports__ being submitted. Cheats are adapted over time however, and so while this was temporary, it does demonstrate that our hardening measures are having a meaningful impact in delaying the return of cheats. Previously, we also saw success in Season 2, when a security update resulted in a shorter delay to cheats coming back online.\n\nWhile this is an ongoing challenge, the delays we've seen are encouraging and to this end we've implemented further __security fixes ready for Siege Cup__, to help us maintain a fair and competitive environment, which is a top priority for us. We will keep pushing hardening updates throughout Y9S3 and of course, beyond. As we progress further, we'll continue to share our findings with you.\n\n## MOUSETRAP - MOUSE & KEYBOARD DETECTION ON CONSOLE\n\n- Reminder: MouseTrap is our __console__ __Anti-Cheat__ which works to detect devices that enable the use of mouse and keyboard.\n\n### MOUSETRAP - DETECTION PERFORMANCE\n\nWe've recently released an update to MouseTrap which has resulted in both an __increase in detection performance__ and a __reduction in false positives__. As well as this, we're now completing tests for __devices that aren't yet being recognized__.\n\n### MOUSETRAP - PC MATCHMAKING\n\nSince spoofing devices and controllers can be matched together, it's clear that frustration has remained. While working to release PC-Console Crossplay, which is coming in Y9S4, we've also been on track with its implementation into MouseTrap, which will force __confirmed MnK users into PC matchmaking__ while automatically switching to the PC recoil values. We'll share more on this during the Season 4 reveal.\n\n## QB SYSTEM\n\n- Reminder: The QB System is one of our custom-built Anti-Cheat solutions designed to reinforce hardening by distributing different game executables to players while preventing tempering.\n\nOur top priority is ensuring the QB System stays robust in the fight against cheaters and cheat developers. Right now, our team is testing __the next QB System Expansion prototype__, and we'll provide more details soon about how this will impact players.\n\n## BANS - DATA BANS + BATTLEYE\n\n### BAN NUMBERS\n\nBefore moving to Anti-Toxicity below, here's an updated view on our 2024 ban data, including new data for July, August, and September:\n\n![[R6S] PLAYER PROTECTION UPDATE – OCTOBER 2024 - BanChart](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2gu5liJTyfiLsYuhjKmsZI/ea50e036daef0376ccdf7c2e307ba5c8/R6_BanChart_Jan-Sep24.jpg)\n\n<br>\n\n<hr>\n\n<br>\n\n![[R6S] PLAYER PROTECTION UPDATE – OCTOBER 2024 - anti-toxicity](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1I0q5RDMypnBXrfaVhHF69/a4633132461688db8735a42ea3e5152a/Anti-Toxicity.ORANGE.150x960.png)\n\n## REPUTATION SYSTEM REFRESH - UPDATE\n\nWe are actively working on the refreshed Reputation System for Y9S4 and are in the balancing stages right now, ensuring that the actions we're tracking have a meaningful and fair impact. The focus of this system is to fulfil and stay true to our core pillars: __transparency, understandability, and clarity.__ We know the system is already very complex, and we want to be sure to control its fairness before adding additional parameters, and so our mindset for this refresh is to \"do less but do better\", resulting in a system that's easier to understand and interact with.\n\n### HOW IT WILL WORK\n\nThis new system will __feel different__ from the one you know, as we will be watching for __negativity first__, __then positivity__. Toxicity on its own will lead to a negative Standing, and __positive behavior with minimal negativity will lead to a Standing of Exemplary__. It's only in cases where a player is highly toxic over a number of matches that drastic Standing drops should be seen. Below are some extra details on the parameters, for full transparency of how the system will work:\n\n- __ACTIVE PLAYLISTS:__ Ranked, Standard and Quick Match (leaving a Quick Match will not impact Standing).\n- __REPORTS:__ Unverified reports will __NOT__ have an effect on your Standing, only __YOUR__ actions will.\n- __PENALTIES:__  Reverse Friendly Fire (RFF) and Abandonment Penalties will continue to be handled in the same way.\n- __COMMUNICATION:__ Negative communication-related actions will cause a player to be automatically muted for a predetermined number of matches.\n- __UI:__ We are redesigning the Reputation Center to further provide all information related to Standings and any problematic behaviors.\n- __STANDING IMPACTS:__ Impacts based on your Standing alone will only go live once the Reputation System leaves BETA.\n\n__WHEN WILL THE SYSTEM LEAVE BETA?__\n\nWe have no estimated time for this, but it will only happen after Y9S4.\n\n## AUTOMATED TEXT CHAT MODERATION\n\nIn Y9S4, your in-game messages could be flagged or removed according to our acceptance threshold and we are currently balancing the automated detection to make it as fair as possible.\n\nWhat will the threshold be? If you're unsure, ask yourself, __\"is this something I'd feel comfortable saying in a room with 9 other people that I don't know?\".__ If it's something that's going to clash with that, then the chances are it could be flagged or removed. Remember though, __your messages can also have a positive impact__, so you can affect your Standing this way too!\n\n## UNFAIR ABANDONMENT PENALTIES\n\nReceiving an abandonment penalty due to a game crash or disconnection can be frustrating, and so we've been working on the way we detect abandonments and game crashes, so that __players in these situations receive fewer penalties overall__. Detecting the difference between a real game crash and or an intended disconnection (a player purposefully forcing the game to close or lose connection) is a __complex technical challenge__, and we're constantly making improvements in this area. Of course, we're aware that these systems can often be used for abuse and so such changes are deployed tentatively. We are finding success in helping players however, as we were able to reduce the number of __unfair abandonment penalties by two thirds with our latest update.__\n\n## TEAMKILL KICK DEACTIVATION\n\nGetting kicked from a match when multiple teamkills occur __was deactivated in Y9S2__, due to the feature being exploited. The deactivation worked as planned; we monitored teamkilling rates after this change and we've listened to your feedback throughout.\n\nIf you were concerned about a teamkilling increase: since the auto kick was deactivated, we've observed the following:\n\n- Quick match: +0.6% of rounds impacted by at least one teamkill.\n- Standard: +0.5% of rounds impacted by at least one teamkill.\n- Ranked: +0.3% of rounds impacted by at least one teamkill.\n\nTo summarise, since the change was made, we've only seen a minor increase in teamkilling. It is still an increase though, and so we're not resting on these stats. We have future initiatives which are focused on decreasing these numbers.\n\n## DOWN BUT NOT OUT (DBNO) REVERSE FRIENDLY FIRE (RFF) DEACTIVATION:\n\nThis season, we deactivated a trigger which would result in the removal of RFF after reviving a teammate who was DBNO. As with the Teamkill Kick Deactivation, this removal comes after a clear pattern of abuse, where players were intentionally downing a teammate with the aim of reviving them right after. The RFF activation box is now triggered for the teammate when you down them.\n\n## PRIVACY MODE: NICKNAME ACCEPTANCE\n\nWe know that many of you love Privacy Mode, but we're also aware that some players use this feature as a tool for abuse, using offensive and unacceptable names. At the beginning of Y9S3, we updated our validation of nicknames making it much more robust, and this resulted in 12% of all nicknames in use at the time being removed from the game and reset to \"Recruit\". We'll be providing more updates to our validation in the future as necessary.\n\n## NEXT STEPS\n\nWe'll continue to provide updates on Anti-Toxicity and the Reputation System as we move forward. At this stage we're confident that our upcoming updates and features are going to improve the experience for a lot of players, but __your feedback remains crucial__. We can't wait to get many of our updates to you in-game, next season.",
    "categories": [
      "toxicity",
      "anti-cheat",
      "dev-blogs"
    ],
    "readTime": 9,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/7EowDNiZbP0grYCmMgBCjW/player-protection-update-october-2024",
    "date": "2024-10-25T15:15:00.000Z"
  },
  {
    "id": "5AEJqynHKz8fcbB7lUVSF8",
    "title": "Y9S3.3 Patch Notes",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y9S3.3!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2YGwr6QmaLeMzc07wkqhzt/fb770134bfb33038d7035e21de1cd2af/PATCHENOTES_Y9S3.3_960x540.jpg",
    "content": "Here you can find the fixes for the Y9S3.3 patch.\n\n## Y9S3.3 PATCH SIZE\n\nFind the download sizes for each platform below.\n-   Ubisoft Connect: 1.04GB\n-   Steam: 301.3MB\n-   Xbox One: 898.77 MB\n-   Xbox Series X: 1.12GB \n-   PlayStation®4: 1.439 GB \n-   PlayStation®5: 920 MB\n\n## OPERATOR BALANCING\n\n### IANA\n\n- Reduced hologram cooldown when destroyed to 20 seconds (from 30).\n\n### JACKAL\n\n- Removed distortion caused by bullets.\n\n### KALI\n\n- Added Smoke Grenades.\n\n### MOZZIE\n\n- Increased Pests to 4 (from 3).\n\n- Added Impact Grenades.\n\n### ZERO\n\n- Increased Argus cameras to 6 (from 4).\n\n### ZOFIA\n\n- Removed Breach Charges.\n\n- Added Hard Breach Charges.\n\n## WEAPON BALANCING\n\n### CSRX-300\n\n- Reduced bullet trail duration and size.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - UI element that lets a team know they're moving into the lower bracket of Siege Cup says \"unknown\" instead.\n\nFIXED - A player watching a match is unable to access text chat.\n\nFIXED - Siege Cup banner says \"Waiting for others to join\" despite being paired against an enemy team.\n\nFIXED - Caster card placement differs when spectating certain Custom Game presets.\n\nFIXED - Devices briefly reactivate when picked up despite being affected by an EMP.\n\nFIXED - \"!!Missing Timer\" text present in the AAR screen.\n\nFIXED - The More Info section of Siege Cup has incorrect information about the registration requirements.\n\nFIXED - Some Siege Cup players' games do not start, and those players remain with the ribbon stating: \"NEXT MATCH IN Starting Soon\".\n\n### OPERATORS\n\nFIXED - Skopós's idle V10-Pantheon Shells spawns without a shield at 2F Executive Office in the Plane map.\n\n### USER EXPERIENCE\n\nFIXED - Redeem button is missing from the Bravo Collection with a Bravo Pack Ticket.\n\nFIXED - Marketplace is missing the thumbnail for the Crushing Canes skin for Montagne's Le Roc shield.",
    "categories": [
      "patch-notes"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5AEJqynHKz8fcbB7lUVSF8/y9s33-patch-notes",
    "date": "2024-10-22T16:00:00.000Z"
  },
  {
    "id": "77Iv7UsgPeQzJzbBQSTZaB",
    "title": "Y9S3.3 Designer's Notes",
    "abstract": "In this latest edition of Designer’s Notes, we'll go into detail about the balancing changes that’ll come with the Y9S3.3 update and give you some insight into the reasons behind them.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/79SEFwXKk3uCvC3XqH9Sc1/9095e6036f8d5a00423c093a347829cf/DESIGNER_NOTES_Y9S3.3_960x540.png",
    "content": "In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y9S3.3 update and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n### WIN DELTA VS. PRESENCE\n\n<center>\n\n![[R6S] Y9S3.3 Designer's Notes - BalancingMatrix_Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5jyvkEnYH219pq1wcLArYQ/ac0a36597176dc9ec19d261ab374b282/R6S_DN_Y9S3.3_BalancingMatrix.Att.mp4)\n\n![[R6S] Y9S3.3 Designer's Notes - BalancingMatrix_Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/oOcn0GP4ZSSqXSFPisA1W/b6f094c36d27b3c78d9bd33ec2a2ecb7/R6S_DN_Y9S3.3_BalancingMatrix_Def.mp4)\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n</center>  \n\n### OPERATOR BAN RATE\n\n<center>\n\n![[R6S] Y9S3.3 Designer's Notes - BanMatrix_Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/78BBPpDTJxg6e8aalCIUtS/83ab07035c1331d7841a6bf84639aba3/-REVISED-BanMatrix_ATT.mp4)\n\n![[R6S] Y9S3.3 Designer's Notes - BanMatrix_Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6luQYOetgdpRrGOfv4mPlJ/43720d5418c47c10504bbd7e8e6f96ff/-REVISED-BanMatrix_DEF.mp4)\n\n</center>\n\n# A WORD ABOUT BALLISTIC SHIELDS IN Y9S4\n\nWith the shield update released in Y9S1 we've seen an encouraging evolution of shield usage overall. They have more impact and are a more relevant option than before. \n\nHowever we do not want them to become an overly oppressive solution for attackers and with those season's learning we will be tuning them for Y9S4 to reinforce their support role.\n\n# OPERATOR BALANCING\n\n### IANA\n\nIana should help reduce the reliance on Drones. However, unlike Drones, which are smaller and more elusive, the Gemini Replicator is too easy to detect and destroy.\n\nThe primary advantage of using the Gemini Replicator is that it doesn't result in resource loss when destroyed. However, 30-seconds cooldown can be quite restrictive, potentially limiting its use to just a few times per round, which may not feel impactful enough. To address this, we are reducing the cooldown time for when it is destroyed, allowing it to be used more frequently to assist in droning yourself or your teammates.\n\n#### GEMINI REPLICATOR\n\n- Cooldown (when destroyed): Reduced to 20 seconds (from 30).\n\n### JACKAL\n\nRemoving the distortion effect when being shot would enable Jackal to use his Eyenox more effectively, making it easier to track enemies even in high-pressure situations. This change would allow him to provide more consistent intel to his team by keeping the visor active for longer periods.\n\nWe believe the distortion doesn't serve as an effective counter but rather makes the visor less user-friendly. Therefore, we view this adjustment as a quality of life improvement rather than a substantial buff. Actively following tracks with the visor is an enjoyable aspect of its gameplay, and we aim to make this experience more comfortable for players.\n\n#### EYENOX MODEL III\n\n- Removed visor distortion when getting shot.\n\n### KALI\n\nIn addition to the changes to the CSRX 300 detailed below, we are also equipping Kali with a set of Smoke Grenades. This new option is intended to assist her in relocating with some concealment or to strategically funnel defenders into her line of sight by obstructing their vision from other angles.\n\n#### LOADOUT\n\n- Gadgets: Added Smoke Grenades.\n\n### MOZZIE\n\nMozzie's ability to capture 3 drones is already quite significant, potentially making him more effective than Valkyrie. However, this potential is rarely realized due to drones being destroyed or the difficulty in quickly securing captures, which can make him feel less impactful than Mute. To make this potential more achievable, we are increasing his resources. \n\nWe also aim to encourage more active drone hunting. With only 3 Pests, there's limited flexibility between pre-placing them and keeping them for a future use. We hope that additional resources will provide more flexibility, making him interact more with his gadget during the Action Phase.\n\nAdditionally, the Impact Grenades will enhance his mobility, enabling him to roam the map faster more effectively using the intel gathered from his captured drones.\n\n#### PEST LAUNCHER\n\n- Maximum resources: Increased to 4 (from 3).\n\n#### LOADOUT\n\n- Gadgets: Added Impact Grenades.\n\n### ZERO\n\nUnlike standard drones, the Argus Cameras are stationary, so they remain relevant only while the action is in their vicinity. Beyond that point, they may become less useful, which can pressure you to place them in more risky and exposed areas.\n\nHowever, with the additional coverage, Zero can now place the cameras in more creative ways and less obvious locations, making them harder to spot and destroy. Even if some cameras don't see much action, he can double-down on the same area to ensure the coverage. This also means fewer blind spots, making it easier to rely on Zero's cameras for flank-watch.\n\nNow, he can establish a network that can cover multiple flanks and key areas effectively.\n\n#### ARGUS LAUNCHER\n\n- Maximum resources: Increased to 6 (from 4).\n\n### ZOFIA\n\nWe will replace Zofia's Breach Charges with Hard Breach Charges. This adjustment aims to enhance her versatility, enabling her to handle both soft and hard breaching tasks. By equipping her with Hard Breach Charges, we hope to provide teams with greater flexibility in their strategies and operator selections, fostering more creative and diverse strategies, similar to what operators like Capitão or Zero are promoting.\n\n#### LOADOUT\n\n- Gadgets: Removed Breach Charges. Added Hard Breach Charges.\n\n# WEAPON BALANCING\n\n### CSRX 300\n\nBeing a Sniper in Siege presents quite a challenge. The opportunities to play from a safe and distant position are limited, making it easy for your position to be called out after the first shot. Additionally, the bullet trails of the CSRX 300 are more visible than others, complicating the efforts to remain unseen.\n\nThe reductions in duration and size will help make it safer to take a second shot from the same position. Defenders will need to pay closer attention to the trails if they wish to determine Kali's position.\n\n#### BULLET TRAIL\n\n-   Duration: Reduced to 1 seconds (from 2).\n-   Size: Reduced by 75%.\n\n#### OPERATORS AFFECTED\n\n-   Kali\n\n<hr>\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 6,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/77Iv7UsgPeQzJzbBQSTZaB/y9s33-designers-notes",
    "date": "2024-10-21T13:00:00.000Z"
  },
  {
    "id": "28JxJtO5WMnRKyMvlC9Huo",
    "title": "Y9S3.2 Patch Notes",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y9S3.2!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7o0irnJLJMPwK1UAYqo0zJ/3991a85c6bb4d0c0a40ab2d717798549/PATCHENOTES_Y9S3.2_960x540.jpg",
    "content": "Here you can find the fixes for the Y9S3.2 patch.\n\n## Y9S3.2 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 943.3MB\n- Steam: 556MB\n- Xbox One: 2.66GB\n- Xbox Series X: 2.85GB\n- PlayStation®4: 3.347GB\n- PlayStation®5: 985MB\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Jackal loses visibility when Motion Blur is turned off if he takes damage while Eyenox Model III is active.\n\nFIXED - Hitting Maestro's Evil Eye with a melee attack corrupts the texture.         \n\nFIXED - PCX-33 assault rifle has no rumble effect during a full reload when Controller Vibration options are turned on.\n\nFIXED - The reticle of the Reflex C sight isn't centered on the SPAS-15 shotgun.   \n\nFIXED - Shield Operators are unavailable in the Weapon Roulette arcade.\n\nFIXED - Deploying Kapkan's Entry Denial Device on any doorway or window displays a second deploy prompt during the animation.\n\nFIXED - The End of Round replay shows the player who downed the last Operator of a team instead of the player who killed them.\n\nFIXED - The Equip button is missing when viewing an owned item in fullscreen from the Pack Highlights section.\n\n### LEVEL DESIGN       \n\nFIXED - Placeholder texture is present on the cans located on top of the vending machine in 1F Service Stairs of the Consulate map.\n\nFIXED - Player can vault onto the crate stack in EXT Generator on the Nighthaven map and drop the defuser into an unreachable area.\n\n### OPERATORS\n\nFIXED - The equipped primary weapon of some Operators float behind them when previewing their default Victory Celebration in fullscreen.\n\nFIXED - Skopós's V10-Pantheon Shells will place its shield behind itself if it switches into an idle state in a doorway with a lot of assets.\n\nFIXED - Skopós's V10-Pantheon Shells doesn't have a death animation in the Kill Cam or End of Round replay.\n\nFIXED - Corrupted model and texture of Skopós's V10-Pantheon Shells in the End of Round replay for the last-killed Attacker.\n\nFIXED - When swapping Skopós's V10-Pantheon Shells, the arrows in the fantasy HUD point the wrong way and the swap doesn't occur.\n\nFIXED - The shield of Skopós's V10-Pantheon Shells reattaches to the other side of the door frame after swapping Shells in the middle of a double door.\n\nFIXED - Skopós's V10-Pantheon Shells will sometimes spawn without its shield.\n\n### USER EXPERIENCE\n\nFIXED - Sometimes the player will get stuck in a loading screen if they launch the Shooting Range from the Operator section during matchmaking.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/28JxJtO5WMnRKyMvlC9Huo/y9s32-patch-notes",
    "date": "2024-10-08T09:15:00.000Z"
  },
  {
    "id": "7MvHbYl5Rt0x47WC7XwhyW",
    "title": "Y9S3.1 Patch Notes",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y9S3.1!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5NXpioZViXor2uO12IJmrs/1d819dbe2d90ee8f2374c179b853f401/PATCHENOTES_Y9S3.1_960x540.jpg",
    "content": "Here you can find the fixes for the Y9S3.1 patch.\n\n## Y9S3.1 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n-   Ubisoft Connect: 1.15 GB \n-   Steam: 669 MB\n-   Xbox One: 1.34 GB\n-   Xbox Series X: 1.55 GB\n-   PlayStation 4: 1.89 GB\n-   PlayStation 5: 1.49 GB\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Synaptic charm equips a placeholder charm.\n\nFIXED - Thunderbird's Kona Station keeps healing while affected by EMP or Zoto Canister if the elite uniform is equipped.\n\nFIXED - Unable to type in chat using Cyrillic layout.\n\nFIXED - Players are able to block the EXT sewer with a Deployable Shield, preventing Attackers to pass.\n\nFIXED - Drone can see through wall in 2F Yellow Stairs in the Consulate map.\n\nFIXED - Tutorial Rewards modal does not appear after completing the tutorials.\n\nFIXED - Skopós's V10-Pantheon Shells prevent players from vaulting through windows.\n\nFIXED - Player is unable to customize Skopós's V10-Pantheon Shells Swap action on the controller.\n\nFIXED - Host and clients can have different rotation replications while in rappel.\n\nFIXED - The Luision weapon stats are displaying stats of the PBR92.\n\nFIXED - Join as a spectator is missing for custom local match.\n\nFIXED - Iana cannot be scanned while she has Gemini Replicator active.\n\nFIXED - Key bindings do not revert to default values.\n\nFIXED - Skopós's V10-Pantheon Shells transfer action cannot be remapped or assigned a secondary input.\n\nFIXED - Skopós's idle V10-Pantheon Shells can get concussed by Echo's Yokai drone.\n\nFIXED - Fire area of effect doesn't affect the hostage.\n\nFIXED - Placeholder name is present when user goes to the Shooting Range while matchmaking.\n\nFIXED - Grey filter is applied to the spectator POV when changing cameras during Skopós's V10-Pantheon Shells transition.\n\n### LEVEL DESIGN      \n\nFIXED - Excessive light coming out of the ceiling projector in 1F Projector Room on the Kanal map.\n\n### OPERATORS\n\nFIXED - Skopós has an unusual position during the Victory Celebration and is distorted in the team lineup.\n\nFIXED - Skopós has various camera, collision, and texture issues in Free for All Arcade game mode.\n\nFIXED - Fuze, Thunderbird, Clash, and Aruni are invisible when equipped with skins from certain Esports bundles.\n\nFIXED - The Operator's feet slide inward when using an Observation Tool while idle.\n\nFIXED - Skopós's foot sometimes lifts while idle.\n\nFIXED - Operator's left hand bends strangely and the knife model floats above it while performing a melee attack after firing the .44 Vendetta.\n\nFIXED - Skopós does not die from headshots in certain Arcade game modes.\n\n### USER EXPERIENCE\n\nFIXED - When spectating, player cards don't collapse or expand following an input.\n\nFIXED - Skopós's idle V10-Pantheon Shells will sometimes spawn in T-Pose.\n\nFIXED - Player is unable to customize Skopós's V10-Pantheon Shells Swap action on controller.\n\nFIXED - Stutter issues with DX12.\n\nFIXED - Crash during start-up with older GPUs on DX12.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/7MvHbYl5Rt0x47WC7XwhyW/y9s31-patch-notes",
    "date": "2024-09-24T09:15:00.000Z"
  },
  {
    "id": "5ETMcAwe6xWaSvEBBMM3Jo",
    "title": "Y9S3 Patch Notes Addendum",
    "abstract": "See the changes made over the course of the Y9S3 Season Test Server.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/KOm0D3UuBjNDypujIlMee/2db3229bbd51b2f2a076b588f432dea6/PATCHENOTES_ADDENDUM_Y9S3_960x540.jpg",
    "content": "Here you can find the updates and fixes made over the course of the Y9S3 Season Test Server.\n\n## Y9S3 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n-   Ubisoft Connect: 4.06GB\n-   Steam:  4GB\n-   Xbox One: 7.9GB\n-   Xbox Series X: 8.1GB\n-   PlayStation 4: 9.2GB  \n-   PlayStation 5: 8.2GB\n\n## PLAYER PROTECTION\n\n__PRIVACY MODE__\n\n- Appear as nickname will have a new solution to validate the acceptancy of player choices. In order to start fresh, all the existing nicknames have been renamed to 'Recruit'.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Operator cards disappear when an Operator is eliminated while caster cam is in first person view.\n\nFIXED - Round only displays round 1 for matches viewed in Match Replay.\n\nFIXED - Map images are missing during ban-phase for the non-selecting team.\n\nFIXED - Several items missing from album and locker screens under the favorites option.\n\nFIXED - Skopós' V10 Pantheon shells UI appears while controlling a drone when switching to Attackers in online matchmaking.\n\nFIXED - Players can clip through walls using Osa's Talon-8 Shield in specific spots and rappelling.\n\nFIXED - Game crashes when a hatch is destroyed while Skopós swaps to a shell idling on top of the hatch.\n\nFIXED - Valkyrie's Black Eye loses signal when placed on skylights in 2F Office on the Theme Park map.\n\nFIXED - Camera shows incorrect point of view when quickly swapping between Skopós' V10 Pantheon Shells after viewing the idle shell through Observation Tools.\n\nFIXED -Skopós' V10 Pantheon shells can be eliminated by a dummy after swapping to the Idle shell in Map Run.\n\nFIXED - Destroying Skopós' V10 Pantheon shells in idle mode counts as an elimination.\n\nFIXED - Hit markers appear when shooting Skopós' V10 Pantheon shells through a wall.\n\nFIXED - AI Bots stop moving when accessing 2F Armory from the roof on the Oregon map.\n\nFIXED - Camera clips inside Operator when swapping between Skopós' V10 Pantheon shells.\n\nFIXED - Laser VFX missing when using Aruni's Surya gate.\n\nFIXED - Observation Tool HUD disappears when players are eliminated by Dokkaebi while Logic Bomb is active.\n\nFIXED - Motion blur VFX doesn't disappear after receiving damage.\n\nFIXED - Countdown box is present during End of Round screen in caster cam.\n\nFIXED - Objective to ping security camera in 1F Bar on the Clubhouse map while hiding the drone can't be completed in Map Run Drone mode.\n\nFIXED - AI Bots gets blocked deploying a device when another device is already deployed in that location.\n\nFIXED - AI Bots are unable to navigate through the fireplace in 2F Train Museum on the Kafe Dostoyevsky map.\n\nFIXED - Glass breaking VFX displays when shooting lane 2 dummy in the Shooting Range.\n\nFIXED - Drones don't bounce as intended when thrown through barbed wire.\n\nFIXED - AI Bots reinforce the wrong walls in 2F Executive Lounge and 2F CEO Office site on the Bank map.\n\nFIXED - Players are desynced between first person view and third person view if aiming down sight with a ballistic shield.\n\nFIXED - AI Bots reinforce the wrong wall in 2F Connector on the Nighthaven Labs map.\n\nFIXED - AI Bots occasionally aim for devices instead of aiming for the player.\n\n### LEVEL DESIGN      \n\nFIXED - Wall can't be destroyed in EXT East Terrace on the Consulate map.\n\nFIXED - Wrong textures are displayed in EXT North Dock on the Lair map.\n\nFIXED - Sensory devices detect Operators walking on the opposite part of glass windows at multiple locations on multiple maps.\n\nFIXED - Players can clip through the red stairs in EXT Bus Yard on the Oregon map.\n\nFIXED - Players can rappel on misplaced rappel in EXT Roof on the Favela map.\n\nFIXED - Barricades float when deployed on the doorway in 2F East Stairs on the Border map.\n\nFIXED - Smoke's Remote Gas Grenade can't be picked up if thrown between the wall and the metal shelf in 2F Armory on the Oregon map.\n\nFIXED - Certain throwable devices can't be retrieved when deployed near the vault door in 2F Games Room on the Villa map.\n\nFIXED - Bulletproof Camera can be placed on the ventilation dock in B Church on Clubhouse map.\n\nFIXED - Wall-Deployed Devices clip through the doorframe in 2F VIP Lounge on Stadium Bravo map.\n\nFIXED - Players get stuck on the sandbags located in EXT Roof on the Lair map.\n\nFIXED - Players get stuck when exiting the prone stance while underneath the hanged meat located in EXT Market on the Favela map.\n\nFIXED - Barricades are floating when deployed on the windows located in 1F Hallway on the Coastline map.\n\nFIXED - Players can see through small gaps between the barricade and the wall located in 1F Hallway on the Coastline map.\n\nFIXED - Players get stuck when exiting from prone in the space between the car and a wall located in EXT APC Area on the House map.\n\nFIXED - Players get stuck behind blue crates and a carnival cart located in EXT Teacups on the Theme Park map.\n\nFIXED - Incorrect reflection can be observed on the white truck's windscreen located in Ext West Front Yard on the Consulate map.\n\nFIXED - Kapkan's Entry Denial Device can be hidden inside the metal locker in 1F Security Room on the Kanal map.\n\nFIXED - Players can see through a wall if floor is destroyed in 2F Print Room on the Kanal map.\n\nFIXED - Player weapon clips through concrete tables in 2F Office on the Stadium Alpha map.\n\nFIXED - Multiple unintended line of sight issues on multiple locations on multiple maps.\n\nFIXED - Multiple defuser pickup issues on multiple maps.\n\n### OPERATORS\n\nFIXED - Defuser can't be retrieved when dropped by a player using Osa's Talon-8 Shield to vault onto sandbags at EXT Lift on the Lair map.\n\nFIXED - Placeholder image is present while viewing Osa's Talon-8 Shield in the Operators section.\n\nFIXED - Destroyed State for Skopós' V10 Pantheon shells resets on HUD when entering or exiting Observation Tools.\n\nFIXED - Skopós isn't revealed when pinging Talos' Shield on first spawn.\n\nFIXED - Missing background animation when accessing full screen view of Skopós' victory celebration in the Appearance menu.\n\nFIXED - Skopós' V10 Pantheon shells animation breaks during the end of round kill cam when in idle mode.\n\nFIXED - Operator isn't centered on screen in the Operators menu.\n\nFIXED - Azami's Kiba Barrier can pass through reinforced walls and hatches.\n\nFIXED - Objects block Skopós shield deployment and cause shaking and clipping.\n\nFIXED - Defenders see the Sens' R.O.U. Projectors as a friendly device when using the Smart Ping on a wall.\n\nFIXED - Frost VFX is applied to the scope when aiming the .44 Vendetta or .44 Mag Semi-Auto inside Tubarão's Zoto Canister area of effect.\n\nFIXED - Deimos can reload his Vendetta Pistol quickly by cancelling the reload animation.\n\nFIXED - Hold prompt is displayed for Ying's Candela when device is able to be mounted on a surface.\n\nFIXED - Lesion's GU mines don't award points when activated while Lesion has been eliminated.\n\nFIXED -Nøkk's device charge doesn't deplete when in proximity of Mute's Signal Disruptor.\n\nFIXED -Nøkk's device can't be activated in proximity of Mute's Signal Disruptor.\n\nFIXED - Flores' weapon disappears after his RCE-Ratero Charge drone is destroyed by an Opponent.\n\nFIXED - Missing footsteps VFX if Tubarão deploys multiple Zoto Canisters.\n\n### USER EXPERIENCE\n\nFIXED - Skopós' V10 Pantheon Shells have electronic device deactivation VFX on the active shell when in range of a device that deactivates electronics.\n\nFIXED - Players don't receive points when using Skopós' V10 Pantheon Shells and swapping between shells.\n\nFIXED - Players can't change their stance while in mid air.\n\nFIXED - Players get stuck in the Options menu after swapping tabs and closing the Options menu simultaneously.\n\nFIXED - Guidance and Dedication buttons are swapped in the After Action Report.\n\nFIXED - Camera doesn't stay in first person view and rewinds when swapping Skopós' V10 Pantheon shells during Match Replay.\n\nFIXED - Players can commend Opponents multiple times.\n\nFIXED - Two options can be highlighted on the Main Menu.\n\nFIXED - Operator guides need to be interacted with before players can highlight steps.\n\nFIXED - Speech To Text and Text To Speech settings are only applied after deactivating and reactivating the option.\n\nFIXED - Various Match Replay issues.\n\nFIXED - Various Spectator Mode issues.\n\n### AUDIO\n\nFIXED - First person lines for Skopós are heard through comms after swapping between V10 Pantheon Shells.\n\nFIXED - SFX missing when reloading as Skopós in the Shooting Range.\n\nFIXED - Skopós V10 Pantheon Shells SFX plays in all perspectives when viewed in Match Replay.\n\nFIXED - Missing SFX when Nitro Cell is thrown onto a non-destructible floor.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 8,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5ETMcAwe6xWaSvEBBMM3Jo/y9s3-patch-notes-addendum",
    "date": "2024-09-10T09:15:00.000Z"
  },
  {
    "id": "7LIsvUBfkr1eXTO2okx8dv",
    "title": "Y9S3 Streamer Charms",
    "abstract": "New Rainbow Six Siege Streamer Charms for Y9S3!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5ScFnUzBXFt3wmMSmwrGoN/67f188d1387cd2d662a3a4cf09f92082/-R6S-_Y9S3_Streamer_Charms_-_thumbnail.jpg",
    "content": "# New Rainbow Six Siege Streamer Charms for Y9S3!\n\n## Announcing the next Streamer Charms!\n\nEach season will bring the release of new charms, as well as the return of streamer charms from previous seasons!\n\n## New\n\n![-R6S- Y9S3 Streamer Charms - thumbnail](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5ScFnUzBXFt3wmMSmwrGoN/67f188d1387cd2d662a3a4cf09f92082/-R6S-_Y9S3_Streamer_Charms_-_thumbnail.jpg)\n\n[Priest](https://www.twitch.tv/omgitspriest)\n\n[nonomiyamika](https://www.twitch.tv/nonomiyamika)\n\n[alyttleton](https://www.twitch.tv/alyttleton)\n\n## Returning\n\n![-R6S- Y9S3 Streamer Charms - 1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1klB6MkTKt6uVpXgXsYdmO/8760ef5a1c714c008183ff225ea7a9a1/-R6S-_Y9S3_Streamer_Charms_-_1.jpg)\n\n![-R6S- Y9S3 Streamer Charms - 2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2x9awIk7zuyeZROg5mhsyM/1ddfbc3e82f068e500446baa1d081fc9/-R6S-_Y9S3_Streamer_Charms_-_2.jpg)\n\n![-R6S- Y9S3 Streamer Charms - 3](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/sGkMk5RHRiQ4ldFaug9Gu/62617ac9aeefd4f3feb8b0159bcac7f2/-R6S-_Y9S3_Streamer_Charms_-_3.jpg)\n\n![-R6S- Y9S3 Streamer Charms - 4](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/dJucuEXwoOpA6AAjqvk4J/d42d246fe590f2b1a741266e52ae779c/-R6S-_Y9S3_Streamer_Charms_-_4.jpg)\n\n![-R6S- Y9S3 Streamer Charms - 5](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6xW4YhAeV4IMzb5GWuEGcz/b52167d04259f6d1a1c10be6c4c1f5f5/EDIT.5.STREAMER_CHARMS_Y9S2_960x540.jpg)\n\n[Alfredoplays](https://www.twitch.tv/alfredoplays)\n[AnneMunition](https://www.twitch.tv/annemunition)\n[Beaulo](https://www.twitch.tv/beaulo)\n[Bighead](https://www.twitch.tv/bighead033)\n[BikiniBodhi](https://www.twitch.tv/bikinibodhi)\n[Bnans](https://www.twitch.tv/bnans)\n[Braction](https://www.twitch.tv/bractionfps)\n[Drid](https://www.twitch.tv/dridgg)\n[FastAnne](https://www.twitch.tv/fastanne)\n[Gabbo](https://www.twitch.tv/JustGabbo)\n[Heideltraut](https://www.twitch.tv/heideltraut)\n[Interro](https://www.twitch.tv/interro)\n[JerichoFive](https://www.twitch.tv/jerichofive)\n[JessGOAT](https://www.twitch.tv/jessgoat)\n[Jynxzi](https://www.twitch.tv/jynxzi)\n[Just9n](https://www.twitch.tv/just9n)\n[KingGeorge](https://www.twitch.tv/KingGeorge)\n[KittyR6](https://www.twitch.tv/kitty_r6)\n[LagonisR6](https://www.twitch.tv/lagonis)\n[Lil_Lexi](https://www.twitch.tv/lil_lexi)\n[Lt Custard](https://www.twitch.tv/lt_custard)\n[Lusorkoeffizient](https://www.twitch.tv/lusorkoeffizient)\n[MacieJay](https://www.twitch.tv/MacieJay)\n[Mag6](https://www.twitch.tv/mag6)\n[M3ry](https://www.twitch.tv/m3ry)\n[Matimi0](https://www.twitch.tv/matimi0)\n[MrBboy45](https://www.twitch.tv/mrbboy45)\n[Narcoleptic Nugget](https://www.twitch.tv/narcolepticnugget)\n[Nesk](https://www.twitch.tv/neskwga)\n[PaladinAmber](https://www.twitch.tv/paladinamber)\n[Patife](https://www.twitch.tv/patife)\n[Pengu](https://www.twitch.tv/pengu)\n[RazaH](https://www.twitch.tv/razah)\n[REMGURI / 렘쨩](https://www.twitch.tv/remguri)\n[Rubsarb](https://www.twitch.tv/Rubsarb/)\n[SexyCake](https://www.twitch.tv/smexycake)\n[Sha77e](https://www.twitch.tv/sha77etv)\n[Shorty](https://www.twitch.tv/shortyyguy)\n[shroud](https://www.twitch.tv/shroud)\n[SilphTV](https://www.twitch.tv/silphtv)\n[Tatted](https://www.twitch.tv/tatted)\n[Tranth](https://www.twitch.tv/tranth)\n[Varsity](https://www.twitch.tv/varsitygaming)\n[WhiteShark67](https://www.twitch.tv/whiteshark67)\n[yo_boy_roy](https://www.twitch.tv/yo_boy_roy)\n[z1ronic](https://www.twitch.tv/zironicdk)\n[Zander](https://www.twitch.tv/zander)\n[ziGueira](https://www.twitch.tv/zigueira)\n[GarfieldIsDoc](https://www.twitch.tv/garfield)\n[Supr](https://www.twitch.tv/supr)\n[RyyFyy](https://www.twitch.tv/ryyfyy)\n[FoxA](https://www.twitch.tv/foxa_r6)\n[Nerdengenheiro](https://www.twitch.tv/nerdengenheiro)\n[Rainbow6itacom](https://www.twitch.tv/rainbow6itacom)\n[Minimichegga](https://www.twitch.tv/minimichegga)\n[JostRekt](https://www.twitch.tv/jost)\n[JustRyuk](https://www.twitch.tv/justryuk)\n[Paluhh](https://www.twitch.tv/paluhh)\n[Poxonlox](https://www.twitch.tv/poxonlox)\n[TheLionerYT](https://www.twitch.tv/thelioneryt)\n[itsSpoit](https://www.twitch.tv/itsspoit)\n[Retalha](https://www.twitch.tv/retalha)\n[FooYa](https://www.twitch.tv/fooya)\n[IceCold](https://www.twitch.tv/icecold)\n[Athieno](https://www.twitch.tv/athieno)\n[Marciu](https://www.twitch.tv/marciu)\n[Rembeey](https://www.twitch.tv/reembey)\n[rasco100](https://www.twitch.tv/rasco100)\n[Vetelcito01](https://www.twitch.tv/vetelcito01)\n[OneShooter](https://www.twitch.tv/oneshooter)\n[Scythe](https://www.twitch.tv/scythe)\n[Jenz](https://www.twitch.tv/jenz)\n[Frankystrings](https://www.twitch.tv/frankystrings)\n[Eternal_regina](https://www.twitch.tv/eternal_regina)\n[Pxppy](https://www.twitch.tv/eternal_regina)\n[Skyte](https://www.twitch.tv/skyte)\n[Ru_rumiiiin](https://www.twitch.tv/ru_rumiiiin)\n[Anifex](https://www.twitch.tv/anifex)\n\n## Program Update\n\nWe have implemented additional screening procedures into our selection process for streamer charms.\n\nUpon selection for the program, streamer charm candidates' main and alt accounts are now screened for MouseTrap violations, in addition to the other screening steps they undergo for eligibility.\n\n## How to acquire charms\n\nThese charms are only available by subscribing to the respective streamer's Twitch channel with a linked Ubisoft account. For more information on how to link your Ubisoft and Twitch account, as well as opt in for Twitch Drops, please refer to [this FAQ](https://support.ubi.com/Faqs/000035432/Get-your-Twitch-Streamer-s-charm).\n\n## How to get involved\n\nWe have updated the Ubisoft Creators Program registration to open the program to TikTok and Instagram, therefore opening new collaboration opportunities for content creators, streamers, fan artists, and cosplayers from our community.\n\nWe are always on the lookout for content creators that inspire and enrich the Siege community. If you would like access to the perks of being a partnered content creator, and your goal is to one day have a charm in the game, we would like to invite you to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/en-us).\n\nFrom there, complete the following steps:\n\n1. Connect your Ubisoft Account. If you do not have one, you can create one [here](https://connect.ubisoft.com/create).\n\n2. Agree upon the eligibility criteria.\n\n3. Connect your primary channel (Twitch, YouTube, TikTok, Instagram) or secondary channels.\n\n4. Indicate your games preferences.\n\n5. Set your location, broadcast language, and communication language.\n\nYour application will then be submitted and must be approved by Ubisoft. An email will be sent to confirm your participation.",
    "categories": [
      "rainbow-six-siege",
      "community"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/7LIsvUBfkr1eXTO2okx8dv/y9s3-streamer-charms",
    "date": "2024-09-06T15:30:00.000Z"
  },
  {
    "id": "5S3SB7uqsvptz8G0Z2csOC",
    "title": "Siege Intels: Competitive Playlist Update",
    "abstract": "Check out the changes coming to the competitive playlist in the upcoming seasons!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6wW1vyFWZHxnmYXiuOCY3m/7d664fd2f6e761935e8478585ff54c5e/Y9_SiegeIntels_Competitive_Playlist.jpg",
    "content": "Our competitive playlists devs have been cooking, guided by your feedback and strong will to enhance your experience: improvements are on the menu for the upcoming seasons! 🔥 \n\n## Y9S3 brings Skill Initialization to Ranked! \n\nThat's right, with this season, Skill Initialization will be implemented into the Ranked experience. To summarize it in its simplest form, __the latest 50 hours of play sessions of a new Ranked players will now be used to determine their starting Skill Value__. That means that right from the first Ranked match, our algorithm will have a stronger confidence level to identify a player's level of mastery, resulting in fairer matchmaking.\n\n## The Siege Cup is here! \n\n![[R6S] Siege Intels: Competitive Playlist Update - IMG 1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4Vpu8LXQYiKsiS9f6kx1kd/378008e6a0926917891616ac227ec6a4/R6S_SiegeCupFrame.png)\n\nLong-awaited and promising to be the ultimate Siege competitive experience, the Siege Cup is soft launching this season with a Beta phase to ensure that no technical details have been overlooked. We want to make sure the worldwide launch of the Siege Cup goes as smoothly as it can for players to experience what is now the closest you can get to playing Siege like the pros. 😎\n\nFor players eligible for the Beta phase (PC) - here are the guidelines:\n\n-  Assemble your squad. __A player can only join one team and no changes to teams will be possible after registering__. All members of a Squad need to be at least Clearance Level 50 and also need to have played more than 10 Ranked matches prior to the tournament.\n\n-  __Identify your Squad Leader, as only they have to register for your team.__ You can use the __*Promote to Leader functionality*__ by selecting your in-game profile from the top of the main menu, choosing a squad member, and pressing __*Promote to Leader*__. It is mandatory that your identified Squad leader is the one who gets accepted to the Siege Cup Beta__ and not another teammate.\n\n-   __Register here:__ [https://register.ubisoft.com/r6s-siegecupbeta](https://register.ubisoft.com/r6s-siegecupbeta)\n\n*Note that all participants' Reputation Standings will be considered and that cheaters will be excluded from the tournament.*\n\n*The Siege Cup will fully launch soon, with squad selection beginning in waves by the end of September!!* 🎉 \n\n__SIEGE CUP FAQ:__ [https://www.ubisoft.com/help/article/000109536](https://www.ubisoft.com/help/article/000109536)\n\n## The Competitive Coins are freshly out of the oven! \n\nThrough the Siege Cup and the Ranked playlist, __R6S competitive players are now able to get unpurchasable credits to access a collection of exclusive items or to redeem competitive packs__ 🎁.  \n\nFor the Siege Cup, the amount you earn is based on tiers and on final positions within the tournament. For Ranked, it will be added to Ranked rewards, which are based on your highest achieved Rank for a season and delivered at the beginning of the following one.  \n\n## The Phantom Player is coming in Y9S4! \n\nWhile we make sure to inform players as soon as improvements are ready to be integrated into Siege, we did share recently with the community some behind-the-scenes work via our latest Siege Intels update on Ranked 2.0. Live Content Director Christopher Budgen answered questions from players in a Q&A-style livestream, and __a major scoop emerged from that discussion__... 👀 \n\nThe Phantom Player is currently in development to enhance the experience of all Ranked players. In a nutshell, the Phantom Player is a mathematical value, a ''6th player'', which will __bring an extra layer of balancing to matchmaking__. Concretely, the Phantom Player sees the skill disparity between players of a stack and adds the appropriate skill value to even out the matches depending on the number of players within this stack.\n\n## There is much more cooking... \n\nThe Rainbow Six Siege team knows the importance of fairness for competitive players, and for almost 10 years now, we have been listening to your feedback and allocating significant resources to refining the experience.  \n\nWhen you have concerns, these become our concerns; we are looking closely into it to find the best innovative solutions that will serve your interest. As you will witness, the work on our playlists is a continuous taskforce, and its future iteration looks quite promising.  \n\nOn our agenda, along with the upcoming changes stated above, we will be answering another community request: __bringing more information in-game for players to analyze and track their performances__.  \n\nWe are also looking into __reworking the top of the ladder experience__; we know that a smaller pool of players is a challenge when it comes to matchmaking. \n\nFurthermore, in a bit we will let you in the know about more updates coming with the __Dynamic Matchmaking__, which is also an important feature currently in development that will tighten Matchmaking a notch further. \n\nLong story short, we are thrilled to bring all these improvements to the game and we encourage you to keep being honest and vocal regarding your appreciation; we'll continue to be on the lookout for your feedback on all this new content.  \n\nLEARN MORE:\n\n- [Ranked 2.0 Introduction Dev Blog ](https://www.ubisoft.com/en-us/game/rainbow-six/siege/news-updates/1iJmqRLqYaCkhFJlhOEGYa/y7s4-ranked-20-update)\n- [SIEGE INTELS informative thread ](https://x.com/Rainbow6Game/status/1795515422638223593)\n- [Livestream Q&A Interview ](https://www.youtube.com/watch?v=G-zlIAtXk2Y&t=3s&type=link)",
    "categories": [
      "dev-blogs"
    ],
    "readTime": 5,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5S3SB7uqsvptz8G0Z2csOC/siege-intels-competitive-playlist-update",
    "date": "2024-08-26T14:30:00.000Z"
  },
  {
    "id": "1P21T5Rllq7X72E0zSGpEG",
    "title": "Y9S3 Designer's Notes",
    "abstract": "In this latest edition of Designer’s Notes, we'll go into more detail about the balancing changes that’ll come with the Y9S3 update and give you some insight into the reasons behind them.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3JtFIreNqi2ZzSaljE7OTv/f1f5fd88e429a66d0be9b57389f7cd1c/DESIGNER_NOTES_Y9S2_960x540.png",
    "content": "In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y9S3 update and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n### WIN DELTA VS. PRESENCE\n\n![[R6S] Y9S3 Designer's Notes - R6S_DN_Y9S3_BalancingMatrix_Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5YI4uambnj6VeBEkAdcqQT/5148748dda57d880a58d06372525e3d9/R6S_DN_Y9S3_BalancingMatrix_Att.mp4)\n\n![[R6S] Y9S3 Designer's Notes - R6S_DN_Y9S3_BalancingMatrix_Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3jgHMyTFU2FaANFPrOtFNc/cefb14e5c1e7eb37d3dd5e2c3f018360/R6S_DN_Y9S3_BalancingMatrix_Def.mp4)\n\n<center>\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n</center>\n\n### OPERATOR BAN RATE\n\n![[R6S] Y9S3 Designer's Notes - R6S_DN_Y9S3_BanMatrix_Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2s7wwdOd7uI3KjTLKAssLV/19c7f4149465d9cd5eb47f330717a5ca/R6S_DN_Y9S3_BanMatrix_Att.mp4)\n\n![[R6S] Y9S3 Designer's Notes - R6S_DN_Y9S3_BanMatrix_Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/aEjTbmsWTDhTuwbhFInGw/1bc271ed8ee9292a7ddb1234e45e1b14/R6S_DN_Y9S3_BanMatrix_Def.mp4)\n\n# OPERATOR BALANCING\n\n### DOKKAEBI\n\nWe have been working on her for a quite some time. We had already explored various ideas and even approved some changes that were scheduled to begin production during Y7. However, due to other pressing priorities, her progress was consistently delayed. The purpose of this prototype was to prevent the current situation to happen. We intended to limit her initial strength while enhancing her potential by the end of the round, allowing for a snowball effect if played strategically. Unfortunately, given the current circumstances, this proposal isn't ideal anymore. Consequently, we've decided to focus on a more substantial change - one that addresses most of the existing issues and frustrations - for a future patch.\n\nIn the meantime, we believe that a small adjustment to her resource management could alleviate some of the frustration when playing against her and the ban rate. Specifically, preventing Dokkaebi from calling defenders immediately after spawning should help improve the overall perception.\n\n#### LOGIC BOMB\n\n- Initial charges: 0\n- Refill time: 45 seconds\n- Max. resources: 2\n\n### NØKK\n\nAs we previously mentioned, we have been actively exploring various ideas to enhance Nøkk's play style. After careful consideration, we decided to move away from the 'silent' approach. Our belief is that sound plays a pivotal role in Siege, and everyone should be able to rely on it consistently. Additionally, being silent tends to encourage to try luck sneaking up on opponents for surprise eliminations, which can be frustrating for the victim and not a very tactical approach.\n\nTherefore, we made the decision to enhance Nøkk's capabilities related to fake intel by reducing reliance on defensive intel tools. Now the ability gauge will only deplete when Nøkk performs an action that causes her glitch. This adjustment allows her to hold angles indefinitely without being detected, creating a deceptive sense of security for defenders as they navigate around the map. Instead of solely relying on going into the bomb site to take down targets, Nøkk will excel at cutting rotations and flank watching. This change will also allow Nøkk to push along a teammate without being worried about the ability running out, so will be easier take the defender by surprise if it was expecting a 1v1 situation.\n\nWe've also adjusted the ability values. On one hand, we've reduced the maximum resources because it now represents the time Nøkk can glitch with the ability active. The ability can be active throughout the entire round if she manages not to glitch. On the other hand, we've extended the time needed to refill the ability, making reckless consumption without good reason more punishing.\n\nWhile this change will impact all defensive cameras, Valkyrie is likely to be the most affected defender. This isn't due to the cameras being weaker, but rather because they now face another effective counter. Avoiding Evil Eyes and Bulletproof Cameras is relatively straightforward since they are easy to spot. However, Black Eyes are more challenging to avoid because their locations are often unknown, and it's likely that you will still be within their range when the ability expires.\n\n#### HEL PRESENCE REDUCTION\n\n- The ability does not deplete automatically upon activation. Only the time glitching consumes resources.\n- Max. resources: 10 seconds\n- Time for complete refill: 120 seconds\n- Min. resources to activate: 20%\n\n### SOLIS\n\nThis is our second wave of changes for Solis, this time we are focusing on her ability and the resource management. Solis should be able to fulfil the same strategies while being more taxing on the players attention to Solis resources.\n\nThere are three pillars behind this new wave of changes, the first one is the Detection Mechanic, we've tweaked the SPEC-IO detection area, now only the central area will detect gadgets and their identity will be hidden. This change aims to make players be more focused while using the ability, looking for gadgets require more time and attention.\n\nThe second pillar is the Scan Mechanic Rework, the Scan has become the Overclock Mode, when the Overclock Mode is activated the SPEC-IO energy is refilled and Solis will reveal the identity of every gadget that enters the central area. The Overclock mode has a limited amount of uses during the round, and once triggered it cannot be stopped. The Overclock mode introduces a new counter for Solis, while it is active every Enemy Observation Tool within Solis Detection range will receive a warning that alerts them about her presence. The rework of this mechanic adds more depth to Solis actions and will price players that choose the right moment to trigger the Overclock mode.\n\nThe Third Pillar is revisiting existing Balancing Levers, we would like to revert some of the changes that we did in Y9S2 that were aiming to limit the SPEC-IO power, we consider that this new set of changes gives more room to boost the minimum energy required to access the SPEC-IO while they are charging up during the round.\n\nThe new set of changes add a good amount of balancing levers that will allow us to tweak Solis power level in the future, we will monitor her performance and take actions if needed.\n\nThis update also provides indirect advantages for operators who were previously hard-countered by Solis, such as Glaz, Jackal, or Nøkk. Essentially, any attacker using a wearable device will find it easier to use them, as it will be more challenging to distinguish them from other electronic devices. To identify these operators, Solis will need to activate the Overclock mode, which can reveal her location to any nearby observation tool, making it a risky move. Additionally, operators with special drones, such as Twitch, Brava, or Flores, will also benefit from this change, as their utilities can remain unidentified until they have accomplished their objectives.\n\nAnother significant impact on the dynamics between Attackers and Defenders is the new approach to the Defuser. Without using the Overclock mode, Solis will be unable to determine 100% if the Defuser is being planted, giving attackers more opportunities to fake plants or assess the risks.\n\nOverall, the risk and reward of attempting to destroy unidentified gadgets can vary greatly, which implies a buff for a lot of operators.\n\n#### SPEC-IO ELECTRO-SENSOR\n\n- Base SPEC-IO Changes\n  - Only the center of the Screen will detect enemy gadgets.\n  - Gadgets will not show their identity until on Overclock Mode.\n  - Minimum required energy to use the SPEC-IO reduced to 50% (was 100%)\n- Scan Mechanic redesigned into Overclock Mode.\n- Overclock Mode will identify every gadget in the center of the screen.\n- Overclock Mode lasts for 10s.\n- Overclock Mode has 1 charge ability at the start of the round.\n  - A charge is added every 25s.\n  - Max Charges per match are 3.\n- During Overclock Mode the SPEC-IO will emit a Warning Signal.\n  - Only Observation Tools withing Solis detection range (12m) will see it.\n\n# GADGET BALANCING\n\n### CLAYMORE\n\nThe current delay between the enemy detection and the explosion provides defenders with ample time to either destroy the mine or even consider escaping from the blast. This is particularly noticeable when the Claymore is placed on windows, where enemies must vault and the operator's legs cannot touch the lasers until they are about to land.\n\nRemoving the delay would increase the risk for defenders attempting to destroy a well-placed mine or pre-fire it before their legs touch the lasers. Consequently, the Claymore would become more efficient for safeguarding flanks and would reward players who invest time in placing them properly.\n\n#### DETECTION SYSTEM\n\n- Removed delay between activation and explosion (from 0.2 seconds).\n\n#### OPERATORS AFFECTED\n\n- Ace\n- Ash\n- Blackbeard\n- Brava\n- Capitão\n- Flores\n- Glaz\n- Grim\n- IQ\n- Jackal\n- Kali\n- Lion\n- Maverick\n- Osa\n- Sens\n- Striker\n- Thatcher\n- Twitch\n- Zero\n- Zofia\n\n### PROXIMITY ALARM\n\nWe've noticed an increase in player feedback concerning Sentry and the potent combination of the Nitro Cell with the Proximity Alarm, especially when players depend solely on the Proximity Alarm Scoring System to activate their pre-placed Nitro Cell from any location on the map.\n\nOur data analysis indicates that this tactic is not the most frequently chosen combination. Nonetheless, we recognize the potential frustration it can cause. Therefore, we have opted to remove the score given when an enemy triggers a Proximity Alarm. While Sentry can still utilize the sound cue to set off pre-placed Nitro Cells close to Proximity Alarms, the absence of scoring means he must depend solely on sound, which we consider to be a more fair interaction.\n\n#### SCORING\n\n- Removed the Scoring Award triggered when an enemy activates a Proximity Alarm.\n\n#### OPERATORS AFFECTED\n\n- Alibi\n- Castle\n- Caveira\n- Goyo\n- Mira\n- Rook\n- Oryx\n- Sentry\n- Skopós\n- Smoke\n- Solis\n- Tachanka\n- Tubarão\n- Wamai\n\n# WEAPON BALANCING\n\n### FMG-9\n\nThis season, Nøkk will undergo significant changes, and we aim to use this chance to reevaluate the FMG-9's recoil. Our goal is to enhance the weapon's reliability by ensuring it is more comfortable to maintain long bursts and by decreasing its horizontal recoil. These new recoil adjustments should make Nøkk more proficient in holding long angles, as the weapon will be much more manageable.\n\n#### RECOIL - PC\n\n- Reduced first kick.\n- Reduced horizontal recoil.\n- The recoil will remain stable for longer during a sustained fire burst.\n\n#### RECOIL - CONSOLE\n\n- Reduced lateral recoil. \n\n#### OPERATORS AFFECTED\n- Nøkk\n- Smoke\n\n### R4-C\n\nOur intention when reducing the R4-C magazine size is to balance Ash's overall effectiveness and the number of gunfights she can engage in before needing to reload. A smaller magazine encourages more thoughtful ammo management, reduces sustained firepower, and limits the angles she can pre-fire. R4-C users will need to be more precise with their shots.\n\nAdditionally, this change distinguishes the R4-C from other options available---the G36C on Ash or the LMG-E on Ram---encouraging players to re-evaluate the advantages of each weapon and choose the one that best suits their needs.\n\n#### BASE STATS\n- Magazine: Reduced to 25 bullets (from 30).\n- Ammo: Kept with 6 magazines. Number of bullets reduced to 151 (from 181).\n\n#### OPERATORS AFFECTED\n- Ash\n- Ram\n\n# RANK DISTRIBUTION\n\n![[R6S] Y9S3 Designer's Notes - Y9S2_Rank_Distribution_PC](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4NOlsNRLlvvnKpziGw6qYr/c42f38dbfd6777a983d25ecf38ba8ef0/Y9S2_Rank_Distribution_PC.png)\n\n![[R6S] Y9S3 Designer's Notes - Y9S2_Rank_Distribution_Console](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/bp5DgGYuDsti8EY4u1X3N/cd056a66792253667bb682424454841d/Y9S2_Rank_Distribution_Console.png)\n\n<hr>\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 10,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1P21T5Rllq7X72E0zSGpEG/y9s3-designers-notes",
    "date": "2024-08-26T13:00:00.000Z"
  },
  {
    "id": "1CcXWoxmM7OHwrntPmHOSs",
    "title": "Y9S2 MID-SEASON ROADMAP UPDATE",
    "abstract": "Check out what's coming to Rainbow Six Siege in the Y9S2 Mid-Season Roadmap Update.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2uFKnUih8RZtnZg0IdxC9Y/b62f26ae324f40ed26d05cf7a8ca94ca/Y9S2_Roadmap_Update.960x540.jpg",
    "content": "Each season, we provide a Roadmap update to offer further insights into the development of upcoming features to ensure transparent communication with all players. Each update and decision we make takes into account various elements such as player feedback, time allocated to ensure the quality of the features delivered, and more. \n\nWith that in mind let's delve into this Mid-Season Roadmap Update!\n\n![[R6S] Y9S2 Mid-season Roadmap Update - Roadmap Update](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/69Cig1tPQejFOIBZfzbfZt/4efca81c271aaee9753b56e34a2a095a/RoadmapUpdate.960x540.jpg)\n\n## ROADMAP UPDATES\n\n### [MAJOR FEATURE] SHOOTING RANGE ACCESS DURING MM\n\n- __Status: Confirmed for Y9S3__\n\nIn Y9S3 players will be able to practice their aim while waiting for a match. Search for a match, select the Shooting Range, and the game will take you into your match once it's ready.\n\n### [NEW] [PLAYER PROTECTION] BINARY HARDENING\n\n- __Status: Confirmed for Y9S3__\n\nWe will continue to enhance game security by introducing changes to the game code base using encryption and hardening techniques. These updates will help to disrupt cheat makers and make future cheating creation more difficult. Find out more in our latest [Player Protection Update](https://rainbow6.com/PlayerProtection-13).\n\n### [NEW] [PLAYER PROTECTION] QB SYSTEM EXPANSION\n\n- __Status: Target Delivery: Y9S4__\n\nThe QB System is one of our security systems for Siege. After a successful introduction in 2022, we found that production was halted by several cheat creators. Our Anti-Cheat team is currently working on an expansion of the QB System which we believe could be a game changer for the disruption of cheat makers.\n\n### [MAJOR FEATURE] SIEGE CUP BETA (PC)\n\n- __Status: PC BETA Confirmed for Y9S3__\n\nThe Siege Cup will first launch in Beta form with a limited availability, releasing on PC only initially and in the NA and EU regions. The Siege Cup will provide a highly competitive experience and so this testing phase will allow us to trial the feature itself while also analyzing server performance. It’s crucial that we provide a polished and fair experience for everyone and this initial Beta phase will help to facilitate a full release in the near future.\n\n### [BALANCING] SOLIS UPDATE PT 2, DOKKAEBI, NØKK\n\n- __Status: Confirmed for Y9S3__\n\n__Solis:__ Part 1 of the Solis update came with Y9S2. In the upcoming season we'll be bringing the deeper system changes that we've been working on.\n\n__DOKKAEBI__: The update coming to Dokkaebi will directly tackle some of the frustrations that her opponents feel, while ensuring that she can remain an impactful attacker.\n\n__NØKK:__ In Y9S3 we'll be bringing an update to Nøkk designed to improve her usability and playability.\n\n### [PLAYER COMFORT] AFTER ACTION REPORT 2.0\n\n- __Status: Confirmed for Y9S3__\n\nThe After Action Report that you see after completing a match will see a full redesign, realizing a fresh and more fluid experience.\n\n### [MAJOR FEATURE] BADGES AND CAREER\n\n- __Status: Delayed to Y9S4__\n\nAs announced in the [Year 9 Overview](https://youtu.be/FM5sLdTX5Go?si=lM1v8oFVQrTWqVbG&t=329&type=link), Badges will allow players to show-off their hard earned achievements in Siege. The Career page will also be a new home for players wanting to track in-game stats, Rank, Reputation and more.\n\n### [MAJOR FEATURE] VERSUS AI 2.0: ATTACKERS\n\n- __Status: Confirmed for Y9S3__\n\nIn Y8S4 we released the Versus AI Beta, allowing players to play against defending AI alone or in a squad. With Versus AI 2.0, players will now be able to defend the site, while a team of highly trained AI Operators do their best to infiltrate and take victory.\n\n### [TRAINING AND ONBOARDING] TARGET DRILL\n\n- __Status: To be removed in Y9S4__\n\nSince the release of Endless Drill, we’ve quickly seen it become the new favorite way for players to warm up and sharpen their skills against dummies. With this in mind, Target Drill will be removed in Y9S4, effectively being fully replaced by Endless Drill. With Endless Drill being the only way to train against dummies from that point, it will also be renamed to Target Drill.\n\n### FULL REVEAL\n\nStay tuned for the __Year 9 Season 3 reveal__ coming up on Sunday, __August 25th__, at 10AM PT / 1PM ET / 7PM CET. \n\n<hr>\n\nJoin the discussion on [Twitter](https://twitter.com/Rainbow6Game/), [Instagram](https://www.instagram.com/rainbow6game/), [Reddit](https://www.reddit.com/r/Rainbow6/), [Discord](https://discord.gg/rainbow6), [Facebook](https://www.facebook.com/Rainbow6/), and [TikTok](https://www.tiktok.com/@rainbow6game).\n\nCheck out the [public Roadmap](http://rainbow6.com/roadmap) for more information on the changes coming your way!",
    "categories": [
      "rainbow-six-siege",
      "game-updates"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/1CcXWoxmM7OHwrntPmHOSs/y9s2-midseason-roadmap-update",
    "date": "2024-08-19T14:15:00.000Z"
  },
  {
    "id": "3ZO4TETkmQyyXSNXcQqi2w",
    "title": "PLAYER PROTECTION UPDATE",
    "abstract": "Find our latest Anti-Cheat and Anti-Toxicity updates.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6dXmDUicY8A4TRFnKqHOtT/9160bb33ed0946ecc6835fcd999d1df5/PP_960x540.jpg",
    "content": "We know that Y9S2 has seen an increase in cheater activity, and in this Player Protection Update we will be showing how we are working to reverse this. The journey of Anti-Cheat is a constant back and forth between ourselves and cheat makers, and we are in this alongside our players. We are coming back stronger, and our efforts and passion will not be thwarted.\n\nCovered in this update:\n\n__ANTI-CHEAT__\n- Encryption - Binary Hardening: The Impact & Investment\n- The QB System: Advancement & Investment\n- MouseTrap: Updates & PC Matchmaking\n- Match Cancellation 3.0\n- New Ban Data For May & June\n\n__ANTI-TOXICITY__\n- Learnings\n- Reputation Standings: Changes\n- Reputation System: Y9S4 Refresh\n- Additional Updates & Features\n- In-Game Player Reports\n\n# ANTI-CHEAT\n\n![[R6S] PLAYER PROTECTION UPDATE – AUGUST 2024 - Anticheat](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/DvDeHNJqn00KKWf19pbfn/b3a91e0ccffbbbec8166e43e5451af5c/AC.Light.RED.150x960.png)\n\n## NEW ANTI-CHEAT DEVELOPMENT TEAM\n\nIn Y9S1, we decided that it was necessary to have increased, long-term investment for Siege Anti-Cheat. In response to this, we restructured our team in a way that would dedicate more resources to the challenges of cheating and Anti-Cheat. Our new team is now composed of multi-disciplinary expert developers with an increased field of expertise that has continued to ramp up since our last [Anti-Cheat Status Update](https://rainbowsix.com/AntiCheat_May24), and is dedicated to improving the cheating situation in Siege.\n\n### CORE STRATEGY - PROACTIVE & REACTIVE\n\nOur Anti-Cheat strategy can be split into two main parts: proactive and reactive protections.\n\n__Proactive protection__ includes measures which are taken ahead of time, some of which will have a future or longer-term impact. These will generally impact cheat creators more, leading to reductions in the availability of cheat software. Encryption and binary hardening are proactive measures, which work by securing the game and making the creation of cheat software more difficult. Our team will be using these proactive measures to disrupt cheat-makers, making cheats more difficult to maintain.\n\nWith our proactive protections having reduced the amount of cheat software available, our __reactive protections__ can now continue the journey. Reactive protections will cover the areas which tend to affect cheaters themselves, who again, will have less software to choose from. This is where BattlEye and the QB System step in, working again to disable cheats and ban illegitimate players.\n\nThe Anti-Cheat team is working to create new  innovative approaches to Anti-Cheat in both the __proactive and reactive__ areas by pursuing research and development. They will also be adding new data points and detections to our systems  as part of our range of reactive protections, including detections for abnormal gameplay behaviours.\n\n## PROACTIVE PROTECTION\n\n### ENCRYPTION - BINARY HARDENING\n\nAfter the beginning of Y9S1, we started work on an internal roadmap to update the game code base using __encryption and hardening techniques to enhance security__. We've made several hardening updates during Year 9 so far; however, this is a long-term strategy. While every security update that we make has the potential to help in the here and now, this work will hit ongoing and future cheat creation hardest, as it results in new cheats being harder to develop, increasing the barriers to entry. The resources that we are putting into encryption and binary hardening will set Siege's security foundations for the future.\n\n__ANALYZING UPDATES__\n\nThe changes introduced with encryption and binary hardening can however also work by disrupting cheat-makers, resulting in __unstable cheats after each season update__, patch, or hotfix. We closely analyse the time that it takes for cheats to get back online after each deployment while also monitoring in-game cheating reports. Such analysis helps the Anti-Cheat team to understand how an update has performed and which changes might have been the most impactful, helping us to measure the performance of such updates.\n\n__Y9S2 CHEATING INCREASE: WHAT WE'RE DOING__\n\n__Some cheats came back online more quickly than expected after the launch of Y9S2, resulting in a surge of cheating early on__. We also measured an increase in cheater reports during this time, indicating that players were coming into contact with cheaters more often. Our promise is to keep __investing in hardening for seasons to come__, all the while working to find __new ways to further improve the game's security__. These will be key factors in reducing the impact of cheaters in both the short and long term. In the meantime, we ask that you continue to report players that you suspect of cheating, as this is a tremendous help for the team.\n\n## REACTIVE PROTECTION\n\n### QB SYSTEM - EXPANSION\n\nThe QB System is our bespoke security system which saw an extremely successfully introduction in late 2022, with several cheat creators halting production for Siege. The addition of the QB System into Siege was monumental, but as cheats received updates, more of them were able to function with success. As is the case with other security and Anti-Cheat systems, the QB System requires constant updating, and our team is committed to this. Our new Anti-Cheat team is currently __working on an expansion of the QB System which we believe could be a game changer for the disruption of cheat makers__. We cannot share technical details at this time, but we are hoping to be able to test a prototype in Y9S4.\n\nThe QB System is crucial in undoing the increase in cheating that players have felt this season, and it remains to be a high priority for the team.\n\n### MOUSETRAP - MOUSE & KEYBOARD DETECTION ON CONSOLE\n\nMouseTrap first released in Y8S1 with unprecedented success, reducing spoofing device usage by 78%. In some cases, cheaters did find ways around this system and so the team has worked to resolve any exploits that have arisen.\n\nToday we are focusing our MouseTrap efforts on its __detection capabilities, continuously making updates__ and monitoring its performance. As we continue to work, we will be ensuring that __more device types can be detected with increased accuracy.__\n\n__MOUSETRAP - PC MATCHMAKING__\n\nAs we have shared previously, an overhaul on the MouseTrap sanctions system will also be coming in Y9S4, forcing confirmed users of spoofing devices into PC matchmaking. Let us be clear too, that those players will be fighting on the proper PC playing field, so we are working to __ensure that PC recoil will also be activated in those cases__. If you are using a spoofing device, you will not have an advantage.\n\n## MATCH CANCELLATION 3.0\n\nMatch Cancellation 3.0 will be coming in __Y9S4__ and will feature Cheater Match Cancellation. With this version, once a cheater is confirmed and consequently banned, the match they are in will be automatically cancelled, leading to less time being spent by honest players in unfair matches.\n\n## BANS - DATA BANS + BATTLEYE\n\n### BAN NUMBERS\n\nBan data for the 2024 so far, including new data for May and June.\n![[R6S] PLAYER PROTECTION UPDATE – AUGUST 2024 - Ban numbers](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7KKL5W450bEPOCfkAIjadE/ed2012c3d9d292e2110f8cfb71399494/R6_BanChart_Jan-Jun24.jpg)\n\n## A MESSAGE FROM THE ANTI-CHEAT TEAM\n\nAs passionate developers and players, we acknowledge __cheating as a top priority for our game__. We believe fairness is at the core of a competitive game such as Siege, and are fully dedicated to making it a safer, fairer, and a more competitive space. We believe that we have gathered the right team of passionate experts to tip the scales in our favor in the cat and mouse game we play against cheaters and cheat-makers. As we move forward, we will be providing more transparency on our ongoing strategies.\n\n# ANTI-TOXICITY\n\n![[R6S] PLAYER PROTECTION UPDATE – AUGUST 2024 - antitoxicity](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5OkxcLRECm0ELbBuiGN6l7/154af1d2a0a8a35acc4059bcb0c5c773/AT.Light.GREEN.150x960.png)\n\n## TOXICITY MONITORING\n\n### PHILOSOPHY - PROTECTING PLAYERS FROM TOXICITY\n\nWe have redefined the way we want to monitor and drive our initiatives related to toxicity in Siege, and our main focus remains to __protect all players from experiencing toxicity in-game while measuring toxicity in a way that makes sense for all players__.\n\n### IN-GAME PLAYER REPORTS\n\nIn-game player reports are crucial for connecting player experiences with the Anti-Toxicity team. While your reports help to manually outline the possible behavioral patterns of an individual, they also help us to analyse the current state of toxicity in-game through your perception of it. This is why in the future, we will be making changes to ensure that the report feature is as accurate as it should be.\n\n## NEW MINDSET\n\n### LEARNINGS\n\nSince the Reputation System first released in its Beta form, we have received a lot of valuable feedback. This feedback has taught us that all features related to Anti-Toxicity must be transparent and clear. We know that we have not met this standard yet.\n\nWith your help, we have learned that we need to more closely align our Anti-Toxicity features with your expectations and sensitivities, fostering a fair and collaborative environment. Our commitment is to ensure that this system not only protects but is also easily understood by everyone. The primary goal of the Reputation System remains to protect the community from recurrent or highly toxic players while rewarding those who consistently demonstrate positive behavior.\n\n### REPUTATION STANDINGS\n\nMoving forward, __we will be removing abusable actions that affect a player's Reputation__ __Standing__. We will also be removing or updating any Anti-Toxicity features that can be exploited. The result will be that only your own actions will have a negative impact on you.\n\n__Changes:__\n\n- __[Y9S1]__ Deactivation of Written Chat and Voice Chat Penalties that could have relied on the unverified actions of other players.\n- __[Y9S2.3]__ Deactivation of the Friendly Fire kick that could be abused leading to targeted players being kicked.\n- __[Y9S4]__ Future removal of abusable or inaccurate actions which feed the Reputation System.\n- __[Future Update]__ Removal of the Reverse Friendly Fire deactivation after reviving a teammate, due to its abuse.\n\n### REPUTATION SYSTEM: Y9S4 REFRESH\n\nThe __current Reputation System is not as transparent or as clear to understand as we would like__, and so in __Y9S4__ __we are aiming to release a refresh__. As part of this, we are designing a new Reputation Center which will be easier to understand for everyone and give better insight into how your actions will affect your Standing.\n\n__MOUSETRAP IMPLEMENTATION__\n\nThis new Reputation System will also tap into MouseTrap in __Y9S4__, meaning the usage of spoofing devices will start to affect players' Reputation.\n\n__AUTOMATED TEXT CHAT MODERATION__\n\nComing to the Reputation System in __Y9S4__ __is AI text chat moderation__. With this, AI will analyze and moderate all text chat messages in real-time, resulting in problematic messages being censored or flagged. Your messages will have an impact on your Reputation Standing, whether they are censored, flagged, or positive.\n\n__IMPACTS & FULL RELEASE__\n\nImpacts based on your Reputation Standing alone will not be activated until the Reputation System leaves Beta and a full release is realised. This will not happen until we are absolutely confident in the robustness of the Reputation System, while being sure that it is understandable, transparent and clear for players. With this in mind, we will not be sharing potential dates for a full release just yet.\n\n### ADDITIONAL UPDATES & FEATURES\n\nHere is a look at some of the other Anti-Toxicity topics that our team is working on at the moment but are not yet ready to be shared in detail.\n\n__COMMENDATIONS & SQUADS__\n\nWe know that the Commendation system is not as rewarding for those that regularly play in squads, and this is due to the Commendation limits that were put in place with the feature launch. We are working to change this behavior to make it more fair for squads.\n\n__IN-GAME REPORTING OVERHAUL__\n\nThe report system can be used in ways which reduce the accuracy of reporting overall. We plan to overhaul this system in the future with this in mind.\n\n__VOICE CHAT MODERATION__\n\nAutomatic voice chat moderation is a very important topic for us, and it will be added to the game as soon as we are ready.\n\n__REPUTATION SYSTEM DEPENDENCIES__\n\nThe Reputation System has a lot of dependencies with other elements of the game. We know that in some instances bugs can cause certain actions to be unfairly received or go unaccounted for. We are working on clear mitigation plans and safeguards to be sure that these situations impact you less.\n\n## TO THE FUTURE\n\nWith a new strategy, our latest learnings, and a wealth of updates and changes planned, we hope that the Reputation System will become a powerful tool for players. __We want everyone to have the power and knowledge needed to be able to control their path, and we are working towards a clearer system__.\n\nThank you for your feedback; we look forward to bringing these changes to you.",
    "categories": [
      "rainbow-six-siege",
      "anti-cheat",
      "toxicity",
      "dev-blogs"
    ],
    "readTime": 11,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3ZO4TETkmQyyXSNXcQqi2w/player-protection-update",
    "date": "2024-08-02T15:15:00.000Z"
  },
  {
    "id": "5yr68dk5Ez3UtuzmGFtjwb",
    "title": "Y9S2.3 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y9S2.3!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7uAbuofI0RTo7vHDWH57Lf/2791911753c3ab57b43238d0565188ef/PN_Y9S2.3_960x540.jpg",
    "content": "Here you can find the updates and fixes for the Y9S2.3 patch.\n\n# Y9S2.3 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n-   Ubisoft Connect: 570 MB\n-   Steam: 486 MB\n-   Xbox One: 0.8 GB\n-   Xbox Series X: 1 GB\n-   PlayStation 4: 525 MB\n-   PlayStation 5: 3.63 GB\n\n# PLAYER PROTECTION\n\n__DEACTIVATION OF THE REPUTATION STANDING POP-UP:__\n\n- Instead of a Reputation Notice pop-up, a yellow dot will now appear on the main menu's Reputation System tile every time a player's current Reputation Standing changes.\n\n__DEACTIVATION OF TEAM KILL KICK:__\n\n- Players will no longer be kicked from a match after excessively killing or damaging too many allies but will still have reverse friendly fire activated. Team kills and ally damage will still count towards penalties and impact current reputation.\n\n# PlayStation® TOURNAMENT\n\n- The Rainbow Six Siege PlayStation® Tournaments feature has been deactivated permanently.\n\n# OPERATOR BALANCING\n\n### AZAMI\n\n- Kiba Barrier: Increased bullet damage received.\n\n### BUCK\n\n- Removed GONNE-6.\n\n### GRIDLOCK\n\n- Increased Trax Stingers' damage to 15hp (from 10).\n\n### ECHO\n\n- Added Magnified Scope to the MP5SD.\n- Changed to 3 health and 1 speed (from 2/2).\n\n### ELA\n\n- Removed Observation Blocker.\n- Added Impact Grenades.\n\n### MELUSI\n\n- Removed Magnified Scope from MP5.\n- Added ITA12S as a secondary weapon.\n- Increased Banshee Sonic Defense to 4 (from 3).\n\n### WAMAI\n\n- Removed Magnified Scope from MP5K.\n\n# BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Objective flow breaks when vaulting outside a window located at 2F East Corridor during the action phase of the Defense Tutorial. \n\n### LEVEL DESIGN  \n\nFIXED - Operator's leg clips through a wall next to the door located at 2F Day Care on the Theme Park map.\n\nFIXED - Players can navigate on top of the concrete cover located at 2F Target Corridor on the Stadium Alpha map.\n\n### OPERATORS\n\nFIXED - Fenrir's F-NATT Dread Mine can be clipped inside wooden panels using a bulletproof camera.\n\nFIXED - Players can do melee attacks with Montagne's Le Roc Shield before it's finished deploying.\n\n### USER EXPERIENCE\n\nFIXED - Chat loses functionality for all players if two users send a message with the maximum number of characters.\n\nFIXED - Battle Pass tab replaces the Main Menu tab when leaving the Battle Pass map and pressing the escape key at the same time.\n\nFIXED - Intro tab is incorrectly highlighted when going to the progression menu from a modal that takes you to the Battle Pass tab.        \n\nFIXED - Chat doesn't appear or is slow to load for other players of an online session if Text Chat channel is set to All.\n\nFIXED - Chat window shrinks in size if players send successive long messages.\n\nFIXED - Text chat messages are not sent when pressing Enter during the match.\n\nFIXED - Placeholder text is present for the Squad Leader in the bottom left corner of the screen during the After Action Report.\n\nFIXED - Recoil patterns occasionally won't load in the Advanced Weapon Stats section if players cycle through multiple attachments of the same type in full screen.\n\nFIXED - Fire Power weapon stat doesn't account barrel attachment changes.\n\nFIXED - Placeholder name and organization appear in the loadout menu of the shooting range and attacker repick before the player selects an operator.",
    "categories": [
      "rainbow-six",
      "patch-notes"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/5yr68dk5Ez3UtuzmGFtjwb/y9s23-patch-notes",
    "date": "2024-07-25T09:15:00.000Z"
  },
  {
    "id": "6dN3Cvhf3lyZO52nAgcRuQ",
    "title": "Y9S2.3 Designer’s Notes",
    "abstract": "In this latest edition of Designer’s Notes, we'll go into more detail about the balancing changes that’ll come with the Y9S2.3 update and give you some insight into the reasons behind them.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2tYz3kUebGWfXaZ6aHUTfu/0242910c23d149c3c0e1fb730172d979/DESIGNER_NOTES_Y9S2_960x540_V2.png",
    "content": "In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y9S2.3 update and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n### WIN DELTA VS. PRESENCE\n\n![[R6S] Y9S2.3 Designer's Notes - R6S_DN_Y9S2.3_BalancingMatrix_Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7s9xhGGrERjkaFht7rEqT/277ab9a6c465e9bc4e4ea1f9e0b3cd73/R6S_DN_Y9S2.3_BalancingMatrix_Att.mp4)\n\n![[R6S] Y9S2.3 Designer's Notes - R6S_DN_Y9S2.3_BalancingMatrix_Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6NQ7xCy02w68UwSruRtvRU/28589ff8abca62340fdc7ffee56b7cc4/R6S_DN_Y9S2.3_BalancingMatrix_Def.mp4)\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n### OPERATOR BAN RATE\n\n![[R6S] Y9S2.3 Designer's Notes - R6S_DN_Y9S2.3_BanMatrix_Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3KJiAbc31PkG9qSEvU3tiE/3bd7bf8c1f4bee0597a85b85015b3627/R6S_DN_Y9S2.3_BanMatrix_Att.mp4)\n\n![[R6S] Y9S2.3 Designer's Notes - R6S_DN_Y9S2.3_BanMatrix_Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1gniRWq1KW1qt9yL5OB5Ff/b9cda6e4fdb778d5c7bd3eaaee7a7bbf/R6S_DN_Y9S2.3_BanMatrix_Def.mp4)\n\n# OPERATOR BALANCING\n\n* * * * *\n\n### AZAMI\n\nIn Y8S4, the destruction rates of the Kiba Barriers were divided between 56% from explosives and 44% from melee attacks. Following the update in Y9S1, the rates shifted to 42% explosives, 29% melee, and 28% bullets. However, during the season, explosive usage increased while bullet damage decreased. As a result, we made adjustments in the mid-season patch, but the usage of bullets didn't even match the numbers we had at the beginning of the season.\n\nTo address this, we've decided to further boost the damage modifiers. After analyzing a longer data period, we're less concerned about barriers being too vulnerable to bullets at close range. Melee attackers continue to be a more efficient and quicker method for barrier destruction. Our goal is to make barrier destruction more viable from longer distances, taking into account the damage drop-off of weapons. We aim for a more balanced usage of bullets and explosives.\n\n#### KIBA BARRIER\n\n- Increased damage received by Handguns:\n  - 20% by Small calibers (e.g. USP40).\n  - 30% by Medium calibers (e.g. M45 MEUSOC).\n  - 20% by High calibers (e.g. D-50).\n- Increased by 20% the damage received by Revolvers.\n- Increased by 30% the damage received by Machine Pistols.\n- Increased damage increased by Submachine Guns:\n  - 30% by Small calibers (e.g. Mx4 Storm).\n  - 20% by Medium calibers (e.g. K1A).\n  - 20% by High calibers (e.g. UZK50GI).\n- Increased by 20% the damage received by Assault Rifles.\n- Increased by 20% the damage received by Light Machine Guns.\n- Increased by 20% the damage received by Designated Marksman Rifles.\n- Increased by 20% the damage received by Sniper Rifles.\n  - 150% by CSRX 300.\n\n### BUCK\n\nOver the past couple of years, attackers have gained additional tools to counter defenders' bulletproof utility (such as Brava and Ram) and increased access to explosives (including the additional Gonne-6 and Frag Grenades). As time has passed, many of the stronger defenders have already been addressed by adding more non-explosive counters (like Azami and Fenrir). Therefore, we believe that Buck's Gonne-6 is overshadowing other operators who specialize in explosive capabilities.\n\nOur intention for Buck is to maintain his focus on environmental destruction and vertical play. We feel that the Gonne-6 is unnecessary for him to excel in this area.\n\n#### LOADOUT\n\n- Secondary weapons: Removed Gonne-6.\n\n### ECHO\n\nDespite the increased pick rate of the Supernova (approximately from 5% to 20%), our intention to position it as an alternative to the usual site architects has unfortunately resulted in it being underutilized. Consequently, we have decided to restore its armor and speed ratings and reintroduce the Magnified Scopes into the MP5SD. The new sights are designed to encourage a more passive playstyle, which should synergy well with him staying on drones at a distance from the action and hold long angles if needed.\n\nWe acknowledge that these adjustments alone may not be sufficient to increase Echo's presence substantially, so we are investigating additional changes for the Yokai drones in the background.\n\n#### BASE STATS\n\n- Armor: 3 (from 2).\n- Speed: 1 (from 2).\n\n#### LOADOUT\n\n- MP5SD: Added Magnified Scopes to sights options.\n\n### ELA\n\nAs we are adjusting the killing potential of Melusi and Wamai, we have identified an opportunity to enhance her roaming capabilities to fill the gap that those operators might be leaving. Given the recent additions to the defensive roaster, Ela's role has become more constrained. To address this, we have decided to reintroduce her Impact Grenades, allowing her greater mobility and additional tools against Ballistic Shields.\n\nEla's current lethality is significantly lower than it was in Year 3 when we initially removed the grenades. By reintroducing them, our goal is to make her gameplay more dynamic during the round without creating an overly oppressive experience for the attacking team.\n\n#### LOADOUT\n\n- Secondary gadgets: Removed Observation Blocker. Added Impact Grenades.\n\n### GRIDLOCK\n\nDespite she has a lot of resources and each canister covering a relatively large area, defenders do not seem particularly scared when encountering them. And the punishment for ignoring them is not severe enough. Currently, an enemy only takes 3 ticks of damage when crossing a fully expanded canister, which is only 30 hit points. Furthermore, even if the covered area is extensive, it is unnecessary to destroy all deployed Trax devices to create a safer path, so only a few bullets are needed to invalidate them.\n\nTo address this, we plan to increase the damage dealt per second. This adjustment will make them more intimidating, prompting defenders to ensure that the path is clear before proceeding. With the new damage output, crossing the area will cost 45 hp, which should encourage defenders to play more cautiously and give attackers more time to react. We remain open to further adjustments if this value does not meet our expectation in practice.\n\n#### TRAX STINGERS\n\n- Damage: Increased to 15hp per second in movement (from 10).\n\n### MELUSI\n\nThe Magnified Scope has notably enhanced her efficiency in combat scenarios, even outperforming other operators with the MP5. Despite her being a 3-armor like Doc and Rook, we consider that she should be more focused on utility usage. Additionally, the introduction of other operators who can fulfill a similar role in a more flexible manner, such as Fenrir, has diminished her utility.\n\nThe proposed adjustments are designed to reduce her killing potential while expanding her contribution to team strategy. The additional resources will help her cover more space or double down in locations that might need more attention. Furthermore, the introduction of a secondary shotgun is intended to foster creativity and versatility preparing the defensive setup.\n\n#### BANSHEE SONIC DEFENSE\n\n- Max. resources: Increase to 4 (from 3).\n\n#### LOADOUT\n\n- MP5: Removed Magnified Scopes from sights options.\n- Secondary weapons: Added ITA12S.\n\n### WAMAI\n\nWhile the MP5K statistics do not currently raise immediate concerns, on the contrary, its efficiency went almost back to pre-Acog levels by the end of Season 1. The rising presence presents a pattern that can remind of past experiences with other operators, such as Alibi, Oryx, and Warden. While these operators weren't overwhelmingly overpowered in terms of stats, their significant presence - specifically the motivation to pick them - was perceived negatively, leading to concerns about game balance. In light of these considerations, we have decided to remove the Magnified Scope.\n\n#### LOADOUT\n\n- MP5K: Removed Magnified Scopes from sights options.\n\n* * * * *\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 7,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6dN3Cvhf3lyZO52nAgcRuQ/y9s23-designers-notes",
    "date": "2024-07-24T13:00:00.000Z"
  },
  {
    "id": "2EijZUDfWQQhiy68cGhhBD",
    "title": "Y9S2.2 Patch Notes",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y9S2.2!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/27hhh43r3tvngQsKQjdaEL/5318fce56af3c92b1e0528225ecb3cde/NEWS_PATCHNOTES_Y9S2_960x540.jpg",
    "content": "Here you can find the updates and fixes for the Y9S2.2 patch.\n\n# Y9S2.2 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 1.26 GB\n- Steam: 857 MB\n- Xbox One: 1 GB\n- Xbox Series X: 1.4 GB\n- PlayStation 4: 1.46 GB\n- PlayStation 5: 1.28 GB\n\n# BUG FIXES\n\n## GAMEPLAY\n\nFIXED - Deadzone sensitivity doesn't apply calibration properly.\n\nFIXED - Operators can melee through Shields.\n\n## LEVEL DESIGN  \n\nFIXED - Drones can clip inside the wall located in EXT Valley on the Border map.\n\n## OPERATORS\n\nFIXED - Ying's Candela ability has a low level of detail when held close to the operator.\n\n## USER EXPERIENCE\n\nFIXED - Drone's red scan ping doesn't display on Player's UI during preparation phase.\n\nFIXED - Dynamic play button text for Matchmaking is duplicated in the upper-left corner.\n\nFIXED - Some reticules for OTs-03 aren't affected by optic color and opacity changes.\n\nFIXED - Players can accept invites to ongoing custom online sessions.\n\nFIXED - \"Unlock with operator Specialties\" option is available after unlocking a pathfinder Operator with renown.\n\nFIXED - Hiding completed challenges can't be toggled by selecting the box under the Challenges tab.\n\nFIXED - Players can't scroll through the Battle Pass after accessing the Challenges tab.\n\n## AUDIO\n\nFIXED - Missing SFX when drones are destroyed while in support mode during the end of the round.\n\n## KNOWN ISSUE [PC]\nDue to a security update some third-party applications that interact with Siege may cause a crash on start-up.\n\nWe recommend temporarily disabling such applications until updated versions are released.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2EijZUDfWQQhiy68cGhhBD/y9s22-patch-notes",
    "date": "2024-07-09T09:15:00.000Z"
  },
  {
    "id": "6WJt2qa45vHi0ST01V6vgJ",
    "title": "Y9S2.1 Patch Notes",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y9S2.1!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7rMXvWW5nDUvZ7x3tZPkO/a7f3fed908df1b8b9abeaacee65096d3/PATCHNOTES_Y9S2_960x540.jpg",
    "content": "# Y9S2.1 PATCH SIZE\n\nFind the download sizes for each platform below.\n-   Ubisoft Connect: 1.05 GB\n-   Steam: 1.6 GB\n-   Xbox One: 0.8 GB\n-   Xbox Series X: 1 GB\n-   PlayStation 4: 1.29GB\n-   PlayStation 5: 887 MB\n\n# BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Aiming down sight is cancelled when opening the scoreboard.\n\nFIXED - Reflex C reticle isn't centered on the Bearing 9.\n\nFIXED - Player's movement speed remains reduced if they reload while aiming down sight.\n\nFIXED - Players can eliminate more targets than what's needed in Target Drill on the Kafe Dostoyevsky map.\n\nFIXED - Claymores reappear after being destroyed by Electrified Barbed Wire.\n\n### LEVEL DESIGN\n\nFIXED - Drones can be hidden in the floor located at 2F Elevator Shaft on the Bank map.\n\nFIXED - Players are able to navigate on top of invisible collision located at EXT Docks Bridge on the Kanal map. \n\nFIXED - Flickering textures are present near ledges and on certain objects after destroying barricades when launching the Vulkan executable.\n\nFIXED - Grey carpets are difficult to destroy in 3F Cigar Balcony and 3F Cigar Lounge on the Kafe Dostoyevsky map.\n\nFIXED - Grey Carpets are difficult to destroy in 2F Pink Room on the House map.\n\n### OPERATORS\n\nFIXED - Players can use Ram's BU-GI Auto Breacher to reach unintended areas.\n\nFIXED - Smoke Screen becomes bulletproof when using Sens' R.O.U. Projector System.\n\nFIXED - Flores' RCE-Ratero Charge loses connection if any elimination is displayed while using the drone.\n\n### USER EXPERIENCE\n\nFIXED - Operator Voucher is missing in the new Battle Pass tab.\n\nFIXED - SEC and SINGLESHOT labels are overlapping other text in the Detailed Weapon Stats.\n\nFIXED - Tutorial rewards alert appears twice after completing the first tutorial.\n\nFIXED - Content disappears when backing out of rewards under the Battle Pass tab.\n\nFIXED - Placeholder text present in the headlines of the live version of the Patch Notes page.\n\nFIXED  - Default attachment skins can be added to favorites through the Operator album.\n\nFIXED - Scrolling with mouse wheel is unavailable in multiple customization menus.\n\nFIXED - Discount does not apply in Pack Manager.\n\nFIXED - Boot Camp universal attachment skin is unavailable for some weapons.\n\nFIXED - \"A Voucher is waiting\" modal is displayed near the end of the season when all operators have been unlocked.\n\nFIXED - Shield skins are missing from bundle content under the Shop tab.\n\nFIXED - The Universal attachment skin \"Lifeblood Flower\" isn't available for Glaz's OTs-03.\n\nFIXED - Various UI issues.\n\n### AUDIO\n\nFIXED - SFX for firing weapons persists after the end of the round.\n\nFIXED - Weapon firing SFX infinitely loops when operator is eliminated while downed.\n\n* * * * *\n\nFollow us and share your feedback on [Twitter](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 3,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6WJt2qa45vHi0ST01V6vgJ/y9s21-patch-notes",
    "date": "2024-06-20T09:15:00.000Z"
  },
  {
    "id": "gm4uKyZfhp7hzSrRe5THP",
    "title": "Y9S2 PATCH NOTES ADDENDUM",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y9S2!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5EOvbV2xHlBTwnmqaJkHcj/8e7e27523cf19d63b73976ac02e48928/PN_ADDENDUM_Y9S2_960x540.jpg",
    "content": "Here you can find the updates and fixes made over the course of the Y9S2 Season Test Server.\n\n## Y9S2 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n- Ubisoft Connect: 3.45 GB\n- Steam: 2.8 GB\n- Xbox One: 3.19 GB\n- Xbox Series X: 3.56 GB\n- PlayStation 4: 3.64 GB\n- PlayStation 5: 3.29 GB\n\n## PLAYER COMFORT\n\nDue to a last minute bug, the following feature was pushed back to a further season.\n\n__RAPPEL IMPROVEMENTS__\n\n- Rappel is now instant and can be entered from further away when holding the rappel input and sprinting towards a rappel point.\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Players are able to eliminate more targets than the Target Drill objective states during Map Training.\n\nFIXED - Enemies aren't pinged when they are scanned by Observation Tool during an AI Bot match.\n\nFIXED - Tutorial's flow can't be completed as the dummy can't be scanned on the \"Maintain 'scan button' to scan an enemy\" objective during the Attack tutorial.\n\nFIXED - Tutorial's flow can't be completed as the \"Find all opponents by scanning them\" can't complete the objective during the Defense tutorial.\n\nFIXED - Talon-8 Clear Shield remains in her hand if it is destroyed when picked up.\n\nFIXED - Points aren't lost if Operators destroy their own devices.\n\nFIXED - Barriers aren't destroyed if walls are reinforced with Azami's Kiba Barrier.\n\nFIXED - AI Bots get stuck in basement of the memorial room on the Clubhouse map in Versus AI mode.\n\nFIXED - Operator UI is improperly displayed when a scan is used before the preparation phase timer ends.\n\nFIXED - AI bots that are downed move faster than normal in Versus AI mode.\n\nFIXED - Operators don't receive electrical damage when downed if they leave and re-enter the electrified area.\n\nFIXED - Shield damage animation is missing from Suppressive Fire effect.\n\nFIXED - Players can't complete Basics Tutorial if they restart in the middle of training.\n\n### LEVEL DESIGN      \n\nFIXED - Players are able to hide a drone in the ceiling vent located in Red Stairs 2F on the Kanal map.\n\nFIXED - Players can get stuck between two wood stacks located at EXT Garage on the Kanal map.\n\nFIXED - Players can clip through an archway located at EXT Crash Scene on the Border map.\n\nFIXED - Players can get stuck between the door and the fence located at EXT Warehouse on the Clubhouse map.\n\nFIXED - Unfair lines of sight are present through the gaps in the tractor cabin located at 1F Garage of the stadium map.\n\nFIXED - Window reflection isn't accurate on exterior windows of the Tower map.\n\nFIXED - Destructible walls don't break as intended when destroyed with explosives on the Chalet map.\n\nFIXED - Players have an unintended line of site for spawn eliminations in B Garage on the Consulate map.\n\nFIXED - Operators levitate when laying prone on top of a sofa in 1F Sunrise bar on the Stadium map.\n\nFIXED - Players have an unintended line of sight to EXT Parking on the Consulate map by running out from B Yellow Stairs to EXT Courtyard.\n\nFIXED - Echo's Yokai Drone can see through textures on the ceiling on 2F Party Room on the Outback map.\n\nFIXED - Echo's Yokai drone can get stuck behind a washing machine in B Laundry Storage on the Oregon map.\n\nFIXED - Sens' R.O.U. Projector System gets stuck underneath some barricades instead of rolling through them in multiple locations on multiple maps.\n\nFIXED - Throwable and sticky devices have no collision with a Christmas tree stand in 1F VIP Room on the Kafe Dostoyevsky map.\n\nFIXED - Players are able to navigate onto vending machines located at 2F Break Room of the Border map.\n\nFIXED - Players are able to navigate onto the vending machines located at 1F Tellers on the Border map.\n\nFIXED - Smoke's Remote Gas Grenade can't be retrieved if thrown between a wall and weapon case in 1F Armory on the Lair map.\n\nFIXED - Maestro's Evil Eye can be placed in an unintended spot in 2F Office on the Chalet map.\n\nFIXED - Defenders can get an unfair advantage on top of a forklift located in B Barrels on the Lair map.\n\nFIXED - Players get stuck between a fence and crated in Damage Lane on the Shooting Range map.\n\nFIXED - Players can reach an advantageous line of sight in 2F Meeting Room on the Consulate map.\n\nFIXED - Players are able to vault onto a chandelier in 2F Mezzanine on the Outback map.\n\nFIXED - Various collision, asset, and texture issues on maps.\n\n### OPERATORS\n\nFIXED - Players can get stuck in 1st person point of view after detonating Flores' RCE-RATERO Charge.\n\nFIXED - Brava's Kludge Drone can hack more devices than intended if players cancel the hack while holding down the shoot button on controller.\n\nFIXED - Grim's Kawan Hive can affect Vigil permanently if Vigil's ERC-7 is used while leaving and entering the area of effect multiple times.\n\nFIXED - Ram isn't displayed in the Operator Selection phase if the player does not own the operator.\n\nFIXED - Tubarao's headgear and uniform thumbnail is displayed instead of Deimos.\n\nFIXED - Tubarao's default headgear uniform appearance is displayed as Deimos.\n\nFIXED - Osa's Talon-8 Clear Shield doesn't protect from flash effects.\n\nFIXED - Deimos' hands are misaligned with the .44 Vendetta when switching weapons while sprinting.\n\nFIXED - Ying's Candela shows a throw trajectory previsualization when deploying the device onto a surface.\n\nFIXED - Deployable devices can be deployed on Alibi's Prisma Holograms.\n\nFIXED - Amaru's Garra Hook can be used on the roof of EXT Range Terrance on the Lair map.\n\nFIXED - Fenrir's F-NATT Dread Mine doesn't react properly if hacked by Brava's Drone while active.\n\nFIXED - Demios' DeathMARK charge is not refunded if Opponents are in a state that deactivates the DeathMARK at the end of the countdown.\n\nFIXED - Fenrir's F-NATT Dread Mine gives back more tickets than what is used if players overlap mines and quickly switch to a deactivated mine while activating another.\n\n### USER EXPERIENCE\n\nFIXED - Wrong stats for shield during pick phase.\n\nFIXED - Missing shield stats when hovering over ready button while playing as a shield Operator.\n\nFIXED - 6 bullets are listed for all destruction types in the advances weapon stats screen.\n\nFIXED - Aiming down sight time isn't reduced with the Iron Sight.\n\nFIXED - The weapon stats are compared to themselves when players select Ready in prep phase. Incorrect weapon stats comparisons are displayed when players select ready in the preparation phase.\n\nFIXED - When a player-operator Observation Tool is destroyed while someone in support mode is watching, the static VFX persist across all Observation Tools for the support-mode player.\n\nFIXED - Extra UI element is present at the top left of the screen while selecting an Operator during the Planning Phase.\n\nFIXED - The scrollbar does not appear in the Locker after reaching 4th rows of items.\n\nFIXED - Animation issue when exiting rappel while carrying the hostage.\n\nFIXED - Missing image for Versus AI Update notification.\n\nFIXED - AI Bot animations break if Bots quickly change direction or leave a position on the Nighthaven Labs map.\n\nFIXED - Operator animations break when players move too close to certain objects on the Herford Base map during Snipers game mode.\n\nFIXED - Operator animations break when players take the stairs in EXT East Spawn on the Stadium map. \n\nFIXED - Missing Advanced weapon stats on GONNE-6. \n\nFIXED - Aiming Down Sight Time and Reload Speed comparison colors are switched up when comparing weapons.\n\nFIXED - The horizontal gauges for Damage, Fire rate, Magazine and Max capacity used for easier comparison between weapons are only either empty or full, with no values shown in between.\n\nFIXED - The text \"time needed to aim\" and \"6 bullets needed\" in shooting record is blurry.\n\nFIXED - Crash to desktop when selecting \"Options\" for certain returning players.\n\nFIXED - The Return Home button from the Tutorial Rewards modal has no functionality.\n\nFIXED - If the resolution is set to higher than the monitor's native resolution, the Monitor and Resolution tabs will lose functionality.\n\nFIXED - Various UI issues.\n\nFIXED - Various Match Replay issues.\n\nFIXED - Various spectator mode issues.\n\nFIXED - Various localization issues.\n\n### AUDIO\n\nFIXED - Mono audio output doesn't combine the audio into a single stream.\n\nFIXED - Mozzie's Pest Launcher hack SFX plays twice after the player loses control of the drone.\n\nFIXED - Missing audio when players drop down a hatch while prone.\n\nFIXED - Missing SFX for Solis' SPEC-IO Electro-Sensor if player is eliminated when activated.\n\nFIXED - Missing SFX for Nitro Cell when thrown onto indestructible surfaces between walls.\n\nFIXED - Various audio issues.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 8,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/gm4uKyZfhp7hzSrRe5THP/y9s2-patch-notes-addendum",
    "date": "2024-06-11T09:15:00.000Z"
  },
  {
    "id": "37JG1hfORvqyMbMR0IM5Jy",
    "title": "Y9S2 Streamer Charms",
    "abstract": "New Rainbow Six Siege Streamer Charms for Y9S2!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3lbyJ92PcRzJysfyQUwnPH/4119dd9b0f679e0f9134a28d577f2409/Y9S2_STREAMER_CHARMS_960x540.jpg",
    "content": "## Announcing the next Streamer Charms!\n\nEach season will bring the release of new charms, as well as the return of streamer charms from previous seasons!\n\n## New\n\n![[R6S] Y9S2 Streamer Charms - thumbnail](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3lbyJ92PcRzJysfyQUwnPH/4119dd9b0f679e0f9134a28d577f2409/Y9S2_STREAMER_CHARMS_960x540.jpg)\n\n[Skyte](https://www.twitch.tv/skyte)\n[Anifex](https://www.twitch.tv/anifex)\n[ru_rumiiiin](https://www.twitch.tv/ru_rumiiiin)\n\n## Returning\n\n![[R6S] Y9S2 Streamer Charms - 1](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/12HmmMU7CQ5ysPoi9UpB5q/815cb00b6b30080bc56db846341ea25a/Y9S2_Streamer_Charms_Updated_01.jpg)\n\n![[R6S] Y9S2 Streamer Charms - 2](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6vjHwpG8CgH1JXE6v6IiVX/34797b610b1e03e4a838e0ca0fb471da/Y9S2_Streamer_Charms_Updated_02.jpg)\n\n![[R6S] Y9S2 Streamer Charms - 3](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/Bj4hM1NiNMtXcmie7iU3U/5dac983b3ec54db7be5d8eb147d938fe/Y9S2_Streamer_Charms_Updated_03.jpg)\n\n![[R6S] Y9S2 Streamer Charms - 4](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/5fgTgf0vXoyxzxdM8rkzS9/33133d75673eb5ada114ec17808c5804/Y9S2_Streamer_Charms_Updated_04.jpg)\n\n![[R6S] Y9S2 Streamer Charms - 5](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6Loqw4DVZzE0trvtjTXaRY/eae04a6a54fb005c7865a86b28802321/Y9S2_Streamer_Charms_Updated_05.jpg)\n\n[Alfredoplays](https://www.twitch.tv/alfredoplays)\n[AnneMunition](https://www.twitch.tv/annemunition)\n[Beaulo](https://www.twitch.tv/beaulo)\n[Bighead](https://www.twitch.tv/bighead033)\n[BikiniBodhi](https://www.twitch.tv/bikinibodhi)\n[Bnans](https://www.twitch.tv/bnans)\n[Braction](https://www.twitch.tv/bractionfps)\n[Drid](https://www.twitch.tv/dridgg)\n[FastAnne](https://www.twitch.tv/fastanne)\n[Gabbo](https://www.twitch.tv/gabbodsq)\n[Heideltraut](https://www.twitch.tv/heideltraut)\n[Interro](https://www.twitch.tv/interro)\n[JerichoFive](https://www.twitch.tv/jerichofive)\n[JessGOAT](https://www.twitch.tv/jessgoat)\n[Jynxzi](https://www.twitch.tv/jynxzi)\n[Just9n](https://www.twitch.tv/just9n)\n[KingGeorge](https://www.twitch.tv/KingGeorge)\n[KittyR6](https://www.twitch.tv/kitty_r6)\n[LagonisR6](https://www.twitch.tv/lagonis)\n[Lil_Lexi](https://www.twitch.tv/lil_lexi)\n[Lt Custard](https://www.twitch.tv/lt_custard)\n[Lusorkoeffizient](https://www.twitch.tv/lusorkoeffizient)\n[MacieJay](https://www.twitch.tv/MacieJay)\n[Mag6](https://www.twitch.tv/mag6)\n[M3ry](https://www.twitch.tv/m3ry)\n[Matimi0](https://www.twitch.tv/matimi0)\n[MrBboy45](https://www.twitch.tv/mrbboy45)\n[Narcoleptic Nugget](https://www.twitch.tv/narcolepticnugget)\n[Nesk](https://www.twitch.tv/neskwga)\n[PaladinAmber](https://www.twitch.tv/paladinamber)\n[Patife](https://www.twitch.tv/patife)\n[Pengu](https://www.twitch.tv/pengu)\n[RazaH](https://www.twitch.tv/razah)\n[REMGURI / 렘쨩](https://www.twitch.tv/remguri)\n[Rubsarb](https://www.twitch.tv/Rubsarb/)\n[SexyCake](https://www.twitch.tv/smexycake)\n[Sha77e](https://www.twitch.tv/sha77etv)\n[Shorty](https://www.twitch.tv/shortyyguy)\n[shroud](https://www.twitch.tv/shroud)\n[SilphTV](https://www.twitch.tv/silphtv)\n[Tatted](https://www.twitch.tv/tatted)\n[Tranth](https://www.twitch.tv/tranth)\n[Varsity](https://www.twitch.tv/varsitygaming)\n[WhiteShark67](https://www.twitch.tv/whiteshark67)\n[yo_boy_roy](https://www.twitch.tv/yo_boy_roy)\n[z1ronic](https://www.twitch.tv/zironicdk)\n[Zander](https://www.twitch.tv/zander)\n[ziGueira](https://www.twitch.tv/zigueira)\n[GarfieldIsDoc](https://www.twitch.tv/garfield)\n[Supr](https://www.twitch.tv/supr)\n[RyyFyy](https://www.twitch.tv/ryyfyy)\n[FoxA](https://www.twitch.tv/foxa_r6)\n[Nerdengenheiro](https://www.twitch.tv/nerdengenheiro)\n[Rainbow6itacom](https://www.twitch.tv/rainbow6itacom)\n[Minimichegga](https://www.twitch.tv/minimichegga)\n[JostRekt](https://www.twitch.tv/jost)\n[JustRyuk](https://www.twitch.tv/justryuk)\n[Paluhh](https://www.twitch.tv/paluhh)\n[Poxonlox](https://www.twitch.tv/poxonlox)\n[TheLionerYT](https://www.twitch.tv/thelioneryt)\n[itsSpoit](https://www.twitch.tv/itsspoit)\n[Retalha](https://www.twitch.tv/retalha)\n[FooYa](https://www.twitch.tv/fooya)\n[IceCold](https://www.twitch.tv/icecold)\n[Athieno](https://www.twitch.tv/athieno)\n[Marciu](https://www.twitch.tv/marciu)\n[Rembeey](https://www.twitch.tv/reembey)\n[rasco100](https://www.twitch.tv/rasco100)\n[Vetelcito01](https://www.twitch.tv/vetelcito01)\n[OneShooter](https://www.twitch.tv/oneshooter)\n[Scythe](https://www.twitch.tv/scythe)\n[Jenz](https://www.twitch.tv/jenz)\n[Frankystrings](https://www.twitch.tv/frankystrings)\n[Eternal_regina](https://www.twitch.tv/eternal_regina)\n[Pxppy](https://www.twitch.tv/eternal_regina)\n\n## Program Update\n\nWe have implemented additional screening procedures into our selection process for streamer charms.\n\nUpon selection for the program, streamer charm candidates' main and alt accounts are now screened for MouseTrap violations, in addition to the other screening steps they undergo for eligibility.\n\n## How to acquire charms\n\nThese charms are only available by subscribing to the respective streamer's Twitch channel with a linked Ubisoft account. For more information on how to link your Ubisoft and Twitch account, as well as opt in for Twitch Drops, please refer to [this FAQ](https://support.ubi.com/Faqs/000035432/Get-your-Twitch-Streamer-s-charm).\n\n## How to get involved\n\nWe are always on the lookout for content creators that inspire and enrich the Siege community. If you would like access to the perks of being a partnered content creator, and your goal is to one day have a charm in the game, we would like to invite you to apply to the [Ubisoft Creators Program](https://creatorsprogram.ubisoft.com/en-us).\n\nFrom there, complete the following steps:\n\n1. Connect your Ubisoft Account. If you do not have one, you can create one [here](https://connect.ubisoft.com/create).\n2. Agree upon the eligibility criteria.\n3. Connect your primary channel or secondary channels.\n4. Indicate your games preferences.\n5. Set your location, broadcast language, and communication language.\n\nYour application will then be submitted and must be approved by Ubisoft. An email will be sent to confirm your participation.",
    "categories": [
      "rainbow-six-siege",
      "community"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/37JG1hfORvqyMbMR0IM5Jy/y9s2-streamer-charms",
    "date": "2024-06-07T15:00:00.000Z"
  },
  {
    "id": "2L0bFvjA80swkS4EvawujB",
    "title": "Y9S2 Designer’s Notes",
    "abstract": "In this latest edition of Designer’s Notes, we'll go into more detail about the balancing changes that’ll come with the Y9S2 update and give you some insight into the reasons behind them.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4XTCMqY253k9McDTsVFXsO/f3f4a692737484853a48909c4f9b24fc/R6S_Y9S2_DN_960x540.jpg",
    "content": "In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y9S2 update and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n## WIN DELTA VS. PRESENCE\n\n![[R6S] Y9S2 Designer's Notes - R6S_DN_Y9S2_BalancingMatrix_Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4woqjpEU0vKxjgxZHrgQAa/ca6612a979340b15869bcc0be50bce04/R6S_DN_Y9S2_BalancingMatrix_Att.mp4)\n\n![[R6S] Y9S2 Designer's Notes - R6S_DN_Y9S2_BalancingMatrix_Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2faUsAId6AYaUjiZlMOnjV/50d84dda86927ade5c22c9485fd3caa7/R6S_DN_Y9S2_BalancingMatrix_Def.mp4)\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n# OPERATOR BAN RATE\n\n![[R6S] Y9S2 Designer's Notes - R6S_DN_Y9S2_BanMatrix_Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6bqc29y0gteyJ7iJZrTSd4/f43bd207c1711972fca7a36232dc0f65/R6S_DN_Y9S2_BanMatrix_Att.mp4)\n\n![[R6S] Y9S2 Designer's Notes - R6S_DN_Y9S2_BanMatrix_Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4wP4XygCaLDeSskeF9mHhR/fe000779fca9c8a22efec53a0c6c1506/R6S_DN_Y9S2_BanMatrix_Def.mp4)\n\n## OPERATOR BALANCING\n\n* * * * *\n\n### STRIKER\n\nWe recognize the delicate position of the Recruit Operator. While we have always wanted them to be playable and enjoyable in serious matches without being a meme, their potential had to be carefully managed due to the ability to have multiple Recruits on the same team. Additionally, the Recruit served as a safeguard for various systems, which meant that remastering it required also updating those systems.\n\nOur goal is to ensure that players have meaningful choices, the same as we did with the new Weapon Attachments; we want to make every gameplay option viable and interesting. Therefore, we have decided to make the remastered Recruits available in all playlists. However, only one can be selected per team, similar to any other Operator. We've updated their 3D models to help differentiate them during matches, and their loadouts are now fully customizable. As they remain excellent options for learning Siege's mechanics, they will be automatically unlocked for free at level 0.\n\nWe appreciate their versatility in team compositions, so we wanted to enhance this concept. Instead of splitting Secondary Gadgets between Ability and Gadget slots, they will now have access to every secondary utility from their faction in both slots. This flexibility allows for more strategic loadouts. However, using the same gadget in both slots is not allowed. For example, if you select Breach Charges in the Ability slot, you cannot select it again in the Gadget Slot.\n\nThis new approach also means that whenever we introduce a new Secondary Gadget, one of them will receive a buff and expand its tactical possibilities. Our guiding principle is that no Secondary Gadget should surpass an Operator's unique Ability, so more specialized Operators will always remain the most efficient choice.\n\nStriker, in particular, stands out as a versatile support on attack. You can assist Thermite with Impact EMP Grenades for breaching walls while using Hard Breach Charges to open the remaining hatches. Alternatively, protect your teammates by placing Claymores to block flanks and Smoke Grenades to control lines of sight. Or even take on the entry role with Frag Grenades and Stun Grenades while your team does the hard work.\n\n#### BASE STATS\n\n- Armor: 2\n\n- Speed: 2\n\n#### GADGET KIT (ABILITY)\n\n- Equips two gadgets instead of a gadget and an ability. Can select any attacking gadget on the team, but not the same twice.\n\n#### LOADOUT\n\n- Primary weapons: M4, M249\n\n- Secondary weapons: 5.7 USG, ITA12S\n\n### SENTRY\n\nSentry serves as the defensive counterpart to Striker. Their primary objective is to assist with site setup and provide any missing utility. If you require additional intel, consider bringing a Bulletproof Camera and Proximity Alarms. For enhanced map control, opting for a Deployable Shield and Barbed Wire would be more ideal.\n\nBASE STAT\n\n-   Armor: 2\n-   Speed: 2\n\nGADGET KIT (ABILITY)\n\n-   Equips two gadgets instead of a gadget and an ability. Can select any defensive gadget on the team, but not the same twice.\n\n#### LOADOUT\n\n-   Primary weapons: Commando 9, M870\n-   Secondary weapons: C75 Auto, Super Shorty\n\n### FENRIR\n\nOur main goal is to provide Attackers with additional methods and opportunities to effectively handle the deployed mines while enhancing a more strategic environment without negating Fenrir's anti-rush capabilities.\n\nThe intention is to create an environment where Attackers feel less overwhelmed by Fenrir's presence. To achieve this, we have expanded the ways to counter the mines. Proper droning will be rewarded, allowing players to clear the mines progressively, whether they are active or not.\n\nFenrir's effectiveness will now be closely tied to the deployment type and gadget size, rather than relying mainly on bulletproof capacities. Similar to other devices, ensuring that the mines are discreet and strategically placed increases their effectiveness and survivability through the round. Additionally, the Observation Blocker will help Fenrir keep their location more challenging to discover. This will also reduce Fenrir's crowd control capabilities at the same time as it will replace the Barbed Wire.\n\nFenrir's utility now hinges on his survival. We encourage calculated risks and active engagement with the gadget. The new ticket system and adjusted number of resources require constant attention. Fenrir won't be capable of covering all the flanks and will need to react to the attackers' push to be efficient and capitalize on his utility. This updated behavior will also reduce the entry barrier for new players because you are not double-punished by a wrong or experimental placement.\n\n#### F-NATT DREAD MINE\n\n-   Max. resources (Mines): Reduced to 4 (from 5).\n-   Max. resources (Tickets): Reduced to 2 (from 3).\n-   An inactive mine is no longer bulletproof.\n-   Tickets are no longer lost when an active mine is destroyed. They will return to Fenrir's inventory.\n-   Disabling a mine automatically gets its ticket removed. They will return to Fenrir's inventory.\n\n#### LOADOUT\n\n-   Secondary gadgets: Added Observation Blocker. Removed Barbed Wire.\n\n### SOLIS\n\nWe have two primary objectives; First we would like to reduce Solis pressure over the attacking drones, specifically during the Preparation Phase. Second we would like to increase the amount of players' attention on SPEC-IO resource management.\n\nSolis has proven highly effective in hunting and neutralizing drones, which are crucial to build a successful Attack strategy. If Attackers cannot reveal the defenders' set up and position their drones inside the building the attack is likely to fail. Our goal is to strike a balance: Solis should remain relevant in this role while Attackers gain additional opportunities to fulfill their droning operations. With this changes Attackers will have less pressure to drone during the prep phase, but they will need to remain careful and aware of Solis during the Action Phase.\n\nAfter some data analysis and observing player behavior we've come to the conclusion that the SPEC-IO resources are too generous. Players usually do not consume all the energy available for the SPEC-IO, and when they do it the wait time until they are back online is quite short. The new SPEC-IO resources setting should encourage players to use the SPEC-IO in shorter bursts rather than keeping them on for long periods of time.\n\nWe also want to reduce a bit Solis' roaming capabilities, specifically her speed while moving through the map. We will replace her Impact Grenades with Proximity Alarms which will give her a new tool to gather intel from long distances. We encourage players to explore less commonly used weapon like the Shotgun ITA12L, adding it to their loadouts will grant Solis is still capable of causing destruction and executing vertical plays.\n\nWe've introduced a set of changes to create a more balanced Solis. However, this isn't her final form! We're closely monitoring the impact of these adjustments while simultaneously developing a fresh wave of changes that will specifically enhance her gadget detection and scanning mechanics. Stay tuned for further improvements.\n\n#### SPEC-IO ELECTRO-SENSOR\n\n- SPEC-IO goggles remain disabled during prep-phase.\n- SPEC-IO energy duration reduced to 10s (from 20s).\n- SPEC-IO needs to fully recharge before using it.\n- SPEC-IO Detection range 12m (from 15m).\n\n#### LOADOUT\n\n- Secondary gadgets: Added Proximity Alarm. Removed Impact Grenades.\n\n### DEIMOS\n\nSince his release, Deimos has had relatively low pick and win rates. While we believe the primary reason for this is his more advanced playstyle, we would like to explore ways to make him a little more comfortable to play.\n\nBy adding grip options to Deimos' AK-74M, we're hoping to make the weapon slightly more viable for his more aggressive support playstyle. However, we will be monitoring this change carefully, as we want to make sure that focus remains on taking full advantage of his DeathMARKs and Vendetta.\n\n#### LOADOUT\n\n-   AK-74: Added Vertical, Angled, and Horizontal grips.\n\n# GADGET BALANCING\n\n* * * * *\n\n## BARBED WIRE\n\nOur primary goal is to enhance the effectiveness of Barbed Wire while increasing the risk of not dealing with it on time.\n\nWe aim to make it more reliable for Defenders. It should no longer be an easily bypassed obstacle for Attackers. Instead of routinely passing through the Barbed Wire, we want it to serve as a last-resort option. Attackers should carefully consider their approach before attempting to cross. The Barbed Wire now inflicts 5hp damage per second to any Attacker moving through it. While this isn't a substantial amount, it should encourage Attackers to respect its presence. Importantly, the damage only occurs while the operator is actively moving within the wire. This means that they can still enter and hold an angle without taking damage.\n\nDefenders should now rely on their hearing to detect Attackers moving through the wire. The operator's vocal reaction upon receiving damage reinforces the urgency of the situation and makes it more reliable. This feedback loop ensures that Defenders can respond promptly.\n\nWhile we are not modifying the distribution of Barbed Wire among Defenders at this time, we will closely monitor its impact. If necessary, we may adjust loadouts in the future.\n\n#### BASE STATS\n\n-   Deals 5hp damage every 1 second when moving inside it.\n-   Wire stiffness increased.\n\n# RANK DISTRIBUTION\n\n* * * * *\n\n![[R6S] Y9S2 Designer's Notes - Rank_Distribution_PC](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3UAH8zYEQvmDMNfpEi2dGU/8d8e5c64fa6969b3b63c086e8c1fcee1/Y9S1_Rank_Distribution_PC.jpg)\n\n![[R6S] Y9S2 Designer's Notes - Rank_Distribution_Console.](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4yZrBz9wwA89IZEGJFL2pD/628ea3fb4b548126915e459c08f67444/Y9S1_Rank_Distribution_Console.jpg)\n\n* * * * *\n\nFollow us and share your feedback on [X](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 9,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2L0bFvjA80swkS4EvawujB/y9s2-designers-notes",
    "date": "2024-05-27T13:00:00.000Z"
  },
  {
    "id": "50c0MbM9IoHbgjV8MeoiA3",
    "title": "R6 Membership Brings Animated Skins & Full Battle Pass Access",
    "abstract": "Rainbow Six Siege Membership is the ultimate Siege offer that delivers a drop of exclusive content every month and gives full access to the Premium Battle Pass.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7oiYlPgr0L9EiSYA3z3Hle/be69f62120afd7a1c54117036f621d6d/R6SIEGE_KeyArt_Membership.jpg",
    "content": "Unlock the ultimate Rainbow Six Siege experience with the R6 Membership! This offer delivers an exclusive drop of content every month, including a time-limited Legendary item (sometimes animated for extra flair), an Epic operator bundle, full access to the premium Battle Pass, 10x Battle levels, and a Bravo pack totaling over 4500 credits of value monthly.\n\nEnroll between June 11<sup>th</sup> and June 18<sup>th</sup> to take advantage of the one-time early adopter bonus! Receive an additional Ash epic bundle and 600 credits as a special thank you for joining early.\n\nFor a nominal monthly cost or save more with the 12-month plan, you'll unlock a continuous stream of premium content that keeps your Ops equipped with the best exclusive gear. Join the R6 Membership starting June 11<sup>th</sup> and elevate your Siege experience.\n\nReward Delivery Schedule:\n\n- Upon enrolling you get: Instant Battle Pass access, 10 Battle levels, and 1 Bravo pack\n- Then get a new cosmetic drop containing 1 Legendary item and 1 Epic bundle on the 28<sup>th</sup> of each month (first drop begins June 28<sup>th</sup>)\n- On your monthly renewal date, you'll receive another 10 Battle levels and 1 Bravo pack.\n\nNote: You must log into the game on the platform that you signed up on, each month, to claim the rewards.",
    "categories": [
      "rainbow-six-siege",
      "store"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/50c0MbM9IoHbgjV8MeoiA3/r6-membership-brings-animated-skins-full-battle-pass-access",
    "date": "2024-05-27T09:00:00.000Z"
  },
  {
    "id": "2V90gThNqHBtmzK4Bf6AhV",
    "title": "ANTI-CHEAT STATUS UPDATE – MAY 2024",
    "abstract": "Check out our latest Anti-Cheat Status Update.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3WdapxTy7SQ2SPGmqvN1xF/0cd058692a304e4c5989a5e7cca687c7/Anti-cheat_header_960x540.png",
    "content": "Our latest Anti-Cheat Status Update for May 2024 is here, bringing the latest updates on MouseTrap, the QB System and more!\n\n## TEAM UPDATE\n\nOur Anti-Cheat team is evolving. We're currently restructuring, growing, and allocating more resources to our Anti-Cheat team, ensuring that we can provide a secure future for Siege. As the team expands, we'll have more opportunities to reflect the benefits of this growing team in-game. While we're in this stage, our team remains focused on improving your experience.\n\n## BANS: DATA BANS + BATTLEYE\n\n### BAN NUMBERS\n\nHere we have our latest ban data, including bans for February, March, and April.\n\n![[R6S] ANTI-CHEAT STATUS UPDATE – MAY 2024 - BanChart](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1VO5c6wIwyxqgkEubx0ooN/965e2ac5c7521678f509e9f7c877b169/R6_BanChart_Nov-Apr24.jpg)\n\n### DATA BANS & ADDITIONAL DETECTIONS\n\nThis season marks a significant evolution in our approach to cheating, as we've made improvements to our Data Ban system moving to a machine learning model. We've vastly increased the number of data points used to analyze a player's performance, resulting in a __meaningful increase in cheaters being detected and sanctioned through this method__. We've also optimized our sanctioning process by increasing how often we run our sanctions, effectively __reducing the time it takes to ban detected cheaters by half using this model__.\n\nIn addition to these efforts, we also have new Distributed Denial of Service (DDoS) detections which are currently being used to sanction players. We know that this has been affecting players and we want to make it clear that we are working on identifying behaviors and sanctioning players who are taking advantage of these services.\n\nLooking ahead, we're working on an improved detection of AFK avoiders (idle botters) as well as additional cheat detection updates. These will further enhance our ability to identify and ban cheaters in Rainbow Six Siege, improving the experience for everyone.\n\n## ADDRESSED CHEATS & HARDENING\n\n### ONGOING INVESTIGATIONS\n\n__CHEATING INCREASE__\n\nAs we recently [communicated](https://twitter.com/Rainbow6Game/status/1785686962097005015), we are aware of the increase in cheating behaviors reported by the community. We want to reassure you that addressing these concerns is a top priority for our Anti-Cheat team and that we are looking to deploy solutions to resolve these issues as soon as possible. The Y9S1.3 patch deployed on May 2<sup>nd</sup> has temporarily improved this situation while we work on longer term solutions to prevent those cheats.\n\n__CRASH EXPLOIT__\n\nOur team is actively working on a fix for the Crash Exploit reported by the community. Until then, Abandon Penalties have been retroactively reduced to a 5-minute duration.  All newly issued Abandon Penalties will be 5 minutes as well. Thanks a lot for your reports!\n\n### ADDRESSED CHEATS\n\nSeveral cheats have been addressed since our last Anti-Cheat Status Update, with some updates going live with Y9S1.3. However, in recent months, we have seen a dramatic decrease in a number of rage cheats being used. This reflects the ongoing work that our team is doing in order to tackle new cheats and protect the game and its players.\n\n### HARDENING\n\nHardening is the act of increasing the security and reducing the surface of vulnerability of the game's code, to protect against attackers. In Y9S1.2, we made several changes which resulted in improved overall game security, and we'll have more improvements coming in Y9S2. These improvements are continuous, and our updates are playing a crucial role in making the game safer. We'll be sharing more on our hardening efforts in the future.\n\n## QB SYSTEM\n\nQB is a security system available on PC, designed to make cheat creation more tedious, difficult, and expensive. By creating a less effective environment for cheat creators, our aim is to reduce the amount of cheats being successfully created and sold.\n\n### UPDATE CADENCE & UX IMPROVEMENTS\n\nWe want to ensure that QB remains effective, so as promised, we are continuing to provide regular updates to this system, and these will come at an increased cadence compared to Year 8.\n\nAnother goal of ours is to share more information with legitimate players, helping to understand why a game restart may be happening. Some of these changes are already live; for instance, you may now see the \"Update available\" prompt in-game in some circumstances, asking you to restart the game when possible.\n\n## MOUSETRAP\n\n### CURRENT STATUS\n\nMouseTrap is a system designed to detect spoofing devices which enable the use of mouse and keyboard on consoles. Changes implemented in Y9S1 have broadened its detection capabilities, allowing us to find more suspicious players.\n\nThis season, we are also focusing on your feedback, with most changes being aimed towards enhancing our current system. The Y9S1.3 update is helping to further increase the accuracy of MouseTrap by expanding on the types of devices that it can recognize, and improving the detection of currently identifiable devices. As well as this, the update is working to further minimize false positives, resulting in fewer controller players being incorrectly detected.\n\n### MOUSETRAP PENALTIES & MATCHMAKING [TARGET: Y9S4]\n\nIn Y9S4, we'll be making use of MouseTrap's detection in new ways, directly improving the experience for controller players. In this upcoming Y9S4 update, if a player is detected using a spoofing device three times,the updated Crossplay system will __automatically place them into the PC matchmaking pool__ for a 90-day period. This will result in matches that feel fairer for controller players, while giving users of the spoofing devices a choice in how they want to play the game.\n\n## CONCLUSION\n\nIn conclusion, our dedication to upholding the integrity and fairness of Rainbow Six Siege is unwavering. Our goal this year is to make Rainbow Six Siege both more secure and more reactive when it comes to cheating. Through a multifaceted approach, encompassing machine learning and Data Bans, rigorous hardening, and innovative detection systems such as QB and Mousetrap, we are continuously following up on our commitment to safeguarding the gaming experience for all players.\n\nCheaters have no place in Siege, our teams are committed to making Siege safe and enjoyable for everyone.",
    "categories": [
      "rainbow-six-siege",
      "anti-cheat",
      "dev-blogs"
    ],
    "readTime": 6,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2V90gThNqHBtmzK4Bf6AhV/anticheat-status-update-may-2024",
    "date": "2024-05-10T15:30:00.000Z"
  },
  {
    "id": "4Xwna9dWPwd3m4KUcGrHIp",
    "title": "Y9S1 Mid-Season Roadmap Update",
    "abstract": "See the upcoming features detailed in this mid-season roadmap update.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4w3HMFvz9ZPOXFZs41XU7s/38693eb4c14d1e212d53f987b25c0915/Y9S1_Roadmap.jpg",
    "content": "Each season, we provide a Roadmap update to offer further insights into the development of upcoming features to ensure transparent communication with all players. Each update and decision we make takes into account various elements such as player feedback, time allocated to ensure the quality of the features delivered, and more.  \n\nWith that in mind let's delve into this mid-season Roadmap update!  \n\n![[R6S] Y9S1 Mid-Season Roadmap Update y9 roadmap](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/28khzDs7VSyg7mM19oLalN/f98078c7e6d69bddc7324accb52fc9b0/roadmap.jpg)\n\n# ROADMAP UPDATES\n\n### [MAIN FEATURE] SIEGE MARKETPLACE\n\n- __Status: confirmed for Y9S2__\n\nSince its Beta launch, many of you have been engaging in buying and selling some of your favorite items with other players in the Siege Marketplace. With the upcoming Season 2, we are pleased to confirm that the Siege Marketplace will be fully launched and available for all players to use! \n\n### [PLAYER PROTECTION] STEAM IMPROVED BAN ENFORCEMENT (Part 1)\n\n- __Status: Part 1 confirmed for Y9S2__\n\nAs announced during the Year 9 Reveal Panel, we are doubling down on our efforts to address cheating in Siege. In Season 2, we will be focusing on a first iteration of an improved ban enforcement measure on Steam (PC), making it more difficult for cheaters to return to the game once banned. As this will be a new addition to our anti-cheat ecosystem, we are breaking down the feature into several iterations, with the first part scheduled for Season 2.  \n\n### [BALANCING] FENRIR & SOLIS UPDATE\n\n- __Status: Confirmed for Y9S2__\n\nOperator balancing is crucial to maintaining the competitiveness of Siege. As previously hinted, we have focused on the Defense side and will introduce Operator balancing updates to both Fenrir and Solis (Part 1) in the upcoming Season. The second part of Solis' update is currently scheduled for Season 3.\n\n### [NEW!][TRAINING] MAP TRAINING PLAYLIST\n\n- __Status: Confirmed for Y9S2__\n\nIn Season 2, significant updates will be introduced to Map Training. Newly added to the Year 9 Roadmap, the \"Endless Drill\" mode will be introduced to the Map Training playlist. Other announced presets and an additional set of maps are also confirmed for the new season.\n\n### [MAJOR FEATURE] MAP FILTERS IN STANDARD PLAYLIST\n\n- __Status: Confirmed for Y9S2__\n\nHaving more control over which maps you play has been a longstanding community request, which is why a new filtering feature will make its debut in the Standard Playlist. Map presets will be available in the menu, and will allow you to select your preferred maps.\n\n### [MAJOR FEATURE] REPUTATION SYSTEM\n\n- __Status: New target delivery: Y9S4__\n\nWe are continuously working on improving the Reputation System based on the feedback you have shared with us. Therefore, we have decided to keep this system in Beta phase until Season 4, allowing us to make necessary adjustments to enhance your experience in terms of transparency, effectiveness and overall fairness of the system.\n\n### [PLAYER COMFORT] AFTER-ACTION SCREEN 2.0\n\n- __Status: New target delivery: Y9S3__\n\nFor Player Comfort, the After-Action Screen will receive further updates this season and is currently scheduled for release in Season 3. With this feature, we aim to provide an accurate and insightful recap of each match of Rainbow Six Siege. \n\n### FULL REVEAL\n\nStay tuned for the Year 9 Season 2 Reveal coming up on Sunday, May 26th, at 5PM BST / 9AM PT / 12:00PM ET / 6PM CET. \n\n---\n\nJoin the discussion on [Twitter](https://twitter.com/Rainbow6Game), [Instagram](https://www.instagram.com/rainbow6game/), [Discord](https://discord.gg/rainbow6),  [Reddit](https://www.reddit.com/r/Rainbow6/), [Facebook](https://www.facebook.com/Rainbow6/), and [TikTok](https://www.tiktok.com/@rainbow6game). Check out the [roadmap](http://rainbow6.com/roadmap) for more information on all the features you can expect during Year 9.",
    "categories": [
      "game-updates"
    ],
    "readTime": 4,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/4Xwna9dWPwd3m4KUcGrHIp/y9s1-midseason-roadmap-update",
    "date": "2024-05-06T16:11:00.000Z"
  },
  {
    "id": "6ZsfBMeGT0Anuu0IHjDQ0P",
    "title": "Y9S1.3 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y9S1.3!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6mPtuvqgzKdHokQNmIzay3/430a42055130bfd938a1bae12a627cfc/Y9S1.3_PatchNotes.960x540.jpg",
    "content": "## Y9S1.3 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n-   Ubisoft Connect: 935 MB\n-   Steam: 860 MB\n-   Xbox One: 1.1 GB\n-   Xbox Series X: 10.73 GB\n-   PlayStation 4: 1.4 GB\n-   PlayStation 5: 1.34 GB \n\n## OPERATOR BALANCING\n\n### AZAMI\n\n-   Increased damage from High caliber Handguns and Revolvers by 10%.\n-   Increased damage received by Medium caliber SMGs and ARs by 10%.\n-   Increased damage received by High caliber ARs and LMGs by 5%.\n\n### IANA\n\n-   Added Impact EMP Grenade.\n-   Removed Stun Grenades.\n\n### LESION\n\n-   Gadget refill increased to 25 seconds (from 20).\n-   Initial damage reduced to 3hp (from 5).\n-   Added Observation Blocker.\n-   Removed Impact Grenades.\n\n### NØKK\n\n-   HEL Presence Reduction duration and cooldown increased to 30 seconds (from 20).\n\n### ORYX\n\n-   Remah Dash destroys Deployable and Talon Shields.\n\n### SENS\n\n-   R.O.U. Projectors increased to 4 (from 3).\n\n## GADGET BALANCING\n\n### IMPACT GRENADE:\n\n-   Damage reduced to 40hp (from 60).\n-   Reduced explosion radius to 2 meters (from 3).\n\n### BALLISTIC SHIELDS:\n\n- Explosion threshold to trigger the Guard Break reduced to 30hp (from 50).\n",
    "categories": [
      "patch-notes",
      "rainbow-six-siege"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6ZsfBMeGT0Anuu0IHjDQ0P/y9s13-patch-notes",
    "date": "2024-05-02T09:30:00.000Z"
  },
  {
    "id": "2D4HsYOBEEg0wEW5dim34o",
    "title": "Y9S1.3 Designer’s Notes",
    "abstract": "In this latest edition of Designer’s Notes, we'll go into more detail about the balancing changes that’ll come with the Y9S1.3 update and give you some insight into the reasons behind them.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6nFZmbGCCHQCzLvZcYZ5xm/952d10e172aa4d729dc3c1345158bbc8/R6S_Y9S1.3_DN_Header_960x540.jpg",
    "content": "In this latest edition of Designer's Notes, we'll go into detail about the balancing changes that'll come with the Y9S1.3 update and give you some insight into the reasons behind them.\n\n# BALANCING MATRIX AND TOP OPERATOR BANS\n\n## WIN DELTA VS. PRESENCE\n\n![[R6S] Y9S1.3 Designer's Notes - BalancingMatrix_Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/1H0duXV8jdyLwMlAezKuTT/c730bfcda3a554d1e879f28b433dd397/R6S_DN_Y9S1.3_BalancingMatrix_Attk.mp4)\n\n![[R6S] Y9S1.3 Designer's Notes - BalancingMatrix_Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/3OZDhHOQZIJYgXOFSzmLy7/832225d58e00bb16ab89535fc792a8f1/R6S_DN_Y9S1.3_BalancingMatrix_Def.mp4)\n\n*Please note that we are using presence to gauge the popularity of an Operator. This notion had to be introduced to reflect the implementation of the pick & ban.*\n\n*Presence definition: pick rate of an Operator when not banned. Win Delta: The Win Delta is aggregated from Operator's Win Deltas per Bomb Site.*\n\n# OPERATOR BAN RATE\n\n![[R6S] Y9S1.3 Designer's Notes - BanMatrix_Att](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/2Kz10nJLxFxVDnQp0QZmIG/027cf536c1677a96afb175b645169772/R6S_DN_Y9S1_BanMatrix_Attk.mp4)\n\n![[R6S] Y9S1.3 Designer's Notes - BanMatrix_Def](//staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/4DSqscAWaKFqYpQQDAHZbU/fee22ba6e91571da95eb8490384ab43c/R6S_DN_Y9S1_BanMatrix_Def.mp4)\n\n# MESSAGE FROM THE TEAM\n\n*As observed in the Balancing Matrix, there has been a significant increase in the presence of certain operators. However, despite this shift, their performance statistics do not raise any immediate concerns. Consequently, we have decided not to make any adjustments to the sights distribution in this patch.*\n\n*It's essential to recognize that the graphs presented reflect only a small segment of the Ranked player base. Below those ranks and across the broader player community, the presence of these operators is considerably lower.*\n\n*Their presence was higher at the beginning of the season and gradually declined to the numbers you see right now. This downward trend suggests that these operator choices are driven more by novelty than by overwhelming strength. We observed similar patterns during the 1,5x era, and based on tests conducted over the past year, we prefer a cautious approach rather than immediate reaction because the system is still too new. We believe maintaining the current distribution throughout the entire season won't compromise the overall balance.*\n\n*Additionally, prematurely removing these operators could prompt players to swiftly switch to the next operator equipped with Magnified Scope. Such a shift might adversely impact the balance of other operators that have not received as much attention and are currently in a good position. Hasty removal would not allow sufficient time to thoroughly evaluate all the pros and cons of the new sights, especially considering that nostalgia and novelty are still influencing the decisions.*\n\n## OPERATOR BALANCING\n\n* * * * *\n\n### AZAMI\n\n#### KIBA BARRIER\n\n- Increased by 10% the damage received by High caliber Handguns and Revolvers.\n  - Handguns: .44 Mag Semi-Auto, D-50\n  - Revolvers: .44 Vendetta, Keratos .357, LFP586\n- Increased by 10% the damage received by Medium caliber Submachine Guns and Assault Rifles.\n  - Submachine Guns: K1A, P90, UMP45, Vector.45 ACP\n  - Assault Rifles: 416-C Carbine, 552 Commando, 556XI, AK-12, AR33, AUG A2, C7E, C8-SFW, Commando 9, F2, F90, G36C, L85A2, PARA-308, POF-9, R4-C, SC3000K, Type-89\n- Increased by 5% the damage received by High caliber Assault Rifles and Light Machine Guns.\n  - Assault Rifles: AK-74M, ARX200, M4, M762, Mk17 CQB, Spear .308, V308\n  - Light Machine Guns: 6P41, ALDA 5.56, DP27, G8A1, LMG-E, M249, M249 SAW, T-95 LSW\n\nThe weapon base damage, the damage drop-off curve, the distance to the barrier, and the barrier resistance are just a few of the variables we need to consider for the +100 weapons available when balancing this system. We were already aware that the Kiba Barriers might still require too many bullets to be destroyed by certain weapons. However, we wanted to be cautious not to render the barriers completely ineffective now that every operator will be able to deal with them. As a result, we opted for an initial release with barriers that remain robust. Our plan is to iterate, seeking the optimal balance while closely monitoring the impact of each adjustment.\n\nDespite the data is showing that the new feature is being utilized, the lifespan of the barriers hasn't significantly changed. This suggests that Attackers continue to face challenges when dealing with them. Explosives and melee attacks remain the primary methods of destruction, making the risk associated with shooting at a barrier still high enough to favor the use of explosives.\n\nUpon analyzing the damage received by the barriers during destruction, we observed that Designated Marksman Rifles perform exceptionally well against them. Consequently, our focus will primarily be on increasing the damage received from Assault Rifles and Light Machine Guns. The additional weapons mentioned here are affected for the sake of consistency, as they share the same caliber configuration.\n\n### IANA\n\n#### LOADOUT\n\n-   Secondary Gadgets: Added Impact EMP Grenade. Removed Stun Grenades.\n\nConsidering her ability to bait defenders and facilitate re-frag opportunities for teammates following the hologram, she should be an excellent operator choice for support players. Additionally, her infinite intel gathering resources make her particularly advantageous in the current situation, where drones are limited. Therefore, we will enhance her support capabilities by incorporating Impact EMP Grenades and maybe look into the Gemini Replicator in the future.\n\n### LESION\n\n#### GU MINE\n\n-   Initial damage: Reduced to 3hp (from 5).\n-   Gadget refill timer: Increased to 25 seconds (from 20).\n\n#### LOADOUT\n\n-   Secondary Gadgets: Added Observation Blocker. Removed Impact Grenades.\n\nSince the removal of cloaking from his GU Mines, we've observed positive changes in his performance. Despite the uncloaked mines, the number of mines triggered per round has remained relatively stable, resulting in higher average damage than initially anticipated.\n\nTo maintain the core essence of the GU Mine, we have made a slight reduction in its initial damage. Our intention is to emphasize the urgency of removing the mine and the fear associated with encountering another one. Rather than an immediate kill, we aim to create a strategic window of opportunity for players to engage with the enemy.\n\nLesion's increased resources allow him to exert significant map control very quickly and block attackers' access to the building from very early in the round. Consequently, we've extended the time required to acquire the mines. While this may reduce early-round map control, it ensures Lesion's continued impact in late-game scenarios. He remains a priority target for attackers.\n\nRegarding secondary gadgets, we believe that the GU Mines should be enough for slowing down Ballistic Shields and the Impact Grenades give him too much flexibility. So we are going to change them for the Observation Blocker, which also synergies well with its primary ability providing extra protection.\n\n### NOKK\n\n#### HEL PRESENCE REDUCTION\n\n-   Duration: Increased to 30 seconds (from 20).\n-   Cooldown: Increased to 30 seconds (from 20).\n\nThe recent changes to Frag Grenades, along with increased operator access, have had a negative impact on Nokk's presence.\n\nTo mitigate this issue while we investigate other solutions to make her more impactful, we will be increasing the duration of the HEL Presence Reduction. This adjustment will allow Nokk to traverse bigger areas more comfortably without being detected in defenders' cameras and catch them by surprise.\n\n### ORYX\n\n#### REMAH DASH\n\n-   Will destroy Deployable and Talon shields. The dash is not interrupted.\n\nWe are updating the Remah Dash to improve comfort and consistency. From now on, Deployable Shields and Talon Shields will no longer impede Oryx during the dash; instead, they will be destroyed and he will go through. This adjustment aligns with player expectations, especially considering Oryx's existing ability to pass through Kiba Barriers and Reinforced Barricades.\n\n### SENS\n\n#### R.O.U. PROJECTOR SYSTEM\n\n-   Max. Resources: Increase to 4 R.O.U. Projectors (from 3).\n\nDespite the numerous improvements to the POF-9 and the additional utility that brings, Sens continues to underperform. We acknowledge the intricacy and skill required to use the R.O.U. Projectors effectively. The unpredictability of bounces can sometime work against you. We hope the new Trajectory Previsualization can help to improve accuracy, but we are going to allocate additional resources to enhance flexibility and provide more opportunities for error correction while we keep investigating new ways to improve it.\n\n# GADGET BALANCING\n\n* * * * *\n\n## IMPACT GRENADE\n\n### EXPLOSION\n\n- Damage: Reduced to 40hp (from 60).\n- Radius: Reduced to 2 meters (from 3).\n\n### OPERATORS AFFECTED\n\n- Azami\n- Caveira\n- Clash\n- Echo\n- Goyo\n- Maestro\n- Melusi\n- Rook\n- Valkyrie\n- Vigil\n- Wamai\n\nWe recognize the growing significance of Impact Grenades over the years. They play a crucial role in site setup, facilitate defenders' swift rotations, aid in clearing attackers utility, deny walls, and even eliminate adversaries. However, we acknowledge their excessive versatility, which prompts us to address their killing potential and wall-denial capabilities.\n\nWe have implemented a reduction in damage. As a result, double-impacting an enemy will no longer result in an immediate kill. Also, opponents must be even more damaged to employ a grenade to secure the elimination.\n\nThe reduction in explosion radius will yield two key effects:\n\n1.  Impact-Tricking countermeasures: Attackers can prevent it by positioning the hard-breach device as close to the ground as possible in additional locations, And defender must be more accurate to do it successfully.\n2.  Precision requirement for utility clearance: Defenders must exercise greater accuracy when dealing with attackers' utility, such as Airjabs and Claymores. This adjustment allows attackers to place more reliance on this type of gadgets and experiment with unexpected placements.\n\nOur intention is to promote the use of the right tool in the right situation, rather than relying solely on something that can serve multiple purposes. Defenders have other tools at their disposal that can achieve these objectives more effectively. Our final goal is to enhance tactical gameplay and reward the correct decision-making in every match.\n\n# WEAPON BALANCING\n\n* * * * *\n\n## BALLISTIC SHIELD\n\n### GUARD BREAK\n\n-   Explosion: Trigger threshold reduced to 30 damage (from 50).\n\n### OPERATORS AFFECTED\n\n- Blitz\n- Fuze\n- Montagne\n- Clash\n\nOur goal is to ensure that the Impact Grenades remain effective counters against Ballistic Shields. Because of the recent damage change, we find it necessary to adjust the threshold for breaking a shield owner's guard. \n\nThe guard break system relies on the damage received, and it's important to note that no other explosives have undergone alterations. Consequently, other explosive devices will now create larger openings than before.\n\n* * * * *\n\nFollow us and share your feedback on [X](https://twitter.com/Rainbow6Game) and [Reddit](https://www.reddit.com/r/Rainbow6/).",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 9,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/2D4HsYOBEEg0wEW5dim34o/y9s13-designers-notes",
    "date": "2024-04-30T13:00:00.000Z"
  },
  {
    "id": "3snO7ANe2VLZYitMeP2eqc",
    "title": "Reputation System Beta: Status Update",
    "abstract": "Reputation System Developments in Year 9.",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/6Sov86Js8p3e8gLeuVSXWQ/497134ec303da98abb9d350c59a26fab/RepSys.Y9S1.960x540.png",
    "content": "In Y9S1 and beyond, we'll continue to update the Reputation System Beta to ensure its accuracy before any Standing Impacts go live.\n\nThis season, we've made several changes to the Reputation System. In this article, we'll share more on what these changes mean and how we plan to continue improving this system.\n\n## Y9S1 - POST LAUNCH LEARNING\n\nFollowing the Y9S1 release, it became clear that certain aspects of the Reputation System were not working as intended. Our teams gathered and analyzed player feedback while completing internal investigations, leading us to identify issues affecting the player experience.\n\n### COMMUNICATION PENALTIES - VOICE & WRITTEN\n\nWe found that players were receiving communication penalties at a higher rate than expected. In response to this, a decision was made to disable the voice chat and written chat penalties. These communication penalties will remain disabled until we can implement further levers to ensure that all penalties given are fair, while also providing players a clear path to improvement.\n\nOn consoles, we were made aware of another issue which led to increased voice chat reports being visible in the Reputation Center. We also found that in some cases, misconduct such as Griefing or Voice Abuse was incorrectly labeled as \"Excessive\" in the Reputation Centre. A fix was released addressing these on March 21<sup>st</sup>.\n\n### COMMENDATION EFFECTS\n\nAfter season launch, we became aware of an issue affecting the speed at which Commendations would be reflected in a player's Standing, resulting in lower Standings for many players. Commendations are now affecting Standings promptly and correctly.\n\n## Y9S1 - REPUTATION SYSTEM UPDATE\n\n### STANDING DEFINITIONS & BALANCING UPDATE\n\nWith the launch of Y9S1, we implemented our latest balancing update for the Reputation System. Here we used the built-in weights and levers to better define the attainment of each Standing, aligning more closely with our intentions. The five bracket Standings were also redefined to provide more meaning to each of them.\n\nThe aim behind system balancing is to ensure that your Standing mirrors your actions. Right now, many players will find themselves in the Respectable bracket. Being in Respectable is a great place to be and should be the aim; it means you're the core of the Siege community, you're not detracting from others' experiences, and you're playing with care, making Siege enjoyable for players around you. Some players with consistent positive behavior might also enter the Esteemed and Exemplary brackets, but maintaining these can be more challenging.\n\nLooking at the two lower brackets, falling into Disruptive doesn't necessarily mean your behavior is always negative, but it does indicate that you're not playing to the Siege ideals overall. With some effort, the Respectable Standing can be achieved. However, if a player finds themselves in Dishonorable, it means there are clear negative trends. In these cases, players need to adjust their behavior and remain consistent to improve their Standing and experience for the community's benefit.\n\n## WHAT'S NEXT?\n\n### MORE LEVERS, MORE CONFIDENCE\n\nWe've learned a lot since the Reputation System entered, in Y8S4, in its grace period and we're continuing to integrate those learnings to ensure that the Reputation System is fair, resilient, and understandable for all players.\n\nWe are currently making progress in incorporating protections that make a player's Standing more robust, going beyond reacting to player reports, and instead using additional factors. These improvements are directly driven by the feedback you have shared with us.\n\nOur work continues so that we can develop further levers that will enable us to reactivate the communication penalties. We want to ensure that our system applies penalties only where necessary, and that players have a full understanding and trust in the Reputation System.\n\n### STANDING IMPACTS & RELEASE STATUS\n\nThanks to your feedback, it's became clear that large changes are needed in order for the Reputation System to meet the requirements that we've set. With this in mind, Impacts based on your Standing will be no longer be introduced in Y9S2 and will instead come in a later season. Consequently, as the Reputation System will not see its full release in the coming season, it will remain in Beta for now.\n\nWe'll be sharing more information soon on when you can expect to see Impacts and the full release of the Reputation System. The deployment of Impacts will also be announced ahead of time so that players can be prepared. Once this feature does go live, we'll be monitoring the system closely and listening to your feedback on the update.\n\n## CONCLUSION\n\nThe Reputation System will continue to retain its Beta status, reflecting its current form as we continue to make improvements and collect further feedback. Our priority will be to ensure that everyone is confident in the state of the Reputation System as we focus on reducing toxicity and making Siege a fun and enjoyable game for everyone.\n\nWe aim to continue to provide transparency and responsiveness around this system, and as we move forward, we want to keep hearing about your experiences. We're always listening as we work to provide a safe community.",
    "categories": [
      "rainbow-six-siege",
      "toxicity",
      "dev-blogs"
    ],
    "readTime": 5,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/3snO7ANe2VLZYitMeP2eqc/reputation-system-beta-status-update",
    "date": "2024-04-19T15:30:00.000Z"
  },
  {
    "id": "6r7w3uI79e9NepbNoimFra",
    "title": "Y9S1.2 PATCH NOTES",
    "abstract": "See the upcoming changes to Rainbow Six Siege with the release of Y9S1.2!",
    "thumbnail": "https://staticctf.ubisoft.com/J3yJr34U2pZ2Ieem48Dwy9uqj5PNUQTn/7wjVhdq5CnLkSXGKrE85IK/eb1e2f857d63f096ed0389d585539fd6/Y9S1.2_PatchNotes.960x540.jpg",
    "content": "See the fixes here coming in Y9S1.2.\n\n## Y9S1.2 PATCH SIZE\n\nFind the download sizes for each platform below.\n\n-   Ubisoft Connect: 918.5 MB\n-   Steam: 479 MB\n-   Xbox One: 0.77 GB\n-   Xbox Series X: 2.1 GB\n-   PlayStation 4: 1.44 GB\n-   PlayStation 5: 929 MB\n\n## BUG FIXES\n\n### GAMEPLAY\n\nFIXED - Rappel breaks when used at the distance limit and then walking backward during animation.\n\nFIXED - Incorrect default sight attachment shown for Fenrir's SASG-12.\n\nFIXED - Barbed wire requires more shield-melee attacks to be destroyed than intended.\n\nFIXED - Shield position that player and enemy Operator see becomes desynched if free-look is used before shield realigns itself.\n\nFIXED - Aruni's Surya Gate doesn't deactivate for friendly Operators when placed close to stairs.\n\nFIXED - Camera clips through player when using free-look and going prone next to a wall.\n\nFIXED - Deimos' DeathMARK icon disappears when Deimos or enemy Operator enter a field that deactivates electronic devices.\n\nFIXED - Free-look breaks if players look right and use free-look multiple times.\n\n### LEVEL DESIGN      \n\nFIXED - Unintended line of sight can be reached using Azami's Kiba Barrier to vault on top of an air hockey table at 1F Storage in the Theme Park map.\n\n### AUDIO\n\nFIXED - Gameplay audio is muted during End of Round replay, end of match, and kill cams.\n\n### OPERATORS\n\nFIXED - Spectating doesn't display Deimos's ability properly when reconnecting to the match.\n\n### USER EXPERIENCE\n\nFIXED - Placeholder asset displayed for multiple uniform rewards in the Uniform view page of the Battle Pass progression menu.\n\nFIXED - Tutorial control guide menu pops out when toggling the ping target in Map Run.\n\nFIXED - Operator bundles are not shown correctly after purchasing unless the player leaves then re-enters the operator album screen.\n\nFIXED - Operator portrait is displayed offset in the Loading screen of Free For All sessions.\n\nFIXED - Deimos' DeathMARK probe and laser don't display team color settings.\n\nFIXED - Operator Guide content doesn't load properly when using the scroll bar.\n\nFIXED - Camera shakes more than intended when entering rappel.",
    "categories": [
      "rainbow-six-siege",
      "patch-notes"
    ],
    "readTime": 2,
    "url": "https://ubisoft.com/en-gb/game/rainbow-six/siege/news-updates/6r7w3uI79e9NepbNoimFra/y9s12-patch-notes",
    "date": "2024-04-09T09:30:00.000Z"
  }
]